{"gender": "male", "age": "52 y.o.", "location": "Tabor, IA 51653, USA", "status": "widowed", "username": "Merl1970", "ethnicity": "white", "occupation": "Retired", "description": "I’m an old fashioned man who loves to spoil the one he’s with. Opening the door isn’t something that is dead, and flowers aren’t just for Valentine’s Day or special occasions. Winning the heart of the woman you love doesn’t end with marriage, it’s an almost daily occurrence. I believe good manners and grammar still matter, even in texts. I try to live by the golden rule “treat others the way you want to be treated,” but I am not perfect. I love road trips and looking forward to travel around the country. I’m retired Navy and have been to 19 countries, and have plan on increasing that number. I have three grown children and three grandsons I just adore. So I’m looking forward to them being old enough to travel with me. \n\r\nI enjoy the quietness of living in the country. My town doesn’t even have a stop sign on the road going through it. I grew up in Detroit and was stationed in a few big cities. I just don’t like city living anymore. I’d describe myself as a pretty average guy. I’m only 5ft 8in, so I’m not too tall, definitely wish I was taller; I think that’s why I like my cowboy boots. I have three grown children and three grandsons I love to death. \n\r\nI’m looking for my best friend, confidant, and lover. Someone who I just enjoy being with no matter what we are doing. A person who just automatically glides next to me as we walk and we naturally just grab each other’s hand. My faith plays a part in my life, and would be a part of any relationship that I have. I enjoy going to church with the person I’m seeing. I’m Christian and go to a nondenominational church. I learned that having a similar basic belief structure just made for a stronger relationship. I’ve seen a lot of liberals say they want nothing to do with conservatives, so just to be forthcoming I am a conservative. Well that’s about it for now, I’ll add more as I think of it.\n\r\nIf you have only one picture, or only pictures with filters I probably won’t reply.", "match_age": "from 19 to 86", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "never", "intent": "Romance, Serious Relationship, Marriage"}