{"gender": "male", "age": "35 y.o.", "location": "London, UK", "status": "single", "username": "Richie_valentin", "ethnicity": "mixed", "occupation": "entrepreneur", "description": "I know i do not have a profile picture, as most can be fake therefore its better we get to know each other and eventually we shall see each other, a person does not come dressed in red cape But as everything you have ever wished for… This is me, I am most passionate about, taking care of others, helping people, and making people smile. Yes, I know that sounds cheesy but I try really hard to brighten the day of everyone I meet, even if it’s just by asking a cashier how they are or holding the door open for someone. I try to always think about that quote by the Dalai Lama: ‘Be kind whenever possible. It is always possible. ’ Hello girls thanks for stopping by. I’m a creative, fun-loving, energetic and active BOY or shall i say Man, whose favourite words in any language are ‘Please proceed to your gate for departure’. I’ve been bitten HARD by the travel bug lol.. . and have been lucky enough to visit every continent (well, I’m working on most. I love going out, meeting new people and generally getting the most out of life whether that’s trying new bars and restaurants or picking up a new sport, love swimming, running, jogging and, oh yes i love my sports i am a martial artist, love combat, the art of self defense as one of my favourite quote by bruce lee ‘As you think, and shall you become’. BUT girls i adore, i respect and worship like the angels, i am soft like the petal of rose and when it comes to womens i can smell the fragrance from milestones, my knee trembles, body shakes, heart beeps and my hormones grow, the taste of cherry rows and their looks are like the ablazing stars that how i feel when it comes to women, But i also believe beauty is not through the apparel that decorates us, true beauty is from knowledge and manners. So looks are partly important but substances are what decorates us!!! . I love nature and animals, astrology has always been an inspiration to me and spirituality is another but what determines a person's success is the belief he instills and keeps working towards his goals until he reaches the true destination of his existence which will determine the total outcome of the desired result. I love reading various books and do not have any particular taste anything that interests me from a sentence might flow through my veins, reading brings knowledge and knowledge is power, the power to know and learn and understand but also the power to dream, stories inspire us to reach high, love deep above all every book allows us to dream a new dream! ! I love solving puzzles and also love playing chess at times, although i have not played for a while, i love creative cooking and being active with house works. I love comedy show movies, and love historical series as such my favorite ‘KURULUS OSMAN’. I never mentioned at the beginning of my sentence that yes, by life I am a business oriented person more like an entrepreneur. I travelled to various countries and conducted business relationships, I do not worship money but I respect the value it holds. Money does partially motivate me but above all a rabbit hole is what distinguishes me. Walls are created of steel and now I am on the bridge gazing at the star where my journey begins, a rose that grew out of concrete…. .\n\r\nI am looking for a person whos admired for who she is, not just her shiny necklaces or designer shoes but she is creative thinks for herself and speaks her mind, down to earth open to exposures and love to experiment different dimensions I’m definitely looking for someone who is in love with life and open to exploring all its possibilities. Travel is a really big part of my life and I’d love to meet someone who wants to join me on my many adventures. I’d definitely like to start a family one day, so I’m looking for a girl who’d also like to raise a couple of beautiful, multilingual, adventurous kids well just a saying but let's see. You should shoot me a message if you’re fun-loving, and up for anything and we shall see where our journey begins. .", "match_age": "from 19 to 86", "children": "want children", "orientation": "Straight", "religion": "Other", "smoking": "social smoker", "drinking": "social drinker", "intent": "Fun, Friendship, Romance"}