{"gender": "male", "age": "70 y.o.", "location": "Virginia Beach, VA, USA", "status": "separated", "username": "MasterMykeVaBch", "ethnicity": "white", "occupation": "semi retired, started a delivery service", "description": "Hi there! My name is Myke. I live in Virginia Beach, VA. I am over 60. I am semi-retired. I own my own home and vehicle (lol so many women tell me about their guy friends living in their parent's basement, I figure this could be a bonus!) I am not your typical guy, I do have some...let's say \"kinks and quirks\" that you can get to know as we get to know each other better. I like to watch crime tv shows, listen to popular music, I am a comics fan, and enjoy watching movies too. I work part time doing deliveries to keep myself busy, and love gardening too. I have a prize rose bush in my front yard with a koi pond for quieter moments. I am a scorpio, my favorite season is fall, my favorite color is pink. \n\r\nI am looking for a woman, to date in person, and get to know, so that eventually I can continue to grow with someone on this fascinating journey thru life. I am ultimately seeking a lovely lady between 30-40 (give or take roughly) that I can create a family with, as I have had my time of success in business, and want to slow down (a bit..not entirely as I have a lot to still offer to the world!) and smell more of the roses. \n\r\nWhat are my preferences? Everyone has them, and no one should be critiqued for them. I love women of all sizes and shapes but as I have had a few car accidents and surgeries along the journey, I believe I can be a better lover to a petite to medium sized woman. Don't get me wrong, I love thick women...but I am not sure how I will handle one now in more intimate moments and positions. You will find that I am very upfront and honest, as I don't want to waste anyone's time. Life is too short to do that. That being said, if you are a scammer...please just skip me and move on to your next target. I have probably already talked to you and smoked you out by now. LOL If you are a genuine person however...keep reading.\r\nI DO have a \"thing\" for exotic women...latin women...island women...love a strong woman who can hold her own in life but knows who her heart and soul belongs with and to at home. I also enjoy a woman who likes women as well. I am open to a poly relationship, but I am seeking my primary first and foremost. If a second never arrives, it will not matter to me, as I have been there and done that...could most definitely write a book about it! Would probably sell better than 50 Shades of Grey...for all the same reasons lol not to mention...that was romance drivel. As far as that goes, I have been a part of the BDSM community for more than 40 years. I have managed a poly family of more than 5, and earned the title Master with them. Although I still ache for those moments at times, I have settled a bit with time, and now see myself as a Dom more than a Master. Master is a term that I can still use, but only with one that deserves to utilize it. I am definitely not a member of the Ddlg community, but I understand and respect it. One of my very best friends is heavily involved in that community, and should we decide to progress...you will be vetted by her. I trust her implicitly. Everyone should have friends that can help them see a bigger picture, and be an objective assistant that will help your life grow. We are very close as only platonic friends, she lives with me with her two young daughters, so you can ask her about how I am with kids! She is a S/switch but I am seeking someone clearly submissive. \n\r\nDo I want kids? Yes. Kids of my own. At least one. That is the one job I have always wanted but never got. So if that is not something you want in the future, I wish you the best. \n\r\nWhy am I not taken and on a dating website? Great question! I was married...and she decided to follow down a different path that no longer included me, or men. So, I am back on the market! I will also be honest that the divorce is not final, but I have no interest and neither does she in going back to being married together. We are clearly looking for different things in life at this point.\n\r\nIf you are still reading, it can't hurt to reach out and at least make a new friend. We can all use more of those. There has to be some interest at this point right? I look forward to hearing from you!", "match_age": "from 21 to 45", "children": "want children", "orientation": "Straight", "religion": "Christian", "smoking": "social smoker", "drinking": "occasional drinker", "intent": "Fun, Friendship, Romance, Serious Relationship, Marriage"}