{"gender": "male", "age": "58 y.o.", "location": "Austin, TX, USA", "status": "single", "username": "GaryF", "ethnicity": "white", "occupation": "Marketing", "description": "I truly enjoy the company and companionship of a woman. If we can sit alone for hours and be captivated by just talking and watching each other, then it is real! Yes, I am a hopeful romantic who needs affection - receiving and giving. \n\r\nI am attracted to intelligence and humor and also sensual women who have a good understanding of who they are and what they want out of life, and have ease in communicating their feelings, wants, desires, and fears. Keywords: Intriguing, alluring, smoldering, funny, kind, honest. I am well-traveled and plan to continue. \n\r\nI enjoy all art forms and am also an artist in multiple mediums. I currently make my living as a Chief Marketing Officer and also as film producer-director, within the high technology entertainment marketing arenas. I am well read and also have a highly developed sense of street smarts (Boston NYC). \n\r\nSo yes, I am opinionated, passionate about everything I do, and understand loyalty and integrity. Laughing is critical, and maintaining a healthy balance daily is also important to me. I do not engage in the single' bar scene, juggle relationships, or tolerate dishonesty--life is too short, and time is too precious. I love people and work hard to maintain relationships with those I care about. Family and friends are near and dear to me. My Parents were married for 63 years!! \n\r\nMy perfect dream scenario: Austin and a villa in Tuscany close to Firenze, a wife who I adore and makes me weak just at the thought of her. Family, friends, music, art, debate, discussion, good food, wine. I would have my studio close by, writing and directing the script swirling in my head and filming across Europe. My wife will be my closest friend, and my family is my greatest treasure. My Mother is my best friend, and my son means more to me than words can describe. \n\r\nHmm, who am I seeking? You have your life on track - does not have to be perfect but it should be moving. You take care of yourself. You allure me (I allure you). You are not too scarred from past relationships (remember: I am not him). You are motivated and curious about learning and discovering. You are a happy person and you like people. Romance, playfulness, seduction and intrigue sprinkled with adventure are our favorite pastimes and applied to everything...even the mundane. You have goals and hopefully I am one of them! \n\r\nYou are moved by the small things and little considerations. You are active and physical. You're a comfortable chameleon in diverse social situations, but probably prefer jeans and a t-shirt and down time too. Have I mentioned feminine, nurturing, passionate and sensual? I've got the masculine side covered, not looking for any additional traits there. \n\r\nYou adore my son who is 17 years old as of this writing, and he adores you (I am not looking for a substitute mother, but you MUST possess those critical values). I believe in soul mates, I believe in love at first site, and hopefully life has not taken these romantic notions from you. As I said earlier in this profile, I know who I am, and I've spent the time and energy looking inward to be in a place of personal peace. I am also fully aware that finding yourself is the first step in finding true companionship along with patience and an appreciation of timing! \n\r\nSo, as I stuff this letter into the bottle and cast it out to sea, to whomever finds this; know I do not need to be rescued - just someone to share the island with!! If you have gotten this far are you Her? \n\r\n- I realize that some people use this site to socialize and as a means to meet and correspond with many people. For clarity, I have no desire to swap emails for extended periods of time. I am interested in expressing mutual interest in each other and meeting in person to see if there is actual attraction and genuine chemistry. Lastly, I am what I describe above, and look like my photos, please be the same. In short: Nice Guy looking to meet Nice Girl...fall deeply in love - Simple Right?", "match_age": "from 42 to 56", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "social drinker", "intent": "Romance, Serious Relationship, Marriage"}