{"gender": "male", "age": "53 y.o.", "location": "Seattle, WA, USA", "status": "divorced", "username": "loufern", "ethnicity": "mixed", "occupation": "Finance", "description": "I am divorced, single, no kids living with me. I spent most of my formative years in Europe, then moved to the USA. I am kinda new to the area. As a whole I am pretty easy-going, but am serious about the important things in life. Finding balance is key. Family is very important... then friends.. etc.\r\nLove people, family, not a great sports lover, not a gym rat or mouse... or anything... I keep fit be being active. e.g. walking, hiking, tennis, swimming.. then chill Got a sense of humor. i.e.. sarcastic at times But mainly dry.. but a sense nonetheless!! \r\nHmm, physical, mental / emotional health all good. Love the outdoors, staying active, love 2 travel, enjoy the arts, but can stay in too.I am not looking for you to make my life complete, whole etc.. I am looking for a great friend, partner... someone who wants to share their life with me and vice versa. To enjoy this journey together and make special memories to bind two hearts and souls. Anything else? Doggone.. you need more??? Just ask...\r\nOh, BTW.. divorced, just my shadow, great memories, wonderful dreams and the joy of life to keep me company.. \n\r\nLooking 4\r\nThe lady I am wanting to share life with, to spend time with must be honest, loyal, have a great sense of humor.. romantic, You will be smart, adventurous, love 2 travel, but equally happy staying home, drama free and able to balance the blended family needs.\r\nYou value our relationship but recognize the import of family, friendships. A relationship where love, kindness, mutual respect live. no thrive, where spontaneous conversation comes easy, with appreciation for each others individuality. As this is not our first rodeo, we all have \"baggage. I buried mine, but I will dammed if it does try to make an appearance every now and again. However, the post office does not have a forwarding address.! So please be SINGLE and drama free.... \r\nWe compliment and balance each other, and sensitive to each other's needs even if it's wants / desires that masquerade as needs i.e. romance! LOL \r\nBe my best friend, let's share our lives together. The rest will follow…\r\nWell that’s about the gist of it...", "match_age": "from 30 to 50", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Spiritual", "smoking": "non-smoker", "drinking": "social drinker", "intent": "Romance, Serious Relationship, Marriage"}