{"gender": "female", "age": "43 y.o.", "location": "Salvador - State of Bahia, Brazil", "status": "single", "username": "Patybelabrasil", "ethnicity": "hispanic", "occupation": "Teacher", "description": "Well trying describe about ourselves I can say it is a little bit complicated but I will try it. I have graduated in Languages Art, Iam English, Portuguese and literature teacher. I speak my mother language portuguese, english, spanish and also sign language, I used to work with deaf kids too.\r\nFor me to be a teacher is an honorable job, because I know I can make a difference in someone’s life. In some reason, I still studying english language because some dayI wanna become a translator, and work as interpreter . \r\nActually, people used to say that: I am very kindheart and positive girl because most at all the times I try to seening the best of life regardless of the ircumstances or situation by which I think that what is always teach us a positive lesson. \r\nOf coruse I could tell I have many flaws, but I know life is worth the struggle when I look back on what I lost and realize that what I have now is much greater. \r\nI do not like talking to with somebody behave as a “drama King”, or complain about their personal problems all the time, please, everybody has problems, just try solving it in your best way or attempt to learn how to deal with it, and live your life the best way because our lives is too short and we did not know what the future has prepared for each one of us. Sometimes we are so much selfish with ourselves and forget that has many people around the world living in the worse situation starving, homeless and They are just begging to have a little dignity to live. Well unfortunately, I cannot save the world but at least think about those people and stopping complain about what I had earned in my life.\r\nI also ejoying my life keeping studying, reading, watching a great movie, listening to 80’s music, ice skating, animals, the nature, go to camping, to do volunteer jobs and talking about all sorts of issues even politics, even if we do not have the same point of view, I like to keep my brain work out all the time, in the matter of fact in my opinion \"Education is the key to success in life, and teachers can make a lasting impact in the lives of their students.\" \r\nI am from Brazil, I live by myself since I was 17 years, I am harder worker and independent woman, I already have my own place, that it is already payed off. For me being in this website, I will be very straightforward, I am here in this page, because I wanna practicing my english skills and also I believe that has someone very “kindheart and humble” out there waiting to give an opportunity to know each other, and maybe, we become a great friends and work out together. \r\nI really would like to clear something up, and be very honest about to be here in this site: I AM NOT here in this page to ask men to pay my bills, send me money, or rescue me, because I live in a poor country. and I am not desperate to move into your country for me to get a free, easy and best life.\r\nA I have already told, I’m self-sufficient woman and “I DO NOT NEED MAN TO PAY IT OR THAT FOR ME” because I can get by myself as well. what I can say more about me is I am as well world traveled, and I have been different places in Europe for many times, also I've lived in Texas- USA for a few years, if I would like to have had a easy and good life with a richer man, believe me, I could already done it because I had many opportunities before but I prefer to believe that the older values my mother had taught me is the best way to get success in life and mainly in love. My grandfather always used to tell me to be honest with myself first, and” treat people they way you would like to be treated”.\r\nWell I think I had said enough about myself. I hope you all could like my profile and I had tryied as much as I could be honest!!", "match_age": "from 19 to 86", "children": "no children", "orientation": "Straight", "religion": "Other", "smoking": "non-smoker", "drinking": "social drinker", "intent": "Romance, Serious Relationship, Marriage"}