{"gender": "male", "age": "58 y.o.", "location": "Mendoza, Capital, Mendoza, Argentina", "status": "single", "username": "juanheredia", "ethnicity": "hispanic", "occupation": "profesional independiente", "description": "Nací en Mendoza Argentina, crecí en una familia común, 4 hermanos así me forme DE TRATO SIMPLE, me fui haciendo de apoco SIMPATICO, Estudie, primario secundario y Universidad y me hice muy SOCIABLE. Conocí un insólito e inquebrantable grupo de amigos y sutilmente me integré a la simple actitud de ser SOLIDARIO. Experimente el trabajo profundo de verme a mi mismo junto con mis amigos de sentimiento humanista por lo que me voy transformando día a día en NO VIOLENTO, con mi juventud y madures transito en la asombrosa actividad social, solidaria y no violenta advierto que con todo ello que soy indeleblemente ALEGRE, eso me hizo darme cuenta que tenia que vivir TRANQUILO, no obstante, me revelé de apoco que tenía que ser en todos los ámbitos un hombre PENSANTE, y en todo lo que expreso en mis actividades me distingo por ser muy EFUSIVO. Me apareje varias veces naciendo de ellas 2 hijas, así vislumbré que soy SEDUCTOR, Luego los amores que se deslizan, en mis noches de bohemia, me denuncian que soy un arquetipo VIRIL, Vivo actualmente solo y me manifiesto con la rutina del conocimiento que me demuestra ser ALGO SOLITARIO. Así la posibilidad de una concluyente pareja y el tiempo quizás dejen que renazca en mi pensamiento la idea de dejar de ser A VECES ALGO ERMITAÑO….Para unirme A UNA GRAN MUJER que pueda cerrar el libro de mis días junto a ella.. Por eso a ella LE DIGO, a la que me quiera acompañarme con la belleza de su ser. Una de mis aspiraciones es: Siente el calor del sol, mira el brillo de la luna, y respira el aire de la montaña, ASÍ con el más profundo de tu deseo, imaginarás lo que és “El amor perfecto”. Luego, cuando leyendo libros no encuentres tu búsqueda… Sé que Pensarás en el aroma de néctares olvidados en el mundo de los recuerdos,,, Sentirás la noche mas bella,,, y SI en mi regazo, anhelas tu último amanecer, Sabrás leer en mis ojos “El sentido del Amor”. Solo exprésame que,, JAMÁS EN LA VIDA DEJARÁS DE BUSCARME,,,, Haaa!!!! Y de ningún modo olvides... El pretexto más necio es culpar al destino.-", "match_age": "from 35 to 55", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Other", "smoking": "non-smoker", "drinking": "social drinker", "intent": "Friendship, Serious Relationship"}