{"gender": "male", "age": "48 y.o.", "location": "Lima, Perú", "status": "single", "username": "walt3rg", "ethnicity": "hispanic", "occupation": "DISEÑADOR", "description": "Have you ever MET a simple and confident man who loves animals and is filled with an incredible passion for life? So here I am; An intelligent and interesting person, who really wants to share everything exciting with someone good in life, in this amazing world. I am very serious in my search and I have things clear, loyalty, love and above all mutual understanding is the most important thing in a relationship. I am a generous man with great passion for details, and clear feelings.\n\r\nSo I describe myself as... An open-minded, generous and enterprising man! I am full of love! I always smile, even if I am in a bad mood or it is better to say that I am only in a good mood because our life is for fun and not for sadness. I like walking, the sea and nature, it is the only way to relax and be calm, the afternoons reading a book and listening to music are one of my great passions! I know how to cook and I am always willing to learn something new. I also like my job, which is design, it's very exciting, traveling to discover new places and I really hope to find my half, to be able to be part of it and want to form a good relationship. We can build what we want and what we want if we know exactly.\n\r\nA few simple words for the amazing person I hope to find on this site...\n\r\nI have no idea where I'm going\r\nnor where destiny takes me from.\r\nBut I want you to be by my side.\n\r\nYou will be the best written page;\r\nThat my destiny has written in my life,\r\nAnd now I know I was not wrong.\n\r\nand without hesitation I would give you everything,\r\nAnd if it didn't exist, I would invent it.\n\r\nWith you I want to grow old.\r\nWith you there are plenty of wishes,\r\nI don't ask for more because you are everything I long for,\r\nand if it's with you I'll stay\n\r\nIt is a privilege to have you in my life,\r\nThat just seeing you makes my day,\r\nAnd forever, I want to have you.\n\r\nthere will be no barriers to love you,\r\nbecause being together,\r\nthe universe will be in favor\r\nand everything will be perfect.\r\nI will enjoy your kisses\r\nI will be a fan of your body and the passion you give me.\r\nIt will be a pleasure to have you every day in my calendar.\r\nand everything will be easier because you will be with me my love.\n\r\nBlessings", "match_age": "from 19 to 25", "children": "no children", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "never", "intent": "Serious Relationship"}