{"gender": "female", "age": "56 y.o.", "location": "Cape Town, South Africa", "status": "divorced", "username": "Crissyvd", "ethnicity": "mixed", "occupation": "-", "description": "Ok… so let’s start I am a happily divorced woman and guess what.... I am a BBW which means I am a big beautiful woman and yes with lots of flaws and three beautiful grown up kids and two grandchildren. I’d like first to apologize for the typos I might have… I must confess I’m Afrikaans (I know… nobody’s perfect) and I’m pretty much new to dating sites. I thought I would throw some keywords that would describe what I like to do. If you recognize yourself in some of them, I think it might be worth taking the time to keep on reading my profile. If you don’t keep on reading, I swear I won’t be upset with you. I will never know anyway. Surprises, music, dancing, soccer, last minute plans, open mind, craziness, spontaneity, going out (but also staying in), sharing, simplicity, respect, flip flops (yes, the sandals), down to earth (however fantasy is also very important), people, casual, word, news, work, sense of humor about yourself, awareness. And yet another short list of things that I’m not fond of: – Self-centered people (but, hey… Have you ever heard anybody saying “yes, yes, I am definitely self-centered?” So, this one doesn’t really count!!) – TV (even if I like one or two shows and some movies) – Superficial people (but same problem as 1…) In addition, if you happen to pronounce the following sentences regularly, we’re definitely increasing the chance of a good match here: “Ok let’s give it a try” “To be honest, I don’t know” “I respect that” And last (I promise), if you think that Paris is the most beautiful city in the world, I think you should tell our parents to get ready for the wedding lol I am crazy, stupid, and charming.NOW THAT I’VE GOT YOUR ATTENTION……. You’re dealing with the ultimate lady. No matter what happens, at the end of the day I’ll make you smile, laugh, and wonder, “How come I’ve never met a girl like this before??!!”I love to listen to rnb music as I relax on my couch. I I hate it when men are “DROP DEAD HANDSOME” on the outside and “DROP DEAD GARBAGE” on the inside.I loooove to sing Luther Vandross songs. Also, I would love to be blessed with the man/friend of my life. Want to know more??? Well, that can’t happen unless you contact me. Hate playing games??!! Hate being told lies??!! Well, come on…I’M YOUR WOMAN!!!YOU NEED THIS in your life!!! PEACE & BLESSINGS!!! You still haven’t messaged me yet??!! LET’S GO…CHOP, CHOP!!!! (smile)", "match_age": "from 35 to 86", "children": "don't want children", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "occasional drinker", "intent": "Friendship, Romance"}