{"gender": "male", "age": "66 y.o.", "location": "Hartville, MO 65667, USA", "status": "divorced", "username": "HurtDad5150", "ethnicity": "white", "occupation": "-", "description": "I cannot imagine how many times I’ve attempted to fill out one of these ‘profile’ things on an app.\n\r\nIt seems like every attempt I make the contents of what I enter disappear just as quickly as the website transfers me to their “you must join to be a member” site and the half hour it took to enter real information about myself is lost with that transfer.\n\r\nThe truth is this:\n\r\nI’m an EX- Marine, a veteran who despised himself for serving a system that turned out to be anything BUT being service to his country.\n\r\nI’ve been married, twice, and both times the marriage failed because I was incapable of allowing anyone to actually love me.\n\r\nThe fact that I knew love, once and a very long time ago makes finding real love again a task I see as being nearly impossible. \n\r\nI will finish my first full length book, an autobiographical/ self help book that I hope might help others avoid some of the mistakes I have made over the years and upon its publication I intend (if Europe ever allows Americans to travel there in spite of the Covid-19 pandemic) to leave immediately before it publishes or as soon after as I possibly can.\n\r\nMy intent and purpose for backpacking across Europe would be a starting point in conversations, with anyone interested in attempting to form a lasting relationship with me. And that’s the point of this long introductory statement.\n\r\nAs for why I'm here ... \r\nActually I am looking for a real relationship.\n\r\nI'm tired of dating sites where women show their cleavage or their butts and then ask for money or only want to chat online.\n\r\nI'm looking for real. A real woman. A real love. A real life in what time is left to me.\n\r\nIf you'd be willing to meet face to face instead of chatting or messaging here, there would be a chance.\n\r\nThree things that kill any attempt at starting a real relationship with me are these:\n\r\n1) asking for money\r\n2) sending nude photos by email\r\n3) not being willing to meet face to face in a public, safe place.\n\r\nI'm not bitter or angry, as some of the women seem to think, just cautious since I was scammed back in 2017 trying to find that one real woman.\n\r\nI've said in before but no one seems to hear:\r\nfinding real love isn't like searching for a needle in a haystack - - -\n\r\nit's like searching for a needle in a haystack size pile of needles and finding love is like finding that one 'golden' needle in a pile of needles as big as the haystacks in fairy tales.", "match_age": "from 36 to 59", "children": "no children", "orientation": "Straight", "religion": "Spiritual", "smoking": "non-smoker", "drinking": "never", "intent": "Fun, Friendship, Romance, Serious Relationship, Marriage"}