{"gender": "male", "age": "30 y.o.", "location": "Gran Alacant, Alicante, Spain", "status": "single", "username": "lucky12", "ethnicity": "white", "occupation": "Motocycle Racing, Fitness, Scuba diving and Wellbeing Coach", "description": "I am someone how just come out from a long term relationship, I was truly invested into it but things did not turn out to plan so here I am. Not sure what I am looking for but one thing is sure is that I want to meet new people as friends or more and see where it can lead.\n\r\nI am a very positive person, very focused in what I do and when its time to work its time to work, when it is time to laugh and enjoy then we enjoy. I like outdoor activities but also enjoy the comfort of a sofa or bed to enjoy watching a nice movie with the right person next to me. \n\r\nI originally come from Mauritius island, lived 8 years in the UK and soon to be 3 years in Spain. I moved a lot meaning that I am of mix culture and very adaptive, now my goal is to integrate fully into the Spanish culture. To me Spain is a beautiful country full of opportunities for everyone.\n\r\nI am full of stories and little life lessons due to my highly active life and experiences. I am looking for someone how is mature enough to have deep conversations around a glass of wine, someone who has a certain level of spiritual awakening and who is willing to grow to make the most of this life journey. \n\r\nIf you match these characteristics then maybe I will share with you some of my near-death experiences and crazy stories. \n\r\nMy job now as Motorcycle racing coach, I also do fitness, meditation, wellbeing, and scuba diving activities. I am myself an ex European Championship winner which allowed me the possibility to work in my passion freely. I am an entrepreneur currently building my business in Spain which gives me a lot of freedom of choice.", "match_age": "from 19 to 36", "children": "no children", "orientation": "Straight", "religion": "Spiritual", "smoking": "light smoker", "drinking": "occasional drinker", "intent": "Fun, Friendship, Romance, Serious Relationship, Marriage"}