{"gender": "male", "age": "54 y.o.", "location": "Veresegyház, 2112 Hungary", "status": "divorced", "username": "BoldogMokus", "ethnicity": "white", "occupation": "-", "description": "After an unhappy marriage and making sure my kids have been taken care of during the divorce, I now want to focus on myself a bit, and find someone to spend time with. Go for walks, hold hands, talk politics and economics, maybe technology (not mandatory), or just the wonderfully ridiculous magyarorszag. \n\r\nIgen, igen, elege jol beszelek magyarul (a billentyuzeten kivul) pedig nagyon szeretnek hogy te beszelsz angolul is mert allandoan beszelni magyarul faraszto, es neha jobban tudok mondani amit kell angolul.\n\r\nMy profile says not looking for anything serious, and that is mostly because I think looking for something serious is a fool's errand. Seriousness happens naturally, if it is to happen at all. I am not against falling back into a serious relationship but that is a journey, not a destination, however cheesey that sounds. \n\r\nOriginally from Chicago, I became Hungarian in 2014, and have been living here on and off since 1990, with years spent back home and also in DC. \n\r\nI love reading, current events, traveling, cooking, and most of all being a good dad. Puzzles of any kind are fascinating, and I love most board games, trivia games at the pub are a favorite. I find anyone and everyone interesting, especially when they are telling me about their passions in life.\n\r\nMusical tastes range from Zeppelin to Sinatra, Metallica to Rimsky-Korsakov, Amy Winehouse to NWA.\n\r\nI have a BA in International Relations, an MEd in Educational Psychology. and an MS in Network Security.\n\r\nNeed any more details, let me know. They can be arranged. \n\r\nCheers.", "match_age": "from 19 to 50", "children": "1-2 living with me", "orientation": "Straight", "religion": "Other", "smoking": "non-smoker", "drinking": "occasional drinker", "intent": "Fun, Romance, Serious Relationship"}