{"gender": "male", "age": "71 y.o.", "location": "Preesall, Poulton-le-Fylde FY6, UK", "status": "divorced", "username": "GeorgeUK", "ethnicity": "white", "occupation": "part time driver", "description": "Let’s laugh together and we’re half way there!\r\nHiya... my name’s George, thanks for stopping by.... so time for me to rabbit on about myself... Im young at heart down to earth, honest (maybe too honest) easy going and have a heart of gold...\r\nI believe that mutual respect & trust are crucial to the success of any relationship...\r\nOne of the things I look forward to is going on holiday, nothing better than being with the woman you love, lazing on the beach, drink in hand and the sun shining.\r\nI like science fiction and action films the most but also enjoy a good romantic film as well (sob… sob…) I listen to all sorts of music… soul... rock... pop... etc\r\nI’m not into any sports, but I do enjoy watching F1...\r\nI enjoy going out to the movies, 10 pin bowling having meals out at restaurant going for walks in the country side… I also enjoy staying in at home and having a cosy evening… I’m open minded and willing to try almost anything at least once!\r\nI’ve been in a couple of relationships since my divorce the most recent one ended recently after a number of broken promises. \r\nMy main career has been in sale’s management but gave it up about after being made redundant three times in as many years, I’m now semi retired and only work part time... it keeps me out of mischief... lol\r\nto sum myself up in a sentence I would say 'Bubbly, good fun, honest, generous & most importantly I love to laugh...\r\nSo.... what am I looking for? Well, it’s YOU!.. YES... YOU... get in touch and we’ll take it from there... you’ve got nothing to lose and everything to gain... I don’t bite... well, not unless you ask... lol\r\nWell, enough about me... so... “How are you” ??", "match_age": "from 19 to 55", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Other", "smoking": "non-smoker", "drinking": "social drinker", "intent": "Romance, Serious Relationship, Marriage"}