{"gender": "male", "age": "49 y.o.", "location": "Lakewood, CO, USA", "status": "separated", "username": "Carter_Keyes", "ethnicity": "white", "occupation": "Craftsman", "description": "Surely You have been asked, 'Is your glass half empty , or are you a half full kinda girl? Me, I say 'It's the wrong freakin' glass altogether! I mean forget the whole 'Grass is Greener Syndrome'. I tend to deny the other side even has grass until I've mowed My own lawn into a pulp'. Now that doesn't make Me a cynic, I'm a realist. I simply look for a more sound and logical solution for any issue.\n\r\nA little about Me in general, I'm a proud graduate form Kansas State with an earned degree in Policy Management. That doesn't elevate me to being the smartest or quickest guy in the room, or better than those less formally educated than I, this is merely a fact of My achievement and part of My success in life. I am a decorated combat veteran of the U.S. Air Force and proudly support all troops, soldiers, and military men and women in all their work regardless of the party politics. But 'Who' I am is what I'll tell you the most...\n\r\nMe, I am always the one focused on having exact change for the bus while others are jostling for either an isle or window seat. That's Me, always on top of it. Not once have I ever left someone without toilet paper, or force them to use napkins or other random products that happen to within arm's reach of the toilet. Oh no, I've always anticipated when we'll need something. You can always rely on Me to make the journey smoother. Reliability is a tremendous quality you'll have never appreciated until meeting Me! But now that you've tasted it, you will find it indispensable. Being with Me will give You a certain peace of mind you'll have never experienced before, an ability to not worry about taking care of the world around you at all times, simply because YOU are now being taken care of as well.\n\r\nI have been to the mountain top and possessed the 'Golden Goose'. I've also been swept from it's perch , committed my sins and atoned for my crimes with parole papers in hand. I've been left and abandoned. Experienced homelessness, grown heartless and have become a better man for it. This isn't about where I've been, or who I used to be, but more where I am now and where I will go next.\n\r\nSo know this, if you want to get inspired, feel desired and be held in honor and know that you are valued? If you want your 'Jerry McGuire' moment? Then get on your knees and demand to be served a bottomless glass of me. Throw your head back and be consumed by my intoxicating Elixir! I can promise you this: hangovers are guaranteed and a party there will always be. Non-stop. So come on, jump on in, the waters fine. I got You.\n\r\nThere you have it, a cursory introduction to the man I am, and the friend I vow to become. I don't 'Spit Game' and I'm no 'G', nor am I a 'Killer', but don't push Me,. I'm a protector, a valued asset. I stand My ground and I'm not afraid to spill blood in honor of a cause for My friends in defense of race, religion, or even stupidity.\n\r\nI'm seeking a 'Soldier' to march beside Me. A steadfast lighthouse within the calm of every storm. I am today, I am tomorrow and I am unwavering. What I tell you today, is how I will feel tomorrow. I am open to conversation and debate and of course My feelings can be persuaded to different views and standings. I just don't change My mind with the direction of the wind. Make an argument and back it up with facts. I will listen. I am open to change, just not false posturing.\n\r\nI look forward to reading Your words in reply, viewing your script. Don't be timid, venture any question to me as there is nothing I won't entertain or tell, given only that You ask. Surely you have them, questions? Nothing is to absurd or edgy. From this moment on, just let it begin....", "match_age": "from 19 to 86", "children": "no children", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "occasional drinker", "intent": "Fun"}