{"gender": "male", "age": "56 y.o.", "location": "Waterlooville, UK", "status": "divorced", "username": "trancetrousers", "ethnicity": "white", "occupation": "Electronics", "description": "I'm just a nice normal man looking for a nice normal woman. I’m fairly young at heart - I can be playful and silly at times but I also know when to be serious and grown up. I work full time, I can drive and I have a car. I also have a 9 year old daughter who is obviously my main priority. She doesn't live with me but I see her regularly, so if you can't accept this or think it might be a problem then you should look elsewhere. I do still have plenty of free time though!\n\r\nI like the simple things in life e.g. days out, country/seaside walks, quiet nights in, the odd trip to the cinema etc. In the summer I like to go for rides on my mountain bike when I can. I have social anxiety so I don't really like pubs much unless they're really quiet ones, and definitely not clubs! I'm an animal lover, I have a dry sense of humour and I like a good laugh. I'm a very tactile person and love kissing, cuddling or just holding hands. I'm also polite, courteous and fully house trained, oh, and I always leave the toilet seat down! I'm reliable, honest and trustworthy. My motto in life is treat others as you'd like to be treated yourself.\n\r\nI’m quite a neat and tidy person. One of my pet hates is poor spelling and grammar. I’m not really interested in sport. My main hobby is building models - plastic, metal and card.\n\r\nYou'll probably be about my age, although obviously I wouldn’t say no to anyone who wasn’t if they ticked all the right boxes. I have no problem with age gap relationships, so if you’re a lot younger than me then that’s fine. If you’re child free and you want to get in touch then you must like children, but if you have children already you’re also welcome to contact me, particularly if you’re a yummy mummy lol.\n\r\nWith any luck you'll be reasonably attractive, with all your own hair and teeth lol, and hopefully agree with most, if not all, of what I’ve written about myself above. I'm just looking for a like minded person really. If you like trance music and/or Star Trek/Star Wars too then that would be great! It would be good if you had a car too.", "match_age": "from 30 to 50", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Atheist", "smoking": "non-smoker", "drinking": "occasional drinker", "intent": "Fun, Romance, Serious Relationship"}