{"gender": "male", "age": "42 y.o.", "location": "Norwalk, CA, USA", "status": "divorced", "username": "MykleMatwaya", "ethnicity": "mixed", "occupation": "Therapist", "description": "(StraightMale)\r\n39, 5'10\" 228lbs \r\n\"I currently reside in the Los Angeles California area, however, I have come to the decision to permanently relocate to Mexico, somewhere in Baja Ca. I seek a better quality of life, slow down and enjoy humanity and give back to the people who need help. I would love to find someone wonderful to start to live this new life with\n\r\n*No hook up's, no friends with benefits, or casual anythings. I appreciate the attention, compliments, & the offers. I'm very flattered, but it doesn't matter what you say, or how pretty you are, if you're not here for the same reason I am, please let's not waste each others time. I am just not into casual sex.\n\r\nHello & thank you for taking the time\r\nto come here in order to satisfy your small curiosity in me.\r\nI do hope that you find the information which I have placed here, to be both convenient, & useful to you in making up your mind as to whether or not you deem me worthy enough of any more of your valuable time. I do hope that you can both enjoy & appreciate what you find here about me, as I am very eager to begin to learn more & more about you. Thank you for your consideration, enjoy.\n\r\nIm not a liar.\r\nIm not a cheater.\r\nIm not here for Sex.\r\nIm not here for fun either.\r\nMy intentions are sound.\n\r\nI have lived through enough to understand what the greatest things in life are truly made of, & they are not material, yet they do have substance. Among'st them are integrity, morality, modesty, & selflessness, to name a few. These are traits you cannot fake, you cannot buy them in the store or imitate them from watching television. They are gifts, God given & you either have them or you do not.\n\r\nThey do not give us much room to elaborate, so I will try to sum things up best I can. & while doing so, I promise to be honest with you. I am not going to make you spend the next few moments of your life listening to the same'ol tired routine of some @sswipe writing down everything he thinks you want to hear, fluffing himself up with attributes from a fairy tale & doing whatever else he can in order to blow enough smoke so far up your @ss that you start to think your panties must be on fire. Thats not me. Im not going to waste your time or mine by insulting your intellect. This is my 1st act towards you in order to gain your respect & trust, because those are the foundations of any lasting relationship, & thats what I am here to find. All I ask for in return, is that you appreciate this respectful courtesy which I am extending towards you, & that you please extend to me the same courtesy.\n\r\nNow, before you read any further, the next fact that needs to be made abundantly clear is that I am nowhere close to perfect, not by anyone's standards. I am not wealthy (far from it) & I struggle through this life just like you & everyone else out there, if not more so. I am not skinny, or obese, nor am I the muscular & athletic type. I am however, a big, strong, healthy, loyal & very protective Alpha Male & Father. I am an honest person, understanding, patient & realistic. I am not controlling, abusive, or insecure, nor do I have a jealous bone in my body. I am highly emphatic & am ever aware & care very much about the effect I have on the people that are around me in any given place & at any given time. I am not thoughtless or insensitive. I detest rudeness & despise bullying of any kind, be it physical, intellectual, emotional, whatever, I wont have it & will not allow it to take place in my presence. I am a bit old-fashioned & I tend to romanticize the world, life & everything it has to offer, from the best of it, to the worst. To me it all has meaning & offers opportunity for learning & growth.\r\nI do not believe in coincidences, accidents, chaos or chance, I believe in One God & I know he does not make mistakes, so therefore he would be contradicting himself if he were to allow them.\n\r\n& If it's not crazy, mad, passionate, extraordinary love, then it is a waste of time. I have enough mediocre things in my life already & I refuse to allow love to be reduced down to just one more mediocrity.\n\r\nI am in search of a woman who knows exactly whom she is. Someone who has struggled through her entire life, in order to be able to hold onto her true identity, her God given individuality, in order to be able to accept the person she sees staring back at her when ever she looks in a mirror. Who can accept herself for all that she is, both good & bad. Someone who accepts responsibility for her own actions & choices in life. Someone with empathy, patience & understanding. Morality, modesty & selflessness. Some one who loves for the sake of others & not merely for the sake of herself. I don't care what you have done,or haven't done (I haven't done much myself) I am no one of any particular importance, but I am one of a kind & that is pretty much all I am ever likely to be. I live my life by the examples which I set, based on the consistency of my character, & God willing, I will continue to do so until the day I die.\r\nSo, if your biggest fight has just been holding on to who you are, not what you have, then you & I already have something to relate to. I may not be much, but at least I am me, and I don't have to compromise my morality just to be able to blend in with everybody else out there.\r\nAll I want, all I have ever wanted all of my life, is for someone to treat me the same way I treat them. That may sound cliché, but it is true nonetheless. I am an easy man to please. The little things matter to me more than anything else, & I am a True Romantic in every sense of the word.\r\nI am only looking for one girl, so if you read this & see yourself staring back from between these lines, then perhaps I have already found you.\n\r\nI do not smoke, drink, or do drugs. That does not mean that I judge either. I just dont partake. I dont mind what you smoke, or if you drink. Everything best when done in moderation. But I will say this, I am not interested in compteing with any substances that a person chooses over & loves more than me or anything else in their life. But if you have a problem with something, that is not a dealbreaker either. Times are tough, & we are all hung up on something, in one way or another. Im here for you, & always will be.\n\r\nI am not a sports fan, sorry. I just can't seem to be able to give a crap about any of them in any way whatsoever. (I remember a time when a woman would be relived to hear that.)\r\nHowever, I can be talked into attending a game every so often, I just wont pay any attention to it.\r\nIf you have kid's that are on teams, I will be as supportive & as involved as I can be.\r\nI enjoy literature & I like to do a little writing myself from time to time.\r\nI am handy, & I prefer to fix things myself.\r\nI Can't dance.\r\nI like to cook & can cook.\r\nIm a neat person & I tend to keep things tidy.\r\n3 cat's may sound a bit excessive, but how many pairs of shoes do you own? They are very special to me & are a nice compliment to My lifestyle.\r\nI'm not a selfish man, in bed or out.\r\nI'm not impulsive & I don't jump to conclusions.\n\r\nI am Muslim. For religion I put \"other\" & I only did that because 90% of you people stop reading right after you see \"Muslim\" in my personal details.\r\nHopefully by now, after all of this reading, you can see that I stand nowhere close to any negative stereotypes that you may have been conditioned into believing of us. I'm not some fanatic, chauvinist, controlling asshole, I wasn't raised that way. I am a rational, open minded non-judgemental individual. I am Muslim because of my own ability of subjective thought & by my own\r\nchoice. Not because of influence, heredity, or culture. No one talked me into this.This isn't just something I believe in, it is something I am convinced of.\r\nI wasn't born into a Muslim lifestyle. I have no Muslim family members, or friends. That means, I am not doing this to impress mommy, daddy or anyone else.(Trust me, none of them like it one bit) This is for me, it is something dear to me, & it makes me feel better about you, myself, & everyone else out there. & so what if I pray 5x''s a day, & abstain from certain things that really aren't any good for me any ways? Whats the beef? At least I am a man who would rather follow rules & morality more than just his own selfish impulses, un-like most of the inconsiderate lil sh¡ts your used to dating. I am more focused, more disciplined, & a much better human being than I ever dreamed I could be. And being human is all I have every really wanted to be. And because of that,\r\nI love being Muslim. It is the most important thing in the world to me.\r\nBut that does not mean that is has to be to you. Your beliefs are your own & mine are mine. I respect your choices & visa versa.\n\r\nI would like to thank you coming this far. I tried my best to make all of this worth your time. Now after all of this,it is obvious that I am not lazy, nor do I lack the willingness to be considerate, expressive or informative I put my sincere effort into this, I am a pretty good writer when I want to be, but it does not happen easily. And even though I am capable of writing, & enjoy it very much, I will let you in on a little secret, none of that necessarily means that I am a great typist, or even a mediocre one. I am a terrible typist, & an even worse text'r. I spend so much time editing and with these tiny screens and bid thumbs it can be a real pain in the ass and is very frustrating...\r\nThat being said, I will text you a little, but please, not on & on. As you can probably tell by now I have a problem with summing things up, & making long stories short when I write. It's the same way when I text. I am very thorough & am not accustomed to leaving out important information when I communicate, information being the most important component to understanding. Therefore if you want to talk to me, then lets talk. Offer me the courtesy of a telephone call please. I have already put in so much time & effort with all of this writing, which is a'lot more than anyone else in here has been willing to do for you. So please be a sweetheart & give me a ring. Haven't I earned it? I assure you that I have far too much of a healthy sense of shame, & would never dream of bothering another human being past her point of interest in me. I'm no stalker.", "match_age": "from 19 to 57", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Spiritual", "smoking": "non-smoker", "drinking": "never", "intent": "Serious Relationship, Marriage"}