{"gender": "male", "age": "65 y.o.", "location": "Sydney NSW, Australia", "status": "widowed", "username": "Daddywolf07", "ethnicity": "mixed", "occupation": "self employ", "description": "I am not completely outgoing but I am ongoing.Nobody hates me but not everyone likes me. I'm not demanding and prefer the same. Im childlike at times but still responsible.\r\nI like getting out and dining out. Sometimes just doing with no big plans made. Weekends away at the drop of a hat.Or doing nothing all day but being together.\r\nI am interested in nearly everything and would like to meet someone that shares at least some interests but also has their own. Someone with their own life who can add something to mine and vice versa.It would be good if they used a blinker when turning though. I can be a bit shy on a first meeting.I enjoy spending time away. Having a break recharges my batteries and fills me with joy and a renewed zest for life. I always seem to catch the happiness virus so be warned, I become highly contagious.\r\nI am looking forward to the journey ahead but would prefer to travel through life with a compatible gentlewoman. I am ready to meet a great friend or companion at first which may lead to a permanent relationship but only if we are suited.\r\nI am clean, well dressed, well groomed and subtly perfumed. I am honest, well mannered, kind and considerate with everyone and with those whom I love, I am very loyal, loving, affectionate & playful.\r\nMy friends consider me a handsome good catch. Heck, who am I to disagree with them?\r\nOne friend wrote to me saying,It is nice to know that you work for a cause not for applause\r\nYou live life to express not to impress,You don't strive to make your presence noticed.You just make your absence felt.We say you are a noble person which is a rare top find these days.\r\nWow, what can I say? I was deeply humbled.I have a 21 years old daughter and a gorgeous family. I'm actually quite old-fashioned.you found me.Cheers...", "match_age": "from 59 to 85", "children": "don't want children", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "occasional drinker", "intent": "Romance, Serious Relationship, Marriage"}