{"gender": "male", "age": "65 y.o.", "location": "Nanaimo, BC, Canada", "status": "single", "username": "benjden", "ethnicity": "white", "occupation": "retired", "description": "3rd Party Descriptive Analysis Personality Report\n\r\nBen has a strong need to belong, and the organizations or groups he chooses are lucky to attract this thoughtful, hardworking, and devoted individual. Ben focuses all his energy on the problems or issues that is before him at the moment; he is painstakingly accurate when working with facts, attentive to details, and methodical in applying both qualities while working. Ben likes gatherings, analyzing, and applying data for some useful purpose, and documenting the results.\n\r\nQuiet and reserved, Ben is a loyal and devoted friend and co-worker who takes his responsibilities toward others very seriously. Sensitive and sympathetic, Ben is a good listener, eager to help people in real and practical ways, which Ben does best by drawing on his own personal experiences. he is also good with people in small groups or one-on-one situations because of his patience and genuinely sympathetic approach to dealing with people. Ben makes a pleasant and reliable co-worker and exemplary employee, but tends to be harried and uncomfortable in supervisory roles. \n\r\nLove and Relationships\r\nBen has a few, close friends, and is extremely loyal to these, and is ready to provide emotional and practical support at a moment's notice. The older the friendship is, the more Ben will value it. \n\r\nBen is devoted to partners and friends (no family) and usually is an excellent homemaker. His home of is likely to be well kept inside and out. Interior and exterior are meticulously maintained and appointed in the traditional manner. Ben is apt to find the putting on the airs of offensive and tends to prefer modest, quiet friends, rather than more boisterous ones.\n\r\nAs the security seeking temperament, Ben is a practical and frugal type, who shares certain core values, among them the belief in a strong work ethic, the need for people and institutions to be responsible, the importance of following the rules and of serving one's community.\n\r\n• Introversion\r\nWhile Ben may not be anti-social, he does need his private time & space to retreat from the world. Unlike extroverts, too much socializing may zap his energies, which are derived from exploring the inner world of ideas, impressions and pure thought.\n\r\n• Sensing\r\nBen usually gathers information with his senses: what he can see, hear, taste, touch and smell in the physical world. Ben concentrates his energies on what actually exists and does not ponder what might exist too much. He is usually practical and relies on his common sense to guide him through the world. \n\r\n• Feeling\r\nBen makes decisions subjectively based upon his values and what is important to him. How people will be affected by his decisions is important to him. He is likely to make decisions based upon what he feels is acceptable and agreeable rather than what is logical. His truths are founded in his values and those of the society he lives in.\n\r\n• Judgement\r\nHe likes decisions to be made as soon as possible; he is not comfortable with loose ends and like to see conflicts resolved as soon as possible; he has a preference for a well-structured, orderly lifestyle with few surprises. Ben takes commitments very seriously. While he is not inflexible, he does like to stick to a plan once it is set into motion..\n\r\nI have employed an analyst’s 3rd Party Vivid Analysis Personality Report , but there is little space for me to provide this assessment here. So, if interested please contact for the balance of this section.", "match_age": "from 35 to 55", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "never", "intent": "Friendship, Romance, Serious Relationship"}