{"gender": "male", "age": "53 y.o.", "location": "Las Vegas, NV, USA", "status": "divorced", "username": "Ghost69", "ethnicity": "white", "occupation": "-", "description": "About Me: Credibility means EVERYTHING!\n\r\nI’ve always been highly intuitive, simply put, I don’t see the world the same way most do. Depending on what you believe, some would say I’m an empath. I have always been a human lie detector and can sense things in my surroundings such as the way a dog may sense danger in a person. \n\r\nWhen I was attending dealing school, one of the instructors who had been in casino surveillance over 30yrs insisted that I consider going into surveillance. Observing me he said “when the game is in play, I noticed that while everyone else is looking at the table, you’re analyzing it and breaking things down. You just don’t look at things and process them the same as most, it’s much more advanced”.\n\r\nFighting For the Little Guys\n\r\n6yrs ago I started an advocacy against slave labor in the Philippines \n\r\nAfter reaching 30,000 members I created our Non Profit Organization - Filipino Goodwill ESL which can best be described as a Independent Contractors Union to negotiate their contracts for them, legally represent them, we offer further training, mentorship programs, and emergency relief fund as well as job security. \n\n\n\r\nScammer Busters\n\r\nQUOTED FROM MY GROUP:\r\n“One might wonder what makes me think that I am able to learn or find anything out,\r\nOr what kind of experience do I have in such matters of recon-ing information on People or schools? \n\r\nWe would have to go back to 2010 when I did it pretty much as a\r\nHobby under an entity named \"Scammer Buster\". This was an incognito account that I created to catch scammers who were cheating people in my online selling groups in\r\nThe Philippines. It grew to a point where I had to make a group to hold public trials.\n\r\nI dug, found evidence, phone numbers, alias names, witnesses and victims. I would compile the info, post it as a file [case] in the group, then invite the accused, present\r\nThe file and ask them how they plead, guilty or innocent? It was amazing how much attention that got, I literally made everyone who was guilty famous, and they couldn't turn anywhere to sell anything in the Philippines without somebody knowing who they were & that forced them to have to close their accounts and start all over. Being a vigilante is kind of in my blood I guess. Now, for those who may think I'm\r\nExaggerating? Here's a home page of a site that recorded everything”\r\nScammers Busted", "match_age": "from 19 to 50", "children": "1-2 living elsewhere", "orientation": "Straight", "religion": "Christian", "smoking": "light smoker", "drinking": "social drinker", "intent": "Fun, Friendship, Romance, Serious Relationship"}