{"gender": "male", "age": "52 y.o.", "location": "Sayreville, NJ, USA", "status": "single", "username": "LionsFaith7", "ethnicity": "hispanic", "occupation": "Currently a student in college", "description": "Hi there thanks for taking the time to read my profile. My name is Daniel and I'm currently a student at Berkeley college and my major is criminal justice. I’m working towards an Associates degree in cyber security. I’m an honor student and been doing very well in my classes.\n\r\nWhen I’m not studying I’m spending time with my family and my little dog. A good friend of mine told me that family is important and I totally agree. I love my natural family and I also love my spiritual family. I’m a Christian man who loves his Lord and savior Jesus Christ. I’m not a perfect man and I try to do my best because that is all I can do. I have many things I enjoy like going places and seeing interesting things. I moved here to New Jersey from California four years ago. I was always out on my off days going along the coast and stopping by at one of my favorite hangouts to eat and have a nice hot cup of tea. I love going to little cafes and supporting mom and pop businesses. \n\r\nI enjoy listening to music and coming from a Puerto Rican family we love our music. I have a few family members who are Jazz musicians and one played with famous performers. My music taste is very picky and at the moment I’m listening to 70s, 80s and EDM music. One of my hobbies is collecting vintage electronics such as a music device called NET MD (MiniDisc). I included a picture if it in my profile. I'm a tech nerd and I get fascinated in the history and the workings of technology. I hope to someday with my lady by my side go tech hunting together at flea markets and thrift shops, another favorite fun past time of mine to do.\n\r\nI hope to someday find a woman who will accept me for me inside and out. A woman who will love me unconditionally. I'm willing to date and take this slow so we can learn about each other. If all goes well it will someday lead to marriage. I find women who have colored streaks in their hair very attractive.", "match_age": "from 19 to 86", "children": "want children", "orientation": "Straight", "religion": "Christian", "smoking": "non-smoker", "drinking": "never", "intent": "Fun, Romance, Serious Relationship, Marriage"}