{"year_reported": "2013", "month_reported": "12", "username": " jameslovingheart49", "name": " James Chuck", "age": " 49", "occupation": " self employed", "status": " widowed", "inet": " –", "description": "\nI like traveling, cooking, dining out, outdoor activities (e.g., sports, camping, walks), dancing, spin classes, music and optimistic people who are genuine. I am looking to share life experiences (e.g., travel) develop new friendships and eventually begin a meaningful and trustworthy relationship. I wish to avoid pessimistic, superficial and manipulative people – life’s too short I’m a serious person by nature, but I also have a good sense of humor. I’m looking for somebody who chooses larger values over superficial ones. Why is that important to me? I’m an inclusive thinker and believe many people have a narrow view of the world and our culture. I genuinely believe in the goodness in people and like to travel as often as possible to learn about life and its possibilities. If you’re a conservative person on our political spectrum, you’re probably not going to agree with my ideas on how to live a full life. I’m looking for a woman who loves words. Loves them and uses them at a high level. Every profile on this site mentions communication, because its crucial! That’s why I’m looking for a true friend. A friend who knows how important trust, honesty and loyalty are in building relationship. I love ideas and am not afraid of an opinionated woman. I’d like to get to know YOU. I love to exercise and enjoy trying different restaurants. If you want to go running or cycling, let me hear from you……that’s just a good workout shared. No pressure beyond the obvious exercise. Who knows…..it might become something more as time passed", "email": " jameslovingheart49@yahoo.com", "tags": ["Male profiles", "facebook", "howaboutwe", "idating4you", "love scammer"], "gender": "male", "images": ["jameslovingheart491.jpg", "jameslovingheart492.jpg", "jameslovingheart493.jpg"]}