{"year_reported": "2013", "month_reported": "05", "username": " Eric_Dating2luvU", "name": " Eric Crownman", "age": " 55", "occupation": " –", "status": " –", "inet": " 41.211.207.130", "description": "\nI think of myself as a kind, patient, understanding man with a caring heart and inquisitive mind. My passion for living a good life is in no way separate from my desire to share life’s best opportunities with people who are honest, loving, open minded and loves life as much as me. I love warm weather (Hawaii and the Caribbean are two top travel picks) and spending time with my family and friends (both categories include my dog). When it comes to fun, laughter, and adventure you can always count me in, but when it comes to drama, strife and argument – I’d rather not be invited. One of the most important qualities I have when it comes to relationships is my tendency to think of others first, because it only stands to reason that if two people always think about giving to each other, they don’t have to worry about getting from each other. Honesty and communication are also key in a successful relationship for me.\nI’m hoping to meet a kind, loving, romantic woman who goes through life with a bright smile on her face. The type of person who sees the humor in everyday life, laughs without holding back, and who has a true sense of romance. Someone who is far too honest and emotionally mature to ever opt for something like a one-night stand, and is more interested in learning in who people really are, than in just settling for what’s on the surface.\nMy favorite television shows are the Walking Dead, Game of Thrones, The Following, NCIS, CSI, Vikings, and anything educational. (DVRs are awesome!) I love Stephen King, James Patterson, Dean Koontz, and books that make you want to keep the lights on. Getting together with friends or family to play cards or a board game is guaranteed fun as the night usually ends up in a puddle of laughter. I love being around people but a quiet night at home cuddling is also heaven.\nMy type of woman: Confident, but not arrogant, Has a job Doesn’t live with her parents, Knows how to treat a man!!!\nGREAT sense of humor Takes care of herself, Open/honest Affectionate, even in public….hold my hand, put your arm around me!\nLikes animals (I don’t trust anyone who doesn’t), Has grown up and is over the party scene Isn’t looking for someone outside of his generation Brakes for turtles So let’s get together and get Kodak with it (lets chat on Y messenger) and texting would be great idea of knowing one another, Kindly drop me a line or two and see what we can both develops and goes from there. I’m Eric", "email": " ericisurprince@rocketmail.com", "tags": ["Male profiles", "confirio", "romance scammer"], "gender": "male", "images": ["Eric_Dating2luvU1.jpg"]}