{"year_reported": "2015", "month_reported": "10", "username": " excelltaursure09", "name": " Micheal Hills", "age": " 45", "occupation": " Musician", "status": " widowed", "inet": " 64.60.182.86", "description": "\nI am as faithful as it comes. I am good at making people laugh and they know they can depend on me. I love to dance. lol What I’m seeking is very simple. Someone generally have the same interests that I do, but can bring more into my life & allow me to bring more into hers. Someone who knows that a smile will bring more joy to me than flowers or gifts. Someone who will just get to know me & love me for who I am. Unconditionally. The woman I’m searching for must be honest, loving & compassionated. Someone who has common sense & is stable, mentally, emotionally spiritually. You say what you mean & mean what you say, but does so in love & kindness. You are dependable in your words & actions. Have a zest for life, a good attitude & a caring soul. You treat a Guy like a Guy & do it because you are God hearted woman. You have morals & live by them.I’m a firm believer in treating others the way I like to be treated. I love to travel, target shoot, go to the beach & motorcycles. I am loyal, honest, true to my word. I’m looking for my best friend fist then maybe\nOne who is not only educated, caring, sensitive, and passionate about life and love, but someone who is also my lover and best friend. I want to meet a dynamic woman; someone who is uniquely beautiful inside and out. Yes, IÕm picky. But while I think that looks are important, so much of my perception of beauty is tied to intelligence, humor, compassion, and depth. Someone optimistic, sweet, and strong. Someone that I respect and admire, and that feels the same about me. Someone that challenges me to grow and inspires me to be the best person i can be, simply by her presence.I believe that a healthy relationship depends on honesty, communication, and more communication. That falling in love with someone is drastically different from falling in love with an idea of someone. That loving someone means loving them exactly for whom they are and for whom they aren’t. To appreciate the little things. . . like holding hands, and that I like to sleep on the left side of the bed. I am looking for someone who is authentic, communicative, HONEST. passionate, healthy, cute, and fun(ny). . . and all the other things that make your heart go pitter pat. . . when you know that the person youÕre with has your back as much as you’ve got theirs.", "email": " craighills17@yahoo.com", "tags": ["Male profiles", "connectingsingles", "dateolicious", "facebook", "meetme", "oasis", "okcupid", "romance scammer"], "gender": "male", "images": ["excelltaursure091.jpg", "excelltaursure092.jpg", "excelltaursure093.jpg", "excelltaursure094.jpg"]}