{"year_reported": "2015", "month_reported": "03", "username": " jmcnerny47", "name": " John Mcnerny", "age": " 48", "occupation": " Civil engineering", "status": " widowed", "phone": " 310-596-2332", "inet": " –", "description": "\nHello there! I am often drawn to the philosophy, If you can imagine it, you can achieve it; if you can dream it, you can become it. I would love to find someone who would like to make a life together.\nCommunication is important to me and will need to be with the woman I want to spend time with whether dating or getting to know each other. I can be a very romantic and consider myself to be very affectionate. Being loved and being able to love is important.\nMy dedication to my chosen career gets in when ever i have a new contract to execute in between the year, I’m working really hard on trying to find a better balance in life. But I do know how to take time off from time to time, you could say I am getting better at putting first things first, but I know that people in my life take priority over things. But you might have to remind me of that from time to time as I’m not perfect and don’t expect you to be either.\nI know that having that someone special in my life is an important responsibility as well. I do have a deep love for people, a respect for fellow citizens of the earth, and making commitments to those I care and love. It is important to me that the woman I find also share some of those characteristics. I see myself as a professional guy who is competent and knowledgeable about my career while at the same time loves to experience what is really important in life and love. Thanks for taking the time to read this and I look forward to meeting some one great. After all life is a journey, not a destination, and we all meet people along the way for a purpose. That purpose may not always be clear at first, but everyone you meet has something to teach you about the world, life, themselves and the power that lies within you.\nI am looking for a woman with open mind and great perception of an ideal relationship that is build on total honesty, sincerity, mutual understanding and tolerance of each ideal person also need to want to share everything with me, there must be no secretes, and no lies or deceptions. The woman must be Honest, caring, kind, generous and with a good sense of humor, fun-loving, open minded, thoughtful and most of all God fearing. I believe in unconditional love and am always striving for freedom", "email": " jmcnerny47@yahoo.com", "tags": ["Male profiles", "connectingsingles", "romance scammer"], "gender": "male", "images": ["jmcnerny471.jpg", "jmcnerny472.jpg", "jmcnerny473.jpg"]}