{"year_reported": "2018", "month_reported": "01", "username": " loveforever3030", "name": " Martins David", "age": " 57", "occupation": " constructional engineer", "status": " widowed", "phone": " 310-697-8850", "inet": " 195.12.49.131", "description": "\nI am very smart, But have a huge personality! I love to cook and bake! My grandparents were all from melbourne Australia, So I have learned from the BEST! I have a girl in which she’s my whole world! Very secure in my own skin! I’m a good man, and always do right by others, In which I’m told is rare to find in today’s times. I’m totally honest, Loyal, Kind, Respectful with a big heart. I believe in family, God, Tradition, And children as a priority. I love to laugh! I am sharp and quick with a come back. And find humor in almost everything! I believe actions speak louder than words, Being real is the KEY! My picture is recent! I am told all the time I look much younger then I am, Although flattering? It’s really just about good genetics and keeping yourself well! Nothing about me is fake! I fear nothing and definitely have edge! lol Without friendship, Respect and trust………….. You can never have love. And I keep that thought close to this day! Looking for someone with the same beliefs and qualities as myself! An all around good woman!\nI am looking for a woman who can laugh, be playful and light hearted,one who is motivated and ambitious, intelligent, and self confident. I enjoy meaningful conversation in addition to plain old good fun. I’m basically a very positive person who also loves humor and laughter and would like someone with an adventurous spirit who can see the funny side of life,someone who is open and willing to learn new things. I like to share things I learn and am open to learning new things as well. I have a passion for music and a curiosity for life. To find a woman who loves to dance would be a miracle, but not impossible I believe, even if rare, but definitely a bonus, but not a requirement! lol I also love a man who knows how to treat a woman like a baby and a baby like a woman. Romance and passion are important as well.\nmy 3 best qualities, I’m a helpless romantic… I love being with my woman & doing little things for her to put a smile on his face.I enjoy surprising her & doing my part to making her dreams come true…", "email": " martinsdavid190@gmail.com", "tags": ["Male profiles", "hangouts", "metrodate", "romance scammer"], "gender": "male", "images": ["loveforever30301.jpg", "loveforever30302.jpg", "loveforever30303.jpg", "loveforever30304.jpg", "loveforever30305.jpg", "loveforever30306.jpg", "loveforever30307.jpg", "loveforever30308.jpg", "loveforever30309.jpg", "loveforever303010.jpg", "loveforever303011.jpg"]}