{"year_reported": "2016", "month_reported": "08", "username": " mchamilton4u", "name": " Mc Hamilton", "age": " 46", "occupation": " engineering", "status": " single", "inet": " 207.244.78.182", "description": "\nI was born and raised in New York, But i used most of my years in France, I attended my university in France, My dream is to Be happy with someone for the rest of my life and live a very happy life like my father and mother, My dislikes are dishonesty, lies.My favourite colour is, Blue, Pink. Due to my Job, I have been to alot of countries, I have adapted with a lot of environments. My past relationship thought me to know that, Beauty is not physical appearance, But the heart, If a woman have a Good heart, then she is beautiful and my past relationship teach me to seek for someone that is God fearing.Am looking for a Good future, not fonication and adultry, Am a man of God and am a born again christian, how can i serve God and still be under the spell of the devil? The devil has been the master of all sinners, he has been the one sinning from the first and he made adam and eve sinned…so how can you serve two masters at a time? i want someone that we will be happy together forever and we will make each other happy for the rest of our living lifes. Well, I dont see any reason why men should be that heartless, Well Maybe they are not God fearing the way they hurt there women, Am a kind of man that i dont like to hurt woman, God is watching every move you make in life, that”s a great sin and i have promised myself that i will never hurt my soulmate in my life as long as she is very honest and faithful to me. If i ever hurt the one i love, I will be hurting myself because we are both human being and i like to treat my fellow human being the way i did like to be treated, I like to please my soulmate with everything that can make her happy as long as am capable of it, my soulmate”s happiness is my happiness, When she is sad and feeling down, I will be there to catch her, I will always be there to confort my soulmate because she will be the other half part of me.", "email": " mchamilton001@outlook.com", "tags": ["Male profiles", "romance scammer"], "gender": "male", "images": ["mchamilton4u1.jpg"]}