{"year_reported": "2018", "month_reported": "07", "username": " ellensweet", "name": " Ellen Krell", "age": " 48", "occupation": " nurse", "status": " divorced", "inet": " 105.228.247.146", "description": "\nWell first of all I would like to tell you that I am a life loving person who adores my life and values every minute of that and maybe that is why I have a lot of positive energy which gives me a lot of nice impressions and emotions. You see I am an open hearted and friendly person who knows that the pledge of a happy life is life long relationships. Maybe I am a goal oriented person but I firmly believe that our life can be changed even with a help of a sincere smile! Of course I also should add that I am a very serious person and I mean that I am not going to waste your time or something like that I know that real love exists and I am here in order to find that . I am a very active person who likes to spend my free time with my family and friends. You see I am a romantic trustworthy person who likes to stay at the open air and of course I truly hope that soon I will find someone to share all the romantic walks under the moonlight…\nIf I had to describe myself in 3 words I would say that I am romantic, loyal and ideal. Really.I also have disadvantages but I consider them to be not too bad. I am optimistic and always try to see only good sides in people. I love communicating and making new friends.t I like reading, especially philosophical literature. I enjoy listening to lounge music, though I can listen to many different genres of music, it depends on mood. My favorite kind of sport is dancing. I play billiards very well and can bet that I would win if we had a competition in it. In my opinion people live to be happy, and it is very important for me to find my second half. For my man I would do anything. I feel ready for serious relations and marriage. My dream is to travel all around the world but most of all I would like to visit Monaco. Believe it or not but I prefer winter to summer. I love snow and frosty weather.", "email": " ellenkrell492@gmail.com", "tags": ["Female profiles", "love scammer"], "gender": "female", "images": ["ellensweet1.jpg", "ellensweet2.jpg"]}