{"year_reported": "2016", "month_reported": "10", "username": " textme_2068993178", "name": " Dallas Jennifer Faron", "age": " 30 or 34", "occupation": " Self Employed", "status": " single", "phone": " 206-899-3178", "inet": " 107.160.167.101", "description": "\nIt is so hard to describe myself, as I am sure it is for most people. I guess the best way to put it is that I am a really genuine person with a huge heart.I am very family oriented and I am looking for someone with strong family values.I am dallas jennifer faron 30 years old And i am a christian lady from kaplan lousiana, Single and young loooking.. I am 5.09 tall .. I have a blue eye ball .I am very friendly and love to be surrounded by fun, outgoing, positive people. I love to make people happy and I am looking for someone who I can truly be happy with! That’s really it, what you see is what you get .I just wanted to say that i’m SINGLE AND LOOKING! Since the death of my bf i have not been able to date other men cos i am always scared and afraid. I am always scared and afriad not to fall into a man that is ready to use and dumped me .I am a woman seeking for an honest man. I am very humble, passionate, affectionate. I like home coziness very much and cook well. I have a very romanti cheart.Family is the most important thing for me. I am kind, honest, decent, cheerful, romantic reliable and tender. I love children. I would like to meet a decent man.who will be a caring husband. I am a very deep person and thinker. I am a dreamer. I am a hopeless romantic and believe in true love. I am a very heart felt person.I am a very creative person. I love writing and art. Also computers, music, collecting things and so much more. I have many interests. I love anything to do with the ocean. I love the ocean I did like to have a good man who really cares for family.I love a man who can display his affections for me anytime and anywhere without having to be shy. And a person who knows how to be affectionate is a big plus. I love being affectionate.I would say that I’m not afraid to display my emotions. I’d like someone who is sensitive and caring. If I’m sad, I’d like for him to be able to comfort me and cheer me up. He doesn’t has to do much, but just knowing that he’s there solacing me is more than good enough.Have you ever had someone not stand up for you? I was deeply hurt when someone I once knew wouldn’t not stand up for me, even after he told me he loved me. I would never allow someone to hurt my boyfriend or my husband, and I would always stand up for him. One thing I will always do for my man is to protect him..", "email": " washeyey@outlook.com", "tags": ["Female profiles", "romance scammer", "Talia Shepard"], "gender": "female", "images": ["textme_20689931781.jpg"]}