{"year_reported": "2015", "month_reported": "08", "username": " honestman4sure181", "name": " Mark Douglas", "age": " 55", "occupation": " contractor", "status": " widowed", "inet": " 94.15.173.198", "description": "\nI would describe myself as a kind, generous, easy-going person. I love to laugh and enjoy funny situations. I enjoy traveling and the adventures of the outdoors. I also like going to the movies, theater, concerts, museums or a nice restaurant. But I am just as happy staying home and hanging out friends and family. I would like to meet someone who has similar interests, but who can introduce different activities into my life. My ideal of match would be someone who is kind and considerate, generous and thoughtful, easy-going and funny. Someone who is not chained to their job, their computer or cell phone would be a plus. Nothing wrong with being ago-getter, but there has to be a good balance, don’t you think? Someone who is mature, responsible and intelligent. Someone who puts butterflies in my stomach. Someone who effortlessly makes me laugh. Someone who isn’t afraid to make a decision if needed. It would be nice to find a relationship where each person’s personality and attitude compliments the other. I also think building upon a true relationship that basic on trust. I’m a simple man who enjoy with the simplest things of this life, but I need a woman to share with me this nice life.Serious relations, I just want to love and be loved, Honesty, respect. Easy, pleasant, interesting I don’t look for an adventure; I would like to meet a true woman like you . The important thing is that we have understanding, respect and love for each other to share together needs, wants, desires and to make our plans, hopes, dreams come true. I have a full of heart to share with the right woman. Looking for a woman like you that is educated. Very willing to keep a warm friendly home & family. she should have a desire to grow his career & be active in a professional field. We will have common goals in life & move forward with them together. she must be able to walk beside me in life,\nThe type of person I am interested in a woman who can laugh, be playful and light hearted, one who is motivated and ambitious, intelligent, and self confident. I enjoy meaningful conversation in addition to plain old good fun. I’m basically a very positive person who also loves humor and laughter and would like someone with an adventurous spirit and a positive attitude who can see the funny side of life, someone who is open and willing to learn new things. I like to share things I learn and am open to learning new things as well. I have a passion for music and a curiosity for life. To find a woman who loves to dance would be a miracle, but not impossible I believe, even if rare, but definitely a bonus, but not a requirement! lol I also love a Ladies who knows how to treat a man like a baby and a baby like a man. Romance and passion are important as well. Like everyone I talk to I want the whole enchantment, including chemistry. I have learned though that\nchemistry is not everything and not the only component for building a strong relationship. A picture is worth a thousand words yet can still tell you nothing. Lastly beauty is in the eye of the beholder, and I would say I have more on the inside than the outside. LOL No one is perfect including myself but I suppose if you don’t put it out there and risk, you’ll never know. However I am realistic and I am by far not perfect.", "email": " mark_douglas56@yahoo.com", "tags": ["Male profiles", "love scammer", "matchdoctor"], "gender": "male", "images": ["honestman4sure1811.jpg"]}