{"year_reported": "2013", "month_reported": "05", "username": " awesomelove1967", "name": " Declan Funman", "age": " 45", "occupation": " –", "status": " –", "inet": " 76.72.171.117", "description": "\nI’m Declan. This is my blotch. Put blog and Confirio together and whadaya get?I’ve been blotching for a while now. (You’re like, Hmmmm…) I bet Mr.Confirio envisioned this when he created this site: A virtual village where a boy writes about love, dating, girls and a couple of other things (like breastfeeding and gay-dancing).I haven’t updated my blotch in oodles of days. Blame it on the start of school. Blame it on the rain. Hey, you’ve got to blame it on something. I’ve learned a lot. I’ve learned that girls like to make demands: Make me laugh! Sweep me off my feet! Take my breath away! Teach me how to Dougie, e’erabuddy Dougie! (Btw, the dougie-dude hates skinny jeans because the burner keep rubbin’.) Or, my favorite Confirio-girl demand: Make me forget my ex, because we just separated yesterday! I’m kidding about some of those. I’m not kidding about the first three. What am I looking for in a relationship? WOW!!! That’s a loaded question. First of all, this person would have to be honest, loyal, trustworthy, and attractive inside and out. I’m seeking that special person that recognizes when someone is doing something special for them and has the awareness to at a minimum say “Thank you”, someone who’s a Team player, someone I can talk to about anything and don’t have to worry about being judged. I am not perfect by any means and I don’t expect this person to be either. There was only one “Perfect Man” the rest of us are just “Work in Progress”. I’m looking for a relationship with a “lady”, someone that makes both of us stronger as individuals and partners. Scared yet? I love Country music and some songs give a person a great way to express themselves. Check out Randy Howsers latest release titled “In God’s Time” and you’ll see what I mean. There are many, many more out there that I’d like to share with that special someone.", "email": " declanfunman1@yahoo.com", "tags": ["Male profiles", "confirio", "romance scammer"], "gender": "male", "images": ["awesomelove19671.jpg", "awesomelove19672.jpg", "awesomelove19673.jpg", "awesomelove19674.jpg"]}