{"year_reported": "2018", "month_reported": "01", "username": " eddytovia", "name": " Eddy Tovia", "age": " 48", "occupation": " Self Employ", "status": " divorced", "inet": " 104.201.91.82", "description": "\nLife is a journey not a destination.Am Hoping to find that special someone to join me on that journey. Well am Vern by name.I guess you could say I’m shy when it comes to meeting new people, but once I get to know them I open up more. I’m a caring person. Love new adventures!I can hold up my end of a conversation and probably make you laugh too, but I’m also a very attentive listener.It will be great to meet the woman of my life. I believe in the fairy tale soul mates,I know it exists. It takes a lot of courage and faith.I know most people have been hurt in the past or don’t believe that those types of relationships could be real. I’ve been hurt and I’ve seen plenty of couples and marriages that aren’t working. But I believe and know that if we choose correctly with our hearts and minds we can find real, all-out love. Well I’m not perfect, but I have many positive qualities and I refuse to settle for anything less than what I deserve. I would describe myself as someone who is mature, candid, affectionate, and believes in integrity. I am easygoing and an adaptable person…classic, sophisticated, but down to earth that knows how to let loose and enjoy the moment and be a little wild too! I can be very naughty and unpredictable at times, yet I am quite a lovable Guy! I am passionate and creative who enjoys diversity in life. I am happy staying home to watch a movie or can be spontaneous to take a weekend trip without much planning! Quality certainly outweighs quantity in my life. I’ve learned a lot from observation and what others have to say; My way of doing something or handling a situation isn’t the only way… it’s just the only way I know…so I welcome suggestions and opinions. I love to laugh and have a good time. I am good heated, faithful and down to earth, love kids and pets. I enjoy the outdoors, seeing the stars at night, listening to the sounds of nature. I’m looking for a sensible woman who wants someone to share the ups and downs of this incredible gift we call life. Someone who is kind, honest, FAITHFUL and has a sense of humor. When you hold me in your arms, will you make me feel safe and warm? Have you made it all the way to the end of my profile? Then what are you waiting for? Drop me a line and let’s plan our next adventure.", "email": " pipeline.us@yahoo.com", "tags": ["Male profiles", "love scammer"], "gender": "male", "images": ["eddytovia1.jpg"]}