{"year_reported": "2012", "month_reported": "11", "username": " alexil", "name": " Alex David", "age": " 47", "occupation": " building contractor", "status": " divorced", "inet": " 46.20.33.96, 172.129.78.66", "description": "\nI’m a fun, outgoing active person, full of life. I maintain a balance between career, family and personal life. I love nature, adventure, sunshine, moonlight, and a good laugh. I’m a happy, caring, romantic, passionate person and a loyal friend. I’m generally down to earth but appreciate finer things in life.I have a very outgoing personality, but it has been damaged by people who I though cared about me. I am careful now as to who I give my heart to. I love (almost) anything having to do with the outdoors. I dream of a nice walk along a garden path to a lighthouse or a waterfall with an enjoyable companion. I dream of sailing to a glorious island paradise with a jovial friend.I love long walks on the beach, candlelight dinners and am a romantic at heart i’m a considerate and caring person who is always willing to go that “extra” mile in a relationship–and expects the same in return.Sometimes quiet at first meeting, until I get to know somebody. I holding hands, competitng or going out on a quiet trail ride or the beach. My Little Daughter the most important person in my life. You will need to be able to share some sort passion for animals as they are all a big part of my life at this moment and need and depend on me. Beside this I love to go to a soccer game, Nascar, Motorcross and the Drag Races…im sort of kid at heart…but can dress to the nines for that special occasion. ..\nI’m a family Oriented man and I cherish my friends, I’m casual, most comfortable in my suits, and enjoy going out somewhere special too and getting dressed up. I love to barbecue EVERYTHING if it can be put the grill! I’m at ease at a backyard barbecue or a social function and can hold a conversation with just about anyone.\nI am looking for a female companion to go on walks,to enjoy the ocean, the lake and the mountains and to share in interesting conversation, someone easy going.My perfect match would be someone who I can have a lot of fun with, someone who is outgoing and not afraid to speak their mind. Also respect is important with me I believe that you need to give respect to recieve respect. Another important quality for a relationship in my mind would be to enjoy spending quality time with a special someone.I’d like to meet a woman with a great sense of humor who can laugh with me. she’ll need to be confident, honest, caring, affectionate and sweet. When we talk on the phone, or in person I would like hear/see the smile and laughter in her voice.\nI really love a big-hearted woman. I’m not into women who are stuck on ones income or status. I need honesty and dont like liars. I enjoy hearing about how your day went or just snuggling together. Compatibility and trust is a good foundation, but chemistry is the key factor to a great relationship. I am very honest and was raised the old fashion way.I would love to meet someone who shares a passion for something in their lives…something they truly enjoy. I feel so blessed to have my passion become my profession. I think that is truely success. To meet someone who has their own interests and passions and is willing to share a life together while having separate interests is very healthy. I have lots of love to offer the right person…seems like my judgement hasn’t been the best in the past few years. I will try letting someone else lead me in the right direction. Laughter is very important to me…it can cure a multitude of woes…\nIF YOU LIKE WHAT YOU READ AND YOU FEEL YOU WOULD LIKE TO CHAT IM WITH THIS ON Y!M heartdesire2013@yahoo.com THEN DROP ME A LINE", "email": " heartdesire2013@yahoo.com", "tags": ["Male profiles", "besocial", "dating72", "match"], "gender": "male", "images": ["alexil1.jpg"]}