{"year_reported": "2016", "month_reported": "07", "username": " Amosphilip", "name": " Amos Philip", "age": " 47", "occupation": " soldier", "status": " separated", "inet": " 197.211.57.5", "description": "\nI usually have an inclination to be sympathetic, nurturing, supportive and very sensitive to the emotional needs of other people. I also like to be needed, to care for others. I often worry about the people I love. I have a very strong need for a sense of belonging and acceptance, and I center much of my life around my home. I’m more concerned about people and their feelings than with power, achievement or position in society. Kindness, consideration and tenderness impress me more than any sort of honor the world can bestow. I can take things very personally, and sometimes build a wall around myself to protect myself from pain and rejection. Of course there will be times when I need to have a place and time to withdraw, introspect, dream and replenish myself\nI function in an instinctive, no rational manner and like to immerse myself in creative activities where I can express my feelings, imagination and instincts. I often love to cook, since it can be both creative and a way to nurture and nourish others. I also have a great affinity for music, because it evokes and communicates feelings that may be difficult or impossible to put into words. My compassion, sensitivity and imagination are my strong points. Usually I’m a pretty positive, energetic, active, and a go-getter type of a person. I enjoy competition, and have a good amount of self-confidence to be a winner at anything I do. Along with my energy and memorie, I have high ideals and an active fantasy life. There is a dreamer and an idealist in me, as well as a doer and a fighter. I want to win but not at others’ expense. Being realistic and practical, I set goals for myself that are modest enough to actually achieve. I’m able to tackle long, difficult projects and see them through, and possess self-discipline, concentration and perseverance. I also have a strong sense of responsibility and I’m very conscientious in fulfilling my obligations.", "email": " Amos222222@Gmail.com", "tags": ["Male profiles", "military scammer"], "gender": "male", "images": ["Amosphilip1.jpg"]}