{"year_reported": "2013", "month_reported": "08", "username": " narsa2", "name": " Narsa Ayisha", "age": " 32", "occupation": " –", "status": " single", "inet": " –", "description": "\nAbout Me\nMy name is narsa 32 yrs old Single from west africa Ghana And live in the City of Accra-Ghana to Completed my Education and i have Just Completed Last Month and Help my Gramma to sell Food Stuffs,African decert female, single, no kids, 5-6 ft tall, 128 lbs,And i will be 33 yrs old on 1st may ………I generally try to live a somewhat healthy lifestyle, exercising and some sort of jogging, 3-4 days a week and eating healthy, (trust me, I love sweets and pastries, but try not to over do it). I would also like to find a like-minded male where we can participate in activities together and encourage each other to pursue their interests as well. I have several hobbies (and wish I could find more time to pursue those) such as swimming, playing computer, dancing, and reading, and more, and would like someone to share that with, as well as their sharing their interests with me.I am generally an optimistic person with a sense of humor, fairly easy-going, and I don’t think that I’m too critical about things, but I also believe that it takes two people contributing to a relationship to make it work…I am searching for someone who shares the following qualities with me.Thoughtful, loving, goal oriented, along with sense of humor. I love to laugh and smile. I also love to read, watch TV and cook, my interests are many…. I am honest, intelligent, loyal, affectionate, and easy going, romantic, soft-spoken and sensual. I’m romantic, caring, and much more! I’m “crazy” about all pets.. Especially dogs and cats.\nI love nature.I am also an animal and nature lover. As far as interests mine are many and varied. I am comfortable doing or trying anything at least once. I really love the outdoors, sports, health and fitness, reading, computers, etc. I am not much into the night club or bar scene. I am slightly more introverted than extroverted but am good at communicating one on one or in small groups….I like books and reading Bible ..I’m looking for a partner for life…….. Are you the one?? Appearance is important but more importantly: Are you an honest, caring, loving guy ? I also realize that at times two people are just too different to be in a relationship together, it doesn’t mean that it’s anybody’s fault, it’s just that they’re too different to be compatible….I am looking for honest, good looking, respectful, easy going, open-minded and trust-worthy person and beside I’m not looking for someone to live with, I’m looking for someone I can’t live without and I’m also looking for someone, who can take as much as I give, give back as much as I need, and still have the will to live.As I mentioned earlier, I like to do things with the other significant person in my life, but I also encourage him to go out and spend time with friends and pursue his own interests and hobbies as well. I believe that time spent apart helps keep things fresh in a relationship and makes the time we do spend together even better.. I’m not one who cheats in a relationship; one man is enough trouble ; I don’t have the time or energy to juggle 2, 3, or 4 at the same time – haha. But I also want to be in a relationship where I can totally trust the other person and not well on how the relationship is not working……I was been cheated by some one so i just decieded to be very carefull and find out if possible i will be able to find my soul mate some one with good heart some one open mind some one with much respect……I am looking for some one who is caring,lovely,passionate,respectiful,handsome,truthful,trustful,some one who don’t lie some one who always tell the truth some one with good heart and some one with always in believe of what ever is doing so please let me know if you are interesting on me because i was been cheated before so how can i have a trust and faith that you wont do the same to me,Well who know’s life is short when we understand each another i think things will be alright for\nus .", "email": " narsa_ayisha@yahoo.com", "tags": ["Female profiles", "confirio", "love scammer", "Princess Blueyez"], "gender": "female", "images": ["narsa21.jpg"]}