{"year_reported": "2012", "month_reported": "08", "username": " kellysmith334", "name": " kelly smith", "age": " 39", "occupation": " military", "status": " –", "inet": " 184.75.217.110", "description": "\nIts hard to describe myself I would have to say that I am attractive, confident, intelligent and independent, with a very nurturing side. I am loyal to friends and family and consider myself to be truly blessed to have such wonderful people in my life. I love to travel and meet new people, yet cherish my time at home. I have a great career and have an outgoing personality. I have had some very serious relationships over the years, but just have not met the right person yet. I firmly believe that everything in life is timing, so I remain hopeful in the search for my soul mate. Chemistry and a sense of humor is a must, as is spontaneity and a love of children. I also enjoy traveling and am a pretty down to earth lady, love to laugh and like to make people laugh —caring– affectionate –love to cuddle. My personal\nABOUT ME\nHi,I have been so blessed in my life with such wonderful friends, family, and a great career. Not to mention the best two boys any mom could ask for. Maybe life would be too perfect if I could find a special man to share it with. I guess that is a chance I am willing to take. I am not out for fun and games so please consider that if you contact me. I am sincere and loyal looking for the same in a committed future relationship. If I find that special man I will let him know everyday of my life how much he means to me. It is what I do best appreciate you. I’m a very motivating spirit with an intense appreciation of life. I take full advantage of opportunities to learn and advance in business as well as socially.", "email": " kellysmith334@yahoo.com", "tags": ["Male profiles", "military scammer", "netlog"], "gender": "male", "images": ["kellysmith3341.jpg", "kellysmith3342.jpg", "kellysmith3343.jpg", "kellysmith3344.jpg", "kellysmith3345.jpg", "kellysmith3346.jpg", "kellysmith3347.jpg"]}