{"year_reported": "2017", "month_reported": "01", "username": " derickluv", "name": " Derick Large", "age": " 51", "occupation": " Road And Building Contractor Eng", "status": " widowed", "inet": " 68.64.172.154", "description": "\nMy name is Derick I’m in to a Road Construction of a successful business. My character is strong and caring. Friendship and good conversation are important to me. I’m from Catonsville,MD . I really do work hard and have achieved a good deal for my efforts. Sometimes I work long hours so patience and understanding are needed. I do like to go out with my partner and have a good time as there is nothing like spending quality time laughing and having fun with them,I am a romantic, creative and smart man with temperament and a good sense of humor. My Hobbies: music, sport, traveling and different cultures. I like to be active but also I like to sit at a romantic place with good music. I am optimistic, self-confident and independent. Also I am serious, honest and not married.I lost my wife to breast cancer some years ago. I have my own, successful business…\nWell I am looking for long term relationship.Yes am caring, sincere, loving, honest, loyal, devoted, (if i had my partner), and goal orientated individual. And sometimes looks isn’t everything,l don’t believe in age in a relationship all that l want a woman that will make me happy so much and make me feel so good and that will be faithful in all things that she told me that will be truthful to me will you be like that for me? that is all that l need from a woman who will feel comfortable in a variety of environments. I want a woman who is independent and who doesn’t NEED me, but WANTS me and thinks I enhance is life. I hope she will see me as her closest friend. I want a woman who is self-confident and who doesn’t feel the need to put on airs. she most be ready for us to work together as soul mind and body and to be able to make our family happy in any ways of our life. Most importantly, NO DRAMA 🙂", "email": " dericklarge111@yahoo.com", "tags": ["Male profiles", "romance scammer"], "gender": "male", "images": ["derickluv1.jpg"]}