{"year_reported": "2013", "month_reported": "05", "username": " frankhatton", "name": " Frank Hatton", "age": " 49", "occupation": " Contractor", "status": " widow", "phone": " 925-364-5112", "inet": " 198.144.116.196", "description": "\nIm an Independent Contractor of international repute. I deal basically with oil platforms ranging from middle east and far east Asia and i also supply building materials to construction companies and also to my customers overseas. I work with a great bunch of people that makes it fun to go to work, but my free time is very important to me. i am a great guy….Really I am! Trust me on this one:) I am normal I have learned a lot, hopefully am a better person, and know what I want. I dont get it right all the time, My kids are almost grown. One is off to college and one has his own car, so I am pretty free now. I am affectionate. I am a gentlemen; opening a door for a lady is second nature, at least on the first date…(no really, all the time). I am that rare combination of shy guy coupled with a quick wit. Hopefully, the quick wit guy shows up on the first date, not the shy guy. I am a golf junkie, and secure enough to say it. Hopefully, that doesn’t scare you but you might as well know up front. Better to be passionate about something then nothing at all. I am also a huge Giants fan, and love to go to games. Sports do not define me, however. There is a whole lot more that is best found out in person. I love good meals with good friends, especially Chinese and Mexican (with a good Margarita). Preferably on a warm night where we can sit outside, and then take a walk afterwards. I have been on this online hamster wheel for a while now. Do you know what you want? If you think it is somebody like me, I would love to hear from you. If its not me, I wish you luck.", "email": " frankhatton01@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["frankhatton1.jpg", "frankhatton2.jpg", "frankhatton3.jpg"]}