{"year_reported": "2013", "month_reported": "05", "username": " lovelydadusa3009", "name": " James Lambert", "age": " 52", "occupation": " contractor", "status": " –", "inet": " 198.55.124.228", "description": "\nAm a perfect gentle man and i need a woman to be in my life to be cared love and taken care of for the rest of my life am ready to go to any lenghth with her so far she is nice, shape or beauty does not matter just her character alone and her thinking so go on am waiting…… I’m honest, sincere, loving, loyal, and a true romantic. I believe in treating people as i would like to be treated. With kindness and respect. I think men\nand women are equal and should treat each other with mutual respect and understanding….. i must tell you that i’m an easy going,honest, faithful and a one lady’s man …..who is seriously looking for a long term relationship and probably getting married i describe “LOVE” as the following…… “Love is like a river, never ending as it flows, but gets greater with time!” Love is a noble act of self-giving, offering trust, faith, and\nloyalty. The more you love, the more you lose a part of yourself, yet you don’t become less of who you are; you end up being complete with your loved ones.” “Love is when there are a million things you want to say\nto someone, but when they look you in the eyes and hold you in their arms nothing in life matters other than being with that person at that moment.” so sweetie …if u are sure of what u want and u are in for something nice ….. and i must state that i do dislike liers and cheaters….so if u are any of such pls leave…i am hoping and looking for a lady who is kind ,honest and faithful…. someone who is not afraid to tell the truth at all times ….if ever if it hurts.. I am in search of a decent God loving lady that will have time for me.Age are just numbers and shapes are just sizes your heart determine whom you really are.I am not\nsearching for money it never determines love i am in search of a good woman who had really know all about life and who is ready to settle down with me.Who is ready to share what i have and whom is ready to understand and whom is loving caring honest God fearing and faithful..I will like to meet someone who is serious in relationship….", "email": " james.lambert@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["lovelydadusa30091.jpg", "lovelydadusa30092.jpg", "lovelydadusa30093.jpg", "lovelydadusa30094.jpg", "lovelydadusa30095.jpg"]}