{"year_reported": "2016", "month_reported": "01", "username": " samantha", "name": " Samantha Jo Long", "age": " 30", "occupation": " self-employed", "status": " single", "inet": " 104.238.169.67", "description": "\nIt is so hard to describe myself, as I am sure it is for most people. I guess the best way to put it is that I am a really genuine person with a huge heart. I am very family oriented and I am looking for someone with strong family value. I am very friendly and love to be surrounded by fun, outgoing, positive people. I love to make people happy and I am looking for someone who I can truly be happy with! That’s really it, what you see is what you get .I just wanted to say that i’m SINGLE AND LOOKING!…I am a man seeking for an honest woman. I am very humble, interlligent, caring, loving. I am very passionate and affectionate. I like home coziness very much and I can also help in the kitchen as well, Family is the most important thing for me. I am kind, honest, decent, cheerful, romantic reliable and tender. I love children. I would like to meet a decent woman.who will be a caring wife.I am looking for a special one, my soul mate, a woman who will be my friend, my lover, my wife. I am looking for awo man I could love. I hope my dream of a happy family will become true. I’m single with a child, I am a very honest sincere person with a huge loving heart. I have a very soft heart and I am a very feeling person. I am very sensitive and a very gentle person,I am a very deep person and thinker. I am a dreamer. I am a hopeless romantic and believe in true love.I am a very heart felt person.I am a very creative person. I love writing and art. Also computers, music, collecting things and so much more,I have many interests. I love anything to do with the ocean. I love the ocean and beautiful sunsets.. Especially over the ocean. I love nature and animals.I am looking for woman who is honest, sincere, sensitive, kind, gentle, affectionate, loving, someone who I can have serious conversations with and also have a few laughs with.", "email": " donnywalter24@yahoo.com", "tags": ["Female profiles", "cupidbay", "facebook", "romance scammer"], "gender": "female", "images": ["samantha1.jpg", "samantha2.jpg", "samantha3.jpg", "samantha4.jpg", "samantha5.jpg"]}