{"year_reported": "2012", "month_reported": "06", "username": " Donada", "name": " SgtDonald Haggard", "age": " 51", "occupation": " I am a Civil Engineer in the US ARMY", "status": " –", "inet": " 65.49.77.213", "description": "\nI’m energetic, fun, loving, loyal, passionate, caring, and I have a great sense of humor. I’m a “fly by the seat of his pants” kind of boy, but I can also do organized. I’m affectionate, self motivated, and love having a good time with friends and family. I’m a romantic at heart and truly believe that romance never dies when you are with the right person. I love watching and going to sports events. SEC college football is my favorite, but I also watch the pros. I love weekend trips. Love the beach, mountains….but it doesn’t really matter where you go, it’s the company you take with you. Traveling….who doesn’t like to travel? I have been fortunate to have been able to do some traveling, but there are a lot of other places I’d like to see. Italy and Greece are on the top of that list. I take a very self conscious approach to my health trying to stay fit and eat right…..but seriously, I’m not giving up my chocolate! Lol. My smile and my eyes are usually the two things I get the most compliments on. They are, after all, the window to ones soul and tell the most about a person. I’m good hanging out at home at times as well as going out for good times. I don’t have much that keeps me from being unable to pick (or pack) up and go most anytime. I have been single for a long time now and find myself missing having that special someone in my life. I’m looking for a stable, long lasting relationship that is based on love, laughter, honesty, faith, and trust. Someone I can depend on and who can depend on me. Someone that wants to wake up everyday to live life to its fullest. Life is a beautiful journey and I’m ready to get started enjoying it with someone special.\nI’m looking for a stable, long lasting relationship that is based on love, laughter, honesty, faith, and trust. Someone I can depend on and who can depend on me. Someone that wants to wake up everyday to live life to its fullest. Life is a beautiful journey and I’m ready to get started enjoying it with someone special.", "email": " donaldhaggard39@yahoo.com", "tags": ["Male profiles", "4ppl", "facebook", "military scammer"], "gender": "male", "images": ["Donada1.jpg", "Donada2.jpg"]}