{"year_reported": "2016", "month_reported": "07", "username": " JoshuaStraus", "name": " Joshua Straus", "age": " 39", "occupation": " military", "status": " single", "inet": " 173.239.198.107", "description": "\nI am patient,generous, kind, and loving. I am always upbeat, have a positive attitude about most things and I like to have fun. I enjoy music, theater, movies and art. I love to travel, and to go sightseeing. I love museums, romantic dinners, seaside resorts and sunsets.. I’ve a naturally curious mind and love to learn about people’s, cultures, and so many other things. So meeting someone with different interests they can share with me is a bonus! I read everyday from both fiction and non-fiction for both relaxation and my love of learning.\nI believe life is a long process of learning if we only take the opportunities that come our way! I enjoy the outdoors and am so happy that the weather has improved so I can blade or hike and just enjoy the sunshine! I’m out in the garden, rollerblading or hiking on a beautiful day. I also enjoy the water and boating, canoeing and sailing. Been Business man gave me lots of experiences to share with you. I’m a closet artist but decided long ago that art is an avocation for me, so I enjoy a gallery or museum when I can. One day, when I fine my love I’ll have the chance to hone those skills for pleasure in my own ways. But for now I admire beauty and color in nature and in other peoples art. My Business involves compassion, teaching, writing and helping others. When you get to know me you will soon see how empathetic I am and how generous I can be. Still, the woman in my life will have to reciprocate in the same way to earn a place in my heart. People are my passion but family and friends come first, that is after caring for myself! I have a gym membership for when the weather is bad and I love to see the latest movies.", "email": " strausbaughjoshua@yahoo.com", "tags": ["Male profiles", "military scammer"], "gender": "male", "images": ["JoshuaStraus1.jpg"]}