{"year_reported": "2012", "month_reported": "06", "username": " hellene", "name": " hellene robsine", "age": " 27", "occupation": " B.sc", "status": " single", "inet": " 184.95.45.193", "description": "\nhmmm what can i say my name is hellene if I have to describe myself in a few words it would be always thinking about the next move. I like to constantly reevaluate myself. I am easy going and like to experience new things. I am a little shy at first but once I get to know you I open up. Its true what they said about the quiet ones those are the ones you have to watch out for… Im very laid back and seeking the same kinda vibe from the person Im chilling with. My personality changes depending on my mood (isn’t that the case with all of us)?. I respect everyone ( until given a reason not to ). i have been hurt and used many times all because of love i just wana be happy. I am not a fighter but will kick your butt out and I will go beyond your expectations. On top of that, I am not afraid to speak my mind and always stand up for what I believe in…. I have a great capacity to find humor and hope when facing adversity. I have learned not too long ago that you can’t make someone love you. All you can do is be someone who can be loved. The rest is up to them…. Remember, there is always someone who loves you more than you know !!!!!!! To me age is just a number coz I have learned recently that maturity has more to do with what type of experiences you’ve had and what you have learned from them and less to do with how many birthdays you’ve celebrated. My best feature is my smile I have been told that when I smile my whole face just light up. I also have the reputation to be real to the core, with ability to be engaged in any social settings. I oscillate between an introvert and extrovert I like noise as well as silence but Im more incline to silence. The ocean, trees and wind brings me the greatest pleasure. I love nature and I also take notice of small things. Mentally I am moving rapidly but outwardly, things are going at a slower pace. I am very fascinated about different cultures…", "email": " hellenerobsine@yahoo.com", "tags": ["Female profiles", "badoo", "facebook", "romance scammer"], "gender": "female", "images": ["hellene1.jpg", "hellene2.jpg", "hellene3.jpg", "hellene4.jpg"]}