{"year_reported": "2016", "month_reported": "06", "username": " rcj405", "name": " Ashken Joel", "age": " 51", "occupation": " military", "status": " widowed", "inet": " 172.77.100.114", "description": "\nI am a loving, mature-minded man who is ready for a deep loving relationship where affection is present and generously communicated by words, gestures, and touches and confirmed by concrete actions. I realize the importance of sensual, sexual element between partners as well as the ability to surround your soulmate with care and understanding, attention to her wishes and aspirations, to be patient to her weaknesses and to respect her for who she is, for her uniqueness, to appreciate deeply her life-experience and efforts she also applies to make the relationship work. I am the one who is not afraid of a commitment, taking responsibility and working hard in order to enhance the relationship with my future partner. I am very gentle, warm-hearted and helpful and my woman can rely on me in any life situations. I have a tremendous amount of ability to accomplish great things. My reasoning skills, natural optimism and a lot of stamina give me the means to accomplish any t! ask and solve any problem. I enjoy being accountable for my actions and I attained a lot in a professional sphere but telling the truth I would exchange my achievements for being happy in private and family life. I devote much of my free time to self-education. I am inquisitive and enjoy getting to know something new. I appreciate family values and every moment I spend with my dear people whom I have not many. I believe that it is important to eat healthy food and that is why I prefer to cook myself and express my care in creating a real culinary masterpieces, which are not only delicious but useful, and treat my dear people with them.\nI would really like to meet a decent, serious, reliable, determined woman. The one who would be kind, have an open mind and soul and be ready to to build a life-long relationship with me. she should have a loving and loyal nature.", "email": " rcj405@yahoo.com", "tags": ["Male profiles", "facebook", "military scammer"], "gender": "male", "images": ["rcj4051.jpg", "rcj4052.jpg", "rcj4053.jpg", "rcj4054.jpg"]}