{"year_reported": "2017", "month_reported": "03", "username": " michealjohnsonhelbs", "name": " Micheal Johnson", "age": " 44", "occupation": " military", "status": " single", "inet": " 162.247.13.94", "description": "\nI’m adventurous, romantic, sweet, caring, honest, loyal and some would say sexy. I suppose it depends on your definition of sexy however (lol). I love a good conversation and a great debate. And trust me, I know the difference between a debate and an argument. I’m a lover, not a fighter. But, I will fight very hard for my loved ones. Family and close friends who means the world to me, and I would do anything for the people in my life. I get bored easily, so I try to keep things exciting both in my career and my personal life. That doesn’t mean that I don’t enjoy a quiet evening at home, cuddled up in front of the TV watching a good movie. With the right person, anything can be fun. I’m silly and goofy, but also understand there is a time and a place for fun and games. My mother raised me to be a MAN, and in all ramifications am in all aspects of the word. lol\nAm looking and interested in a relationship on a long term basis with one woman. Am by nature kind, generous,calm,romantic, very affectionate, understanding very passionate and most of all God fearing too, I enjoy giving and receiving affection, and am very openminded to new things people and adventurous as well. I am a well-educated, working professional. I enjoy reading, dancing, walking on the beach, fishing, camping, going to movies, just hanging out, and other fun things. I am very sincere and would enjoy a true romantic and fulfilling relationship. I am also down to earth, honest, not judgmental in any way, and very giving in a relationship as well as intimacy. neither do i drink nor smoke. Someone who will be there for me in good times and bad times as well, someone who will give me her attention and show me her affection as well, and someone i could give passionate kisses from her heart", "email": " michealjohnson421@gmail.com", "tags": ["Male profiles", "hangouts", "metrodate", "military scammer"], "gender": "male", "images": ["michealjohnsonhelbs1.jpg", "michealjohnsonhelbs2.jpg"]}