{"year_reported": "2016", "month_reported": "10", "username": " bauer1112", "name": " Butch Doug", "age": " 60", "occupation": " self employed", "status": " widowed", "inet": " 159.203.57.104", "description": "\nGood day thanks for stopping by at my profile.Can you be honest ? Can you complement, not complicate? I enjoy life to the fullest, try to have fun no matter what I’m doing. Always looking at the bright side Summer I spend a lot of time on the water. Love camp fires, games, bowling , darts, pool, I enjoy travel, photography, movies, beach, picnicks, theater, golf, horse riding, and good conversation love to laugh,I cook,clean,do laundry i ‘m a real man and looking for a real woman and any thing out doors. NASCAR watching and going to the races, concerts, street fairs, . Week end get always, by boat or van .. gas and gone… with no real destination. Exploring… I’m a very nice guy, I’m kind, thoughtful, considerate, easy going, enjoy helping others be happy, never get angry, I take everything in stride and easy going ,hard to anger, kind, honest, giving and polite, LOYAL.and always give thanks i am Someone you can count on!!. I enjoy showing my affection for my woman . Flowers for no reason ( just for the smile from her )Opening doors, holding a chair, helping with her coat go to the market with her,warm her bath towel in the dryer for her,spread rose petals all over the bedroom.Shower together by candlelight. , wake prepare the morning coffee for her before getting out of bed,Fix a hot cup of Raspberry Chocolate, cuddle in a warm afghan and watch an affair,tell her much i honestly feel for her,it works every time, to Remember. give her morning kissing ,and more other things to spoil the sunset together, surprise her everyday,like bringing home one small, unexpected gift each week,Surprise her with a crystal vase full of flowers,put a new piece of jewelry in her jewelry box and wait for her to notice it, Yes I have a job,i am self employed contractor, .What I do not have, is a special woman to enjoy life with.", "email": " butchdoug12@yahoo.com", "tags": ["Male profiles", "confirio", "love scammer"], "gender": "male", "images": ["bauer11121.jpg", "bauer11122.jpg", "bauer11123.jpg"]}