{"year_reported": "2012", "month_reported": "07", "username": " lawrence299", "name": " Lawrence Davis", "age": " 63", "occupation": " –", "status": " –", "inet": " 197.255.168.243", "email": " lawrencedavis299@yahoo.com", "description": "I am a person who looks beyond what may be the obvious. Character is worth more than flashiness.. I am a person who appreciates honesty and a great sense of humor.. I love to laugh and to enjoy the simple things in life. I would appreciate a person who has a good sense of who she is and a sense of direction about where she wants to be. I can appreciate a woman who sees a man as a friend and a partner…\nI know that men and women all have an inner child within and that is why I would appreciate days filled with fun and laughter. I respect and adhere to taking care of business in life–family, work, community, etc Yet, I know life involves alance. I look for the good in most situations and choose to look for the good in others. I know that life involves give and take and that what you seek–is that you must be willing to give and demonstrate yourself. I am a romantic at heart. I like to be appreciated and complimented to which I would do the same for that special someone…..\nI like discovering new things about the person you meet. I am a person who looks for the possibilities versus what cannot be achieved. life is better going through with a special one instead of just any one. I like poetry I like trying new things. I respect the direct approach-that is saying what you mean and meaning what you say. I believe in smiling-even when things are not going as perfect as you had hoped. A smile can brighten someone’s day-I liken smiling–it is one of my trademarks…\nI feel all is not fair in love and war. That is, I feel you should give someone your best and that you should exercise respect and honesty. I appreciate genuine companionship and soul inspired relationship. You the one in which you can feel the earth move beneath your feet with just one kiss. Or, one in which you spend idle moments just thinking about the other person", "tags": ["Male profiles", "love scammer", "mydailyflog"], "gender": "male", "images": ["lawrence2991.jpg"]}