{"year_reported": "2014", "month_reported": "12", "username": " ThankfulHeart01", "name": " Lucas Thomas", "age": " 49", "occupation": " –", "status": " single", "inet": " 105.112.8.4", "description": "\nI believe we create our lives through our thoughts, feelings, emotions and actions. I believe we have to love ourselves first before we can truly love another & manifest true love. I believe that we come from love or fear, and if it’s from fear…how’s that working for you? I believe that Love operates in the freedom of choice and from a choice I choose to come from a space of Love, Empathy and Compassion. I’m not looking for someone to just be with, but rather someone I can’t live without… Gandhi said it beautifully: “Happiness is when what you think, what you say and what you do are in harmony.” I am looking for someone who can resonate with these words and apply them to their life as best as they can. Who am I…? I believe that I am a person looking to make a difference in my life as well as those that I have in my life. While creating Love, Empathy, Compassion and Oneness in my life I in turn look to share that connection with my partner. In my mind, as a union we come together in community to support one another with all that life has to offer. While connecting in a heart coherence state and then showing up in a space of Love we connect on every level…in my mind that’s the nectar of life and heaven on earth. I feel the greatest experience is being in Love with ourselves and then sharing that Love with the ones we Love…it doesn’t get any better than that. So, I am interested in a beautiful woman to share a life with a man who understands this, is aware of this and is willing to show up for a relationship in a space of integrity, dedication, trust, transparency, support, goodwill, laughter, communication, compromise, respect, Love, heart coherence, connection, honor, intentions of bliss, telepathy, etc… I am interested in meeting someone that I’m mentally, physically, emotionally and spiritually connected with and our relationship exudes this energy. I am only looking for this special connection to co-create our magnificent existence in the highest vibration?Love. I am intending for a magnificent relationship where two people are constantly working on their relationship with themselves and our union, being in concert with the flow of our universe creating harmony and bliss! I value prayer/meditation and I am looking for one who participates in this process. I am in tune with my Divine Feminine side and I look to grow it with my soul mate worthy of my Love, as her Love will be cherished by me and all that I stand for. My Beloved’s level of consciousness echoes with her thoughts, feelings, emotions, intentions and actions and this is how we co-exist and co-create our experiences… There are many possibilities and I am willing to work with you so together we can co-create our magical life in concert with Love! Now here?s this kicker? I vow to you that I will do the absolute best that I can to create a bridge that allows for a connection for a heart coherent state. Know that I will make mistakes, but I will honor me and you in the process. I will create dialogue that is supportive of a language of Compassion and create a possibility to where we may allow for reaction and support that space while connecting with what?s truly important?our Love! I look forward to hearing from you and creating a life worthy of our magnificence? An amazing woman who is able to Love and be Loved… I will stand by my Love through life: standing in front of her when I need to protect her, beside her to journey with through life with all that life has to offer and behind her when I need to support her… Know that you will be Loved on many levels. Infinite Love and Gratitude..", "email": " lucas.thomas66@yahoo.com", "tags": ["Male profiles", "confirio", "romance scammer"], "gender": "male", "images": ["ThankfulHeart011.jpg", "ThankfulHeart012.jpg"]}