{"year_reported": "2013", "month_reported": "05", "username": " toloveyou09", "name": " Justin Rush", "age": " 44", "occupation": " Am a contractor", "status": " divorced", "inet": " 196.46.245.57", "description": "\nA person is incomplete without love..Love is a noble act of self-giving, offering trust, faith, and loyalty. The more you love, the more you lose a part of yourself, yet you don’t become less of who you are; you end up being complete with your loved ones..Live by the golden rule – do unto others as you would have them do unto you. Help at least one person each day and be kind to all you meet. I am not into games. I mean what I say. These are some values I have and look for in other people. I want someone i would spend some good, quality, fun time with, most of my life has been career oriented. I set career goals for myself and I have met those goals. I have a great job and i believe i have done very well for myself. I like to go shopping with women. I consider them my teacher. I am trying to break into being an entrepenuer and love to find out why women buy the things they want or need. That’s the goal of alot of entrepenuers. So if someone needs a shopping buddy, then “Hit Me Up”. I only show my love, and generosity. I am very much a practicing Christian. When I was 10yrs old, I prayed to god that I was giving Him total control over my life. The thing that I didn’t realize (until later on) was that He already had total control over my life. He gives alot of people the choice of letting Him control their own lives. For me, He did not give me a choice. He took control over my life whether I liked it or not. In my mind I believe there is an afterlife. If you want to know why I believe that, then ask me. I’ll tell you some real interesting things that happened. If you’re interested, then hit me up!! .Now it is time to find that special someone. I hope I’m not to late and there are some left!!", "email": " justinrush001@yahoo.com", "tags": ["Male profiles", "connectingsingles", "facebook", "love scammer"], "gender": "male", "images": ["toloveyou091.jpg"]}