{"year_reported": "2017", "month_reported": "04", "username": " tameika0100", "name": " Tameika Amber", "age": " 32 or 34", "occupation": " Interior Designer or Teacher", "status": " single", "inet": " 88.202.186.222", "description": "\nI am well mannered,witty and able to make you laugh.I am young both in body and mind.I’m very fit and healthy,I am considered to be very successful in business and it is now time for me to be able to share a great deal with a friend/partner.\nI have traveled extensively,and wish to travel more this time with someone by my side to share the fabulous experiences that travel offers.\nI am passionate about food,wine,music,love and life.(not in any order).I am more than competent cooking..I love coffee!to sit at a cafe with somebody you care about and drink great coffee,is almost as good as it gets,(it’s not but you know what I mean)\nI always look for the good in others. I believe communication is the key to a successful relationship and in my opinion, there should be nothing that we could not discuss openly with respect to each others point of views.\nI enjoy fine dining and am always looking for someone to share the appreciation of good food and fine wine.\nI believe there is give and take in a relationship, and I don’t have a problem doing laundry, cooking, and cleaning,I consider myself to be a fairly honest and truthful person.\nMusic can and does stir my emotions,( only this June long weekend while driving the song that tells the story of my life came on &quot;I want to know where love is&quot; by Foreigner,to me it tells exactly the way I am, however, Rod Stewart is my goal with&quot; You are in my Heart and in My soul&quot; this maybe pathetic to some, but real for me!)to listen to great music and prepare a great meal,to entertain and be among people you care about is what I guess I am looking for. I would love to trust and share my life with a honest man who is affectionate with his woman and will stand by his woman as I would stand by my man. A person who will work to resolve issues, rather than win arguments, who takes pride in who he is, and likes the simple things of life, has morals, values, honesty, and is financially sensible/conserving. I love animals. Relaxing quiet moments are needed too. I do enjoy any nice music (Jazz, western country, gospel, classic). I love the gym and exercise regularly just to keep me fit. I do have great sense of humor, good listener, hold hands and get lost in a passionate kiss. I want to know my possible partner’s inner beauty, his hopes and dreams, his feelings about life, personality, hobbies and what kind of things make him happy.I feel that when a relationship starts as friendship, it builds a great foundation for a full loving relationship later and means more when it gets to that level. I’ll tell you a lot when we get the chance start our new friendship.", "email": " tameikaamber@gmail.com", "tags": ["Female profiles", "facebook", "linkedin", "matchdoctor", "Melissa XoXo", "romance scammer"], "gender": "female", "images": ["tameika01001.jpg", "tameika01002.jpg", "tameika01003.jpg", "tameika01004.jpg", "tameika01005.jpg", "tameika01006.jpg", "tameika01007.jpg"]}