{"year_reported": "2016", "month_reported": "12", "username": " woodkush", "name": " Wood Kush", "age": " 46", "occupation": " u.s army", "status": " single", "inet": " 191.101.234.41", "description": "\nHi…So i’m on this site to find my Queen. Not just any woman but “the one”. Who knows who that is?. According to Greek mythology, humans were originally created with four arms, four legs and a head with two faces. Fearing their power, Zeus split them into two separate parts, condemning them to spend their lives in search of their other halves. Plato, The Symposium so that is what I am looking for. The other half ripped away from me by Zeus…\n(NO PHOTO-NO RESPONSE) I’m content with life and pleased with the way mine has developed. I’m very social, and love being out and about – either with friends or alone. I’m an avid reader of non-fiction: current affairs and government, psychology and philosophy, science and physics, as well as Dean Koontz. I’m very liberal, both socially and politically, reflective, introspective, analytical and psychologically oriented; I believe I’m open-minded, but not so much that my brain falls out; lol. As for relationships, I’m open to all that enhance my life and broaden my perspective. I appreciate people who are smart, kind and tolerant, and enjoy those who are adventurous and curious. I don’t expect anyone to be all things to me, and no one has to read my mind.\nI’m interested in meeting a woman who is kind, curious and not self-absorbed; someone who has a good sense of who she is and how she got here, understands her part in past liaisons and breakups, and has peaceful relationships with his children and exes. I expect tolerance and integrity more honor than honesty a sense of humor about most things, a forgiving nature, and a sense of gratitude about life. It goes without saying that her pursues healthy habits-smokers need not apply. I would expect that she would have interests of her own, hobbies, etc., that keep her busy and make her happy perhaps even a few that we can share. And I hope she likes to talk about stuff. I have no desire to be anyone’s king, prince or soul mate just an equal and a partner; I’m more interested in our ability to enjoy each other, cooperate, and resolve conflict when necessary. I’m attracted to a woman for whom a strong/smart man is exciting and a pleasure not a burden or a competition. I hope to meet someone who is confident but not to mouth running, and understands that none of us succeeds completely on our own.", "email": " woodhallora@yahoo.com", "tags": ["Male profiles", "badoo", "military scammer"], "gender": "male", "images": ["woodkush1.jpg", "woodkush2.jpg"]}