{"year_reported": "2017", "month_reported": "10", "username": " charlesxx1960", "name": " Charles", "age": " 53 or 57", "occupation": " Engineer", "status": " widowed", "inet": " 38.65.25.124", "description": "\nLove interesting and intimate chat, , and whatever else we could have fun with. A simple guy with simple values. Would love to find someone close by to get to know and take out to dinner with. Maybe that someone could be you.I’m soft hearten,loving and caring.\nI’m sucsessful in my busines and after my times of adventure, I’d love someone beside me to be with. I don’t look for someone, who wash and cook for me or is the “breading case” for my future children. I’m looking for the best friend to share my life, not more.I’m here checking things out for now, but will hopefully start meeting many, many amazing people here.\nI am a very loving, honest and faithful person. I am starting a new life and am looking for a special lady to share it with. I like childern. I have lived alone for 5 years and now it is time to share my home with the lady of my dreams. I want to share my dreams and to share yours. Life is to short not to fill it with love of that special someone. I have a big heart and want to give it away.\nI am looking for my soul mate, that someone special that makes me whole. honesty, loving truthful,caring, understanding.\nI am not looking for a model, only beauty of the soul, looks are a plus.\nI’m a family man who appreciates and adores a woman of intelligence, integrity, compassion, passion, and who loves to laugh.I have no problem with someone who has kids as i do have mine too and i believe they are the most beautiful gift of life anyone can have. I hope she loves animals, is positive-minded, open minded, loves music, books, and the arts generally. Ideally, she is attractive (at least in my eyes), take cares of her body and health, and embraces adventure as well as just hanging out. She is not afraid to show affection and loves making love.", "email": " father6060@yahoo.com", "tags": ["Male profiles", "pof"], "gender": "male", "images": ["charlesxx19601.jpg", "charlesxx19602.jpg"]}