{"year_reported": "2016", "month_reported": "04", "username": " Caringheart2015", "name": " Kevin Becker", "age": " 50 or 53", "occupation": " Engineer or Building contractor", "status": " widowed", "inet": " 198.49.68.116", "description": "\nI am a simple down to earth man who is loyal, romantic, spontaneous and responsible.. I am good nature and usually get along with everyone.I am also looking for my true love! Maybe it’s you. I also I ,spending time with family or friends at least.i find the lifestyle in much better quality and easier going, i enjoy life to the full but miss having that one special person to share with. I am looking to meet my soul mate, someone to love and cherish, i am very genuine and i am looking for a serious relationship,I don’t know if am in the right place or am just dreaming……..I’m very compionate , pionate and very smart. I have been through with so much in life and it makes me a better person. I am a simple down to earth man and my complexity can also understand how my future wife thinks and how to make her happy and i’m saving myself rite now to the person I will get hooked up with . I hate to be just an OPTION only and I don’t like to share someone’s apple of the eyes. I never lie and will never play games and am looking for someone who is brainy enough and knows how to take care of a very sensible man like me. Someone who knows how important a family would be and she a woman of honor with her own word and actions and not only just making all drawings on internet. My life before has no colors like black and white but right now am trying to add some colors on it, HOPING IT WILL BE A RAINBOW SOON..I’m a Hopeless romantic and I’m loving and sweet type of man and I’m looking the same for my woman. I am also looking for a God fearing woman too..", "email": " rbecker614@yahoo.com", "tags": ["Male profiles", "mingle2", "oasis", "tagged"], "gender": "male", "images": ["Caringheart20151.jpg", "Caringheart20152.jpg", "Caringheart20153.jpg", "Caringheart20154.jpg", "Caringheart20155.jpg", "Caringheart20156.jpg", "Caringheart20157.jpg", "Caringheart20158.jpg", "Caringheart20159.jpg"]}