{"year_reported": "2017", "month_reported": "04", "username": " nancywantlove", "name": " Nancy", "age": " 33", "occupation": " own my bussines", "status": " single", "inet": " 162.217.27.126", "description": "\nPlease read my profile carefully and understand it before contacting me.\nI am not on this site for dirty relationships, sending nude pics and showing nude webcams. I am a highly respected person and dignity means a lot to me.\nI’m a successful self employed fashionista entrepreneur, I’m a very happy lady and self confident, I constantly look for challenges and new opportunities,I do believe in my goals, my talents and my dreams. This things brings me hope and brightens my life. I never thought i would be on a dating site and here i am actually kinda surprised with myself for actually being on here. I have been hurt several times and here i am again after been hurt so many time after my last relationship was over. It’s time for me to meet a new spouse, celebrate companionship and enjoy our life together. I treat people the way i wanted to be treated.\nI am a very warm, passionate and deep person. I am very kind, caring, sensual and affectionate. I have a kind big heart. I value honesty and sincerity. Someone who likes me for who I am is very important to me. I like openness. I would like to meet someone who is not afraid to express what she feels and thinks. I am an intelligent, funny, easy going and down to earth person, I’m always carrying a grin on my face. I always try to see the brighter side of things. I believe that life is made to enjoy. I am a person that doesn’t give up easily. Friends and family are very important to me. I have had many challenges in life from which I have learned many lessons and they have made me stronger and who I am today. I am a determined person who knows what he wants and how to go about and get it. Although my career is very important to me, I value relationships and believe that life is made to enjoy to its fullest. I am looking for someone who is also caring, affectionate, funny, honest and who also has a passion for life. Someone who has similar attributes as myself. But most importantly someone who will love me truly from the dept of his heart and treat me good and with respect.\nI am looking for a man who will make me laugh, who is not proud, who more or less shares the things I like to do and wants just that bit more out of life. It would be nice to meet a ‘soul mate’ but obviously that’s a rare thing and one has to start somewhere so maybe you fancy a walk along a river or a long walk at the beach. A trip to a stately home to see what we have in common and whether we should move on from there. Someone who is beautiful inside and out. I s also nice and easy going. Someone to share the finer things in life with.", "email": " nancy_f0016@yahoo.com", "tags": ["Female profiles", "romance scammer", "sugardaddyforme"], "gender": "female", "images": ["nancywantlove1.jpg"]}