{"year_reported": "2015", "month_reported": "08", "username": " Michaelworld2015", "name": " Michael Raymond", "age": " 60 or 55", "occupation": " Chemical Engineer", "status": " widowed", "phone": " 719-357-6512", "inet": " 23.92.212.181", "description": "\nAm a very active man that would like to meet someone that enjoys doing all kinds of things. I love the outdoors, music, concerts, travel, horseback riding, boating, kayaking, walking in the woods, dancing, going to beach and the list goes on…..I am pleasant, easy going, fun, spontaneous, generous, honest and trustworthy….I see myself as a unique individual with very specific positive qualities, among them sincere, genuine, funny sometimes, while also thoughtful.I have a good personality and get along with most people very easy to please. The person I’m with is the key to a good time…I’m not very good, but can play with enthusiasm!.I’ve always appreciated people of talent, no matter what type, I admire those that have gifts be they artist (you name the media- music, visual, escritero, etc). I think that I’m a nice guy, respectful but not a weenie, enthusiastic without being a doofus, and fun to be around (according to my late mom, with whom I still live… just kidding 🙂 I’m very open and honest, which you’d either love or hate. It’s difficult to summarize complex personalities in simple statements\nI am a hard working professional in oil field services industry Chemical Engineering who loves to travel the world where I have learned so much about various cultures, history and foods. More locally, I enjoy live theatre, movies, music, moderate exercise and staying connected. I enjoy nights out as much as staying in with a movie – and with the cooler months approaching, turning up the fireplace…..mmmm toasty. I’m just looking for the right woman to join me on these and life’s more committed ventures.\nI’m looking for a woman who just naturally clicks with me. This could be you if you have a well-developed sense of humor with the ability to laugh easily and share silly/goofy moments. Of course we’d also have compatible interests, share those all-important communication skills and oh, that chemistry thing too. So go grab a snack (I’ll wait), just send me an email and let’s take it from there\nI have only one daughter and she is all i have my sunshine and her name is Debby", "email": " onegoodheart2@yahoo.com", "tags": ["Male profiles", "badoo", "love scammer", "matchdoctor", "tagged"], "gender": "male", "images": ["Michaelworld20151.jpg", "Michaelworld20152.jpg"]}