{"year_reported": "2018", "month_reported": "05", "username": " Mikkie007", "name": " David Kramer", "age": " 48", "occupation": " military", "status": " widowed", "inet": " 185.244.215.233", "description": "\nI love friends and family, I am a fun person and make friends easily. I love life, love my family and still have some love to share with a special lady. Life can be lonely without someone…I am a person who is very real when it comes to life and its’ issues. Am honest,kind caring,affectionate,good sense of humor,easy going,free thinker,trustworthy and respect the lives of other people…..I’m a man who lives life as it comes to me. I don’t worry about tomorrow, for it will be here no matter what I do.The best days of my life are yet to come and i am looking for someone who will love and care about me for a long time relationship that can lead to marriage. Although I would consider myself be a romantic, I don’t believe that life is about the ‘grand passion.’ In reality it is more about comfortable comrade. I am really a fun person who loves people,loves to laugh, I am very caring,love music, dancing, singing ( in my car) ! Love the church…am a devoted friend. I like to have fun,I have strong moral values with honesty and integrity being the core of my personality, am very cool, i respect my dignity….I’m excited to see new places, meet new people and do new things.I’m not a fighter and I don’t argue, life’s too short but I do value friendship and intimacy.Respect is one of the most important requisites in a relationship, as are honesty and commitment. I enjoy going out to dinner, movies, walks,and quiet times. I love nature, enjoy learning, and have a deep respect and love for children. I’m fascinated with the world and different cultures and would enjoy learning more about them….I love to laugh and like being around people with a good sense of humor. I also appreciate people who are different and even quirky", "email": " firstclassmilitary2@gmail.com", "tags": ["Male profiles", "facebook", "military scammer"], "gender": "male", "images": ["Mikkie0071.jpg"]}