{"year_reported": "2016", "month_reported": "11", "username": " Thanku_Love53", "name": " James Smith", "age": " 54", "occupation": " Business", "status": " divorced", "inet": " 192.99.57.247", "description": "\nAm James i have a son.my ex sleep with my friend on my fuckng bed ..Plz am not here for games because i have been hurt so badly..Am caring, honest, good listening, and mostly God Fearing man, and a positive person.I am real easy person to talk to and a good listener. I love to play golf , I like going to the movies , or watching movies in my room , I am a family oriented person and there is more, but it would be better for you to find some this I like swimming but i don’t know how to swim , listening to music and dance to any kind of music, traveling and also a good cooking out for yourself.\nThe woman that I am looking for does not have to have all of the same interests as I do. I think that if he is different than me, it will make us better for each other. I am looking for someone that loves to have fun and can take a joke. An intelligent, witty woman that is open to doing new things. And that can be open about what is going on in her life. I believe secrets, as well as lying, can and will destroy a good relationship. I believe that communication and interaction with each other is also very important. I am looking for a woman that can show me Trust, also clear Two-way Communication, Integrity, Commitment, Mutual Respect, Honesty, Patience, and last but not least – LOVE! I know that this is a big list but this is the way that it has to be. A saying that I love and hold true is this – Love isn’t Love, until you give it away. I will also show you all of these wonderful attributes. Please be serious about what you say when you write to me. I am looking for a loving friend to become my loving man. Will that be you? If you are interested, let me know. I wait patiently for you. I will only communicate with man who e-mail me first, since those who don’t are lacking the confidence that I require in a man to begin with", "email": " jamessmith_07@yahoo.com", "tags": ["Male profiles", "dateolicious", "person"], "gender": "male", "images": ["Thanku_Love531.jpg"]}