{"year_reported": "2016", "month_reported": "11", "username": " Mrkie", "name": " Mark Cook", "age": " 55", "occupation": " Mechanical Engineer", "status": " divorced", "inet": " 213.183.57.40", "description": "\nI am a gentle mqn, honest person, with a good sense of humor.. caring, loving, and loyal person. Love to laugh, love to hug, love to kiss:My family are very important to me, as are my dogs and all animals. I believe relationships could be so simple with respect and consideration for the other person.I’m quite humble and appreciate the little things in life that people do to me and that I am capable of doing for others. Nothing would give me greater pleasure than to make someone feel special, loved, wanted and cared for..\nI try to cherish every moment of whatever I do, wherever I am, and value & everything I have.I’m a man who lives life as it comes to me. I do not worry about tomorrow because it will be here no matter what I do. The best days of my life are still yet to come when I meet a special woman. I cannot afford to play mind games because it hurts me really a lot!\nMy ideal of a match,romantic, loving, kind, intellectual woman who is not afraid to explore or tell his partner how she feels.I’m looking for someone who i can will spend the rest of my life’s with.someone special that I can grow old with, and i can always look in the eye and know that the love between us is just as wonderful and exciting as the day we just met..I’d like to meet someone of my type,Mostly a good listener and communicator.who enjoys the simple things in life, just as I do..who loves to laugh and take things as they are fun loving person, caring, romantic,who knows how to take care of a prince lol.nd Will treat me with respect and dignity and you will get more than you could ever imagine. I know my worth and place in this world and if that sounds modest then so be it. Our greatest achievement in life is to remain ourselves in a world that is constantly trying to change us.i like to share my dream and ambitions with someone i will love for the rest of my life and live happily as a big beautiful family.", "email": " 669markcook@gmail.com", "tags": ["Male profiles", "dateolicious", "hangouts", "Kevin Rockwood"], "gender": "male", "images": ["Mrkie1.jpg", "Mrkie2.jpg", "Mrkie3.jpg"]}