{"year_reported": "2015", "month_reported": "09", "username": " princerickard", "name": " Rickard Kunz", "age": " 49 or 54", "occupation": " interior designer or Geographical Engineer", "status": " widowed", "inet": " 80.255.10.235", "description": "\nI’m a very genuine person. I’m very outgoing and I can really connect with someone during a good conversation, I believe i am a simple, interesting, able to love and understandable person, i like equality, communication, mutual support, sharing everything , above all honesty and trust,i want no lies ,no hidden areas ,no mysteries. i think being truthful is the only way to get things run smoothly. That even transcends in my everyday life and makes me enjoy helping others. It’s safe to say that I am a people person and I understand what it means to be a friend to someone. You never get a second chance to make a first impression, so I make the most of every situation Sh.i love good conversation, cool places to go out and also home entertainment i am not afraid to accept my mistakes or improvements in my life and my personality though i believe i have made it quite good so far. i have a job , a house, travels i made , memories , interests ,opinions and also dreams and goals yet to be achieved or realized by the way I like music, movies, books, and games, travels, nature and peace at heart it brings………………..I’m in search of a remarkable woman of any native ,location or language because all that counts at the end is ‘HAPPINESS’ someone who has an open mind on life and is not bound by routines.she is the kind of woman who is caring and very supportive of her man,she is generous and has a heart of gold. she always pays attention to little details to make me feel special. she is well to do at heart and person , witty and entertaining.she is fun and is usually having a great time, she is confident but not arrogant. she is intelligent even if not educated but not pretentious, she is a woman of sincerity and integrity. she is versatile and comfortable with nature and it courses, she is successful and ambitious but not boastful The type of person that no matter what is going on she had my back. She is not perfect of course we all have flaws, but she is willing to work things out with me. She has a positive outlook on life and she is always aware of others feelings. Could you be my vision of loveliness? Maybe we’ll find out one day real soon.", "email": " mr.rickard_kunz@yahoo.co.uk", "tags": ["Male profiles", "love scammer", "match", "mingle2"], "gender": "male", "images": ["princerickard1.jpg", "princerickard2.jpg"]}