{"year_reported": "2012", "month_reported": "09", "username": " wesleydanty", "name": " Wesley Danty", "age": " 47", "occupation": " engineer", "status": " single", "inet": " 109.171.37.161", "description": "\nAm just a normal happy lucky single father that likes a laugh and joke, and basically enjoying a nice stress free existence, I love mingling and chatting away at my free time and sometimes my friends think am nuts Because I don’t ever get upset with anything. But it’s okay anyway as they always like hanging around me. I am not interested in casual acquaintances or more friends. If am looking for friends they lie everywhere. I am looking to a forever commitment, a one life stand love. I want to meet a woman who is interested in a real long term relationship and to enjoy the trills that go with it. Holidays, romantic meals, cuddling up and watching D VD’s. I have 1 kid who is with me half of the time and I love every minute I get to spend with her. We’re a Christian family and active in the practice of Gods work. My family and friends are important to me and we spend a lot of time with them. I love the symphony, exploring museums, and quiet nights eating popcorn and watching a good movie.\nLike a typical dad i work hard and looking to similar. I’m not a shy introverted guy- but am not an extroverted male either that has to show off. Am just somewhere in the middle confident and a little cheeky! SMILES I have a vast array of interests ranging from arts and crafts to photography, and many more I can’t even think of right now. Now on to travel I like exploring things and places new to me, be it local or in a far away land. Needed more have either really… well there is so much to say but my mind just went blank. SMILES!!!", "email": " wesleydanty@yahoo.com", "tags": ["Male profiles", "netlog", "romance scammer"], "gender": "male", "images": ["wesleydanty1.jpg", "wesleydanty2.jpg", "wesleydanty3.jpg", "wesleydanty4.jpg", "wesleydanty5.jpg", "wesleydanty6.jpg"]}