{"year_reported": "2015", "month_reported": "10", "username": " smiles0505", "name": " Bruce Errold", "age": " 48 or 50", "occupation": " solar engineer", "status": " widowed", "inet": " 109.150.67.17", "description": "\nFirstly I have a very close relationship with God he is the Author and finisher of my faith, and i would want a woman who also has a strong relationship with God. I consider myself a gentleman who keeps himself well groomed, clean cut, smells good, excellent manners with polite caring attitude towards others. I’m not the smash and grab type more the soft loving and considerate to a woman’s requirements and needs. I am independent, easy going, loyal, honest and faithful. I am no saint but I will never purposely hurt you. I love long and lively conversations with close friends and I am a good listener. I am growing old every passing minutes but I still play like a kid. I laugh and will always find ways to make you laugh too. I enjoy good red wine and juice. I love food. I can cook but prefer great meals crafted by pros. I work hard all week but my nights and weekends are for fun, I love traveling and I will go anywhere anytime. I am like an old dog, just open the truck door, whistle and I will be there, I love swimming a lot, I want you to know I take responsibilities and commitments just as seriously as you do. The values you find non-negotiable will be the same as mine. Honesty, trust and loyalty can’t ever be compromised. If you agree to share your life with me, you will be beautiful, sexy and extraordinary, no matter what your picture shows because I don’t care if you have hair or not If you are ready for an incredible long lasting relationship and think you can keep up, then I am definitely someone you should meet. If you consider yourself intelligent, funny, romantic, kind, caring and loving. I have been looking for you. I am NOT looking for perfection, all i want is a woman that is perfect for me.Honesty! Trust! Chemistry! is very important, all other things will fall into place when there is true love, It doesn’t matter what your body type is. The winner of my heart will always feel needed and appreciated.", "email": " bruceerrold@gmail.com", "tags": ["Male profiles", "badoo", "love scammer", "meetme"], "gender": "male", "images": ["smiles05051.jpg", "smiles05052.jpg"]}