{"year_reported": "2018", "month_reported": "10", "username": " bcook", "name": " Browna Cook", "age": " 28", "occupation": " I work in a restaurant as a cleaner", "status": " single", "inet": " 193.148.18.108", "description": "\nHello dear friend,\nI am Browna Cook by name as you may know. I am just new in the site, I don’t know how to start dating and what to tell you about myself only when you ask me..lol…But I think we can learn a lot about each other and our conversation will be enjoyable.\nThis is my first experience of corresponding in the internet and I don’t even know how to begin our acquaintance. I think that you are an interesting person and we can learn more about each other. I think that you are agreeable companion. Tell me what you think about me. For me, a man’s age, location, look and past life experience is not very important, and the distance between us, easily avoidable if you have a real desire.\nI am a serious and easy going person, I have a tender heart and like to be happy, i am a decent girl with good character and attitude but i am very private. And what about you? I hope that you will respond to my email and tell me things about yourself?\nI’m always honest and sincere. It’s always better to tell the truth, I hope that you will also be sincere with me and I’ll reciprocate. My dream is to create a loving relationship with a responsible man with good heart. I think I have already told too much and I hope that I didn’t scare you? Thanks for your interest and for writing me… Anyway I was glad to know you and it would be great if we continue our communication. If you have some questions, you are free to ask. I wish you a good moment. I’m looking forward to your letter and hope that you will write me soon. I’m glad to meet you. Your new friend", "email": " brownacook@gmail.com", "tags": ["Female profiles", "romance scammer"], "gender": "female", "images": ["bcook1.jpg", "bcook2.jpg", "bcook3.jpg", "bcook4.jpg"]}