{"year_reported": "2017", "month_reported": "05", "username": " alexandre", "name": " Alexandre Perrin", "age": " 52", "occupation": " self employed", "status": " divorced", "inet": " 74.120.223.185", "description": "\nI’m fun, somewhat shy initially and outgoing when getting to know you. I’m a thinker, I like quiet times, and meditate often. Hiking, biking, still play some golf, skiing, climbing the big ones though not as frequent as in the past, horseback riding in the mountains, fly fishing and sometimes I still go chase the big ones through the timber and all these activities are a part of my life. I like shorts and jeans in the summer and can be just as comfortable dressed to the nines. I don’t mind gardening and can do a great garden. I like the finer things in life and have never regret my career choice. I am an honest,kind,caring understand and of good sense of humor,passionate heart that’s looking for a stable relationship. I understand it is important to lay down lasting foundations for a lasting relationship. I am an active person who enjoys cycling and running best. I believe keeping fit is important. I am ready for that ‘final’ relationship as we grow into our ‘golden years. My desire is to meet a beautiful,sensitive, sensuous, warm, assertive single woman who wants a long term relationship. My interpretation of a real woman is one to whom you can pour out all the contents of your heart, chaff and grain together, knowing that the gentleness of hands will take it all, sift it, keep that which is worth keeping and, with a breath of kindness blow the rest away. If I haven’t chased you off and you are still interested, please write and lets get to know each other. And finally, a partner, friend and lover who is not afraid of commitment, intimacy and being monogamous in a lasting relationship.", "email": " alexandreperrin3@aol.com", "tags": ["Male profiles", "badoo", "facebook", "romance scammer"], "gender": "male", "images": ["alexandre1.jpg", "alexandre2.jpg", "alexandre3.jpg", "alexandre4.jpg", "alexandre5.jpg", "alexandre6.jpg"]}