{"year_reported": "2015", "month_reported": "12", "username": " seekreallover", "name": " Elena Williams", "age": " 34 or 35", "occupation": " Fashion designer", "status": " single", "inet": " 73.8.52.23", "description": "\nWell, there is no shame in being here and trying to find our match, is there? Yet, I still can’t completely shake the feeling :). I suppose there is a bit of a stigma around online dating, but it will all be worth it if I meet that special person whose path I might have never crossed in my daily life. A bit about me: I love nature and the outdoors. Taking long walks, hiking, biking, plane ride, boating, ATV riding, canoeing, Golf, climbing a tree, lying under a tree :), trying a new activity or sport, running along the beach in slow motion, jumping in a pile of leaves or rolling down a hill (that has been checked for sharp objects and animal droppings). Although I am guilty of going “full potato” and lazing around doing nothing, that is a trap you can fall into too easily, when you are alone. So while I absolutely don’t mind just staying in with my loved one, in general I want to get out there and take advantage of all that life has to offer, hand in hand. First of all, most of the time, I’m going to make you laugh. I have a pretty dry sense of humour and I tell a story well. I tend to look at the things and see the funny side of them and I am more than happy to share my perspectives. And be warned, once you do start laughing, it just encourages me to continue. When you’ve got a problem or something that’s bugging you, I’ll do my best to do one of two things depending on you. Either I’ll try and give you a different perspective and offer the best advice I can, or I’ll just listen, keep my mouth shut, and give you a smile and a hug and let you know it’s going to be ok. When I’m wrong, I will apologize, when you are wrong I will easily forgive. I will treat your friends and family respectfully and do what I can to make them feel comfortable around me", "tags": ["Female profiles", "mingle2", "romance scammer"], "gender": "female", "images": ["seekreallover1.jpg", "seekreallover2.jpg"]}