{"year_reported": "2015", "month_reported": "11", "username": " morristreffer", "name": " Morris Treffer", "age": " 54", "occupation": " international repute company", "status": " widowed", "inet": " 85.228.121.169", "description": "\nI am gentle and romantic person with real principles. Honesty, trust and mutual respect are the pillars of my relationship and life philosophy. I like to play with open cards. No games, lies, tricks and double life. I don’t take more than I give .I don’t ask for more than I deserve. Usually I go the extra distance to please my partner, because if she is happy then ultimately that would reflect on me and our relationship. I believe that communication, understanding, caring and tolerance among people are the lubricants which keep life wheel rolling. Nobody is perfect but GOD. The most important issue is that we learn from life school the right thing to do and apply it to the next phase of our life. Integrity is the best gift you can offer the person you love. Physical compatibility is very important, but the beauty of the mind only can last. I am a sensitive person with a lot of respect to the other people feeling. Commitment and sincerity are the secret of successful relationship. My life is not all that serious. I have a good sense of humor and attractive social life- that makes my life more interesting. I like good jokes and sincere laugh. I have energetic and active life style. Domestic, international traveling, outdoor activities, social gatherings, good music and being connected with the world are some of my hobbies. I have learned that honesty and good sex are not enough to make a lasting union ; there is more to it.Don’t marry until you both pass the hardest test of your lives.Don’t count on changing anybody,that’s naive on your part.Investing in a person is a gamble,but sometime you could be a winner.My philosophy in general is, if we claim to be a human beings, then should behave as such.", "email": " morristreffer@gmail.com", "tags": ["Male profiles", "badoo", "okcupid", "romance scammer"], "gender": "male", "images": ["morristreffer1.jpg", "morristreffer2.jpg", "morristreffer3.jpg", "morristreffer4.jpg", "morristreffer5.jpg", "morristreffer6.jpg", "morristreffer7.jpg", "morristreffer8.jpg", "morristreffer9.jpg"]}