{"year_reported": "2015", "month_reported": "10", "username": " wendy1014love", "name": " Wendy", "age": " 30", "occupation": " Self student", "status": " single", "inet": " 84.212.154.181", "description": "\nI am a simple person at heart, I enjoy god’s simple gifts, a rainbow, a waterfall, a sunset. You can always find a reason to smile. I am a happy content young lady who loves life and is grateful for all the blessings I have in my life. I try to find something to be grateful for every day because tomorrow is not promised. I am looking for someone who has a positive attitude and knows how to love life. I am a kid at heart, but with that said I know when its time to be serious. I know how to go after my dreams and find success in the things that I want,I am looking for a someone to laugh, tease, and enjoy life with. I have a full life with family, friends, and career, but I miss having someone special to share my life with.When you first meet me I will probably be shy, but once you get to know me you will find that I am a very affectionate, passionate woman.loves a good conversation, good food and awesome music. I love being outdoors and enjoying the beauty of nature; a walk in the park, gardening. I enjoy good clean fun, going to dinner theater, dancing or just hanging out with a friend enjoying their presence while having a stimulating conversation over coffee.I am a thinker, I usually do not make quick decisions. I am an encourage; I try to understand why things happen and find the good in a bad situation. I am inspired by those who have gone through terrible trials and have found hope in learning the deeper lessons of life.I am a Christian and I am totally convinced reaching out to the poor and down-and-out is exactly what Jesus would do. I am not superficial in any respect, but I do love to have fun.", "email": " godblessme354@gmail.com", "tags": ["Female profiles", "connectingsingles", "pof", "romance scammer", "sugardaddyforme", "waydate"], "gender": "female", "images": ["wendy1014love1.jpg", "wendy1014love2.jpg", "wendy1014love3.jpg", "wendy1014love4.jpg", "wendy1014love5.jpg", "wendy1014love6.jpg", "wendy1014love7.jpg"]}