{"year_reported": "2015", "month_reported": "06", "username": " johnjamie13", "name": " John Jamie", "age": " 51 or 55", "occupation": " business", "status": " widowed", "inet": " 141.0.8.135", "description": "\nI am a balanced combination of sensitivity, intelligence,humor, sensuality and attractiveness, with a passionate personality. I am more interested in the mind, heart and spirit of a person and our compatibility more than anything else. But still, there is a physical element there, so we must find each other attractive in all senses not only physical but also mental and emotional. I love to travel and when I do, I like to learn about people’s values and lifestyles, as well as learn about their music, art, architecture, and other aspects of their particular culture. The importance of good communication: it has been said, and I firmly believe, that good communication, or the lack of it, is the reason relationships, and many other things in life, succeed or fail. I have accomplished many things in life, not only professionally …. I was married for 20 years. How long does a partnership have to last to be considered successful? I am now in search of a special bond with a special person who would reciprocate my feelings with the same intensity. And when this happens, I suspect that my world and life, as well as her’s, will be significantly enhanced. What can be more challenging and satisfying than a life-long love affair with an intelligent, attractive [Bold] , and caring woman? Physically, I am 5″11 tall and am, therefore, height-weight proportional. My lifestyle is rather healthy with regular exercise and a balanced diet. I believe physical fitness is central to good health, and good health is important for the quality of the life we live. There! I believe I have done an honest self-appraisal, and when you meet me you’ll find I am exactly the way I have described myself here", "email": " johnjamie13@yahoo.com", "tags": ["Male profiles", "fishmeetfish", "love scammer"], "gender": "male", "images": ["johnjamie131.jpg", "johnjamie132.jpg"]}