{"year_reported": "2016", "month_reported": "09", "username": " cupplesj", "name": " Cupples James", "age": " 45", "occupation": " military", "status": " single", "inet": " 82.145.221.28 or 8.37.225.173", "description": "\nI’m well-groomed with neat habits. I don’t know much about fashion, but I’m willing to accept (and probably badly need) feminine help. I’m only vain about my blue eye. I hope I’m deep, but I’m not very complicated. My most appealing qualities are intelligence (hopefully mixed with some wisdom now) and humor (tending toward the wry and the silly)..\nI’ve been a social hermit for a long time. But thanks to sustained lifestyle, diet, and exercise changes over the years, I’m now in the best physical condition and health of my life.\nThat in turn has changed my attitudes and activities dramatically, and for the better. I do cardio and resistance training at home; I’ve embraced a new sport (road cycling); and I’m eager to return to some other sports that I’ve done well in the past, and to try new ones. My next romantic partner will also be a workout partner.\nI’m fond of romantic, exotic places. But I also appreciate the breadth and quality of entertainment opportunities. A romantic partner would enhance all of my typical entertainments — dining out; catching a movie, or a live performance or even just curling up at home together for ‘Game of Thrones.’ But I’m confident that I will also enjoy and embrace some of your favorite activities once you’ve introduced me to them. And we’ll surely find new thrills together that will become ‘ours.’\nIf you’re right for me, then you are very bright, fit, attractive, curious, romantic, passionate, independent, and reasonably well-balanced (neurotic’s okay, psychotic isn’t). You’re as comfortable in jeans as your little black dress, and we’ll look good together anywhere.", "email": " cupples_j@yahoo.com", "tags": ["Male profiles", "facebook", "military scammer"], "gender": "male", "images": ["cupplesj1.jpg", "cupplesj2.jpg", "cupplesj3.jpg", "cupplesj4.jpg", "cupplesj5.jpg"]}