{"year_reported": "2013", "month_reported": "05", "username": "  Honesty4Love", "name": " Scott Maxwell", "age": " 48", "occupation": " –", "status": " widowed", "inet": " 197.242.112.238", "description": "\nin short, I’m a person who likes to have fun but appreciates the little things in life and I want to find someone who is a reflection of the person I think I am. People would say…I’m honest, trustworthy and loyal. I’m dependable. I don’t take shortcuts. I work hard and I play hard. At the same time I have a big heart. I don’t judge – I’m not perfect and neither are you. I’m very spontaneous and I’m always game to do whatever, whenever. I have a great sense of humor there isn’t a movie I can’t quote. Things about me…I’m original From USA…I played football in college and i love football…I’ve been sky-diving…every year I go with friends on a “man trip” to a different location for the outdoors…my last concert was the Foo Fighters… I used to draw, so I appreciate art…I’m a music and movie buff…I do like social settings but don’t consider myself an extrovert…I don’t dance usually but will with a few drinks (not that you want to see that)…I like to cut and stack wood, don’t ask why…I am an Enginer… What I’m looking for…I’m open to having kids or not having kids, but what’s most important is that I find the right person to start a relationship with….no party girls…this person likes to have fun and travel, but could be just as happy staying in and watching a movie by the fire….has a sense of humor and doesn’t take themselves too serious…is not too high maintenance, but takes care of themselves…I know it is cliche but someone who is a good person. I get called a nice guy a lot, so it only makes sense right?i am not a wink fan you can Email me!!!. if you will love to know me feel free to email me here is my email address scottmaxwell2012 via yahoo mail thanks for going through my profile!!!!!", "email": " scottmaxwell2012@yahoo.com", "tags": ["Male profiles", "confirio", "facebook"], "gender": "male", "images": ["Honesty4Love1.jpg", "Honesty4Love2.jpg", "Honesty4Love3.jpg", "Honesty4Love4.jpg", "Honesty4Love5.jpg", "Honesty4Love6.jpg"]}