{"year_reported": "2015", "month_reported": "08", "username": " TEXTNOW9123350517", "name": " James Block", "age": " 53", "occupation": " –", "status": " widowed", "phone": " 912-335-0517", "inet": " 46.148.17.210", "description": "\nGod grant me the Serenity to accept the things I can not change, Courage to change the things I can, and Wisdom to know the difference. Live life to the fullest and believe in yourself. Im a person who takes life to what it is today that good things are worth waiting for. Always remember that for thoses who presist today dreams, are transformed into tomorrows successes. I am a very easy going person, caring, respectful, love to laugh, always keeping a smile, enjoy my career and always have a postive attitude. Communication, Honesty is the key of having love, peace and happyness. Being a good listener and having a understanding outlook with one another brings friendship and love to each other. My time spent not working is very valuable to me. I enjoy spending most of my time with the right woman am going to meet here once we love each other, who is a great wonderful part in my life. When I have time for me I like to stay active and be with friends and family. I help people for a living and have given most of my life to helping others, whether it is students in need of financial aid, pets in need of homes, people who love good theater, or adults with developmental disabilities. I’m always trying to help others. I have faults—who doesn’t—but I also have a number of exceptional qualities (I’ve been called “the complete package”–I’ll let you decide on that one!) I’m exceptionally kind, compassionate, intelligent, open-minded, adventurous, perceptive, thoughtful, loving, and generous. I have a good sense of humor and find humor and fun in many things. For those of you interested in personality typing, Please if you are out there drop a note and lets see if we fit in my Yaho Msger ID tom jamesblock1 @ yahoo.com I’m me am every honest man in my life to anyone but i think we need to be email each other first so we can know together", "email": " jamesblock1@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["TEXTNOW91233505171.jpg", "TEXTNOW91233505172.jpg"]}