{"year_reported": "2016", "month_reported": "03", "username": " johnluvw", "name": " John W", "age": " 54", "occupation": " real estate developer", "status": " single", "inet": " 162.252.172.83", "description": "\nIf you are seeking emotional companionship, good communication skills, understanding and support, a joyful time when together, I’m capable of that and much more. Chemistry or sensual attraction can be mysterious and unpredictable in my experience. Sensual attraction seems to have her own timing and often appears as needing time to blossom. The movie “Shadow lands” about C.S. Lewis is an excellent example of how that works.\nIf sensual chemistry is not immediately present, I always enjoy an interesting conversation and the opportunity to get to know who you are. What is happening in your world? What do you like and dislike? What experiences have you had that have made you who you are?\nI believe friendship comes first, and if a romantic connection is immediately present, what a delicious gift that is. I prefer to be cautious about instant romance, as experience has taught me human feelings can be deceptive and changable. With time, trust develops and then what is real becomes clear.\nAt this stage in life, I enjoy companionship and personal solitude. As Kahlil Gibran wrote in his masterpiece The Prophet about marriage: “You were born together and together you shall be forever more, but let there be spaces in your togetherness and let the winds of heaven dance between you.”\nI find that concept ideal for me.\nHaving made those practical, non romantic statements, I also wish to paradoxically add that I also believe what the Moody Blues sang, “I know you’re out there somewhere”. So while I am a realist about love and romance, I can be a hopeless romantic if the “goddesses” have so decided and cupid’s arrow hits my heart. With romantic love present, life takes on a lovely hue. Real love is a rational decision to commit to an imperfect person. This requires time to perfect.\nIf what I say appeals to you, I would enjoy an e-mail from you (I find “boldness” a turn-on). I do not believe the protocol that the male must always be the first to initiate contact. I am not at all shy (the exact opposite is true), so I appreciate a confident woman who knows what she wants and is willing to put herself forward.", "email": " wjohn1660@gmail.com", "tags": ["Male profiles", "mingle2", "waplog"], "gender": "male", "images": ["johnluvw1.jpg"]}