{"year_reported": "2014", "month_reported": "01", "username": " johnhazzard", "name": " John Hazzard", "age": " 58", "occupation": " –", "status": " widowed", "inet": " –", "description": "\nI am open to live anywhere and to do anything. . I would like to find a woman who realizes we are at this crossroads now by living those moments in our past. We are not perfect and can accept that and look forward to complimenting each other for the rest of our lives. I feel we (yes me too) have fallen into “selling” ourselves far too much here… I am simply looking for a woman who wants to live now and in the future… leaving the past as nothing more than a topic to help learn about each other. I am looking for her / us to be simple and want to be best friends, lovers, and true partners, standing by each other during all events that happen in day to day life.. I want to find my partner who when I look at her she will know from my smile and eyes how I care for her and always will… I truly feel this is very possible…\nI am a very easy person to be with, respectful and sincere. I still believe in “forever”. I am romantic, affectionate, caring, honest person. My best feature is a true heart. I truly believe there is a woman who will appreciate all that we can share together. I want to find this woman and treat her as if she is the only woman on earth. I have never cheated in my life, yet I have been on the receiving end of that mess. . I like to cook, go to movies, travel, camping, and weekend getaways, and going to sports events I would like to meet my match in all respects, of beauty, mental stability, and emotionally ready for happiness. I enjoy golf, drives in the country. Maybe dinner and then the drive back together. I enjoy trips to a casino on occasions, but know my limitations. I want to find the fun and appreciation in life with my partner. I like to do home improvements, I have my own tools, but will share them with you…Very open to relocate to be with my partner/mate. Simply put, I would like to meet a woman who is ready to go on her LAST FIRST DATE…I want to meet someone who wants me for me, and wants to be wanted for her attributes as well. How do you describe “ideal” ?? I feel we all change as we grow older so, my ideal woman would be a woman who believes this same thought. She would see that as we grow individually, we also grow together. Arguments and differences are settled with acceptance, respect and understanding. My ideal match is an attractive woman, not a beauty queen or model. Attractive to me is a woman who is cute, funny, and is happy with herself. All women are beautiful, they just have to believe in themselves. Personality and integrity definitely count BIG…A woman who understands what it takes to be happy. She will be honest,monogamous, clever, playful, somewhat sports oriented,happy in the country or at a black tie affair. Willing to share all, lead when she is more qualified, follow if she is unsure, walk beside me and hold my hand /heart gently yet securely for life. Together we will embark on the journey which will provide adventure and memories to laugh and dream about….I know I have had this same post for a while, but it is truly what I believe and feel. I am not a model or a millionaire, or a celebrity. I am a man with a good heart, compassion, dedicated and steadfast on trust and honesty. I want to meet a woman who feels the same as I do in many ways. I can promise I will do whatever I can to make your / our lives as comfortable as can be if the woman is ready for a serious and everlasting relationship", "email": " johnhazzard80@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["johnhazzard1.jpg"]}