{"year_reported": "2016", "month_reported": "11", "username": " parkadams", "name": " Park Adams", "age": " 43", "occupation": " military", "status": " widowed", "inet": " 209.126.112.185", "description": "\nI am Segt PARK ADAMS\ni am 44yrs old,i am 5’5′ ft tall,\nam from california stationed at fort Irwin base,\ni am currently serving USA Army,\ni am presently in NIGERIA now in camp victory,\nI had been in the service now going to 24yrs,\nIt has been my dream since i was young to serve my country and am glad i made it reality,\ni am a former USA marine infantry man, having served 8 active years with different infantry units,\nfrom camp pendulous CA.(1st battalion,9th marine regiment and 2nd battalion, 1st marine regiment) And camp lejeune, NC (3RD battalion, 6th marine regiment)\nI have been to a bunch of place in the world,including africa some of them hot spots,and continue to do so today.\nI am privileged to have served with highly professional individuals in the marines, and the tradition continues now in the Army.so well i lost my wife many years ago but since then i have know time to marry any woman, but now i have to move on with my life,but never mind me can will goon a future relationship together, am so humble honest, trustable, reliable,and i have the fear of God in mind am a very open minded man,i don’t play with time’s and am not here to hurt anybody’s heart, The type of person I am interested in is a woman who can laugh, be playful and light hearted, one who is motivated and ambitious, intelligent, and self confident. I enjoy meaningful conversation in addition to plain old good fun. I’m basically a very positive person who also loves humor and laughter and would like someone with an adventurous spirit and a positive attitude who can see the funny side of life, someone who is open and willing to learn new things. I like to share things I learn and am open to learning new things as well. lol I also love a gentlewoman who knows how to treat a man like a baby and a baby like a man. Romance and passion are important as well.Like everyone I talk to I want the whole enchalata, including chemistry. I have learned though that chemistry is not everything and not the only component for building a strong relationship.Beauty is in the eye of the beholder, and I would say I have more on the inside than the outside. LOL No one is perfect including myself but I suppose if you don’t put it out there and risk, you’ll never know. However I am realistic and I am by far not perfect.", "email": " parkadams1251@yandex.com", "tags": ["Male profiles", "military scammer"], "gender": "male", "images": ["parkadams1.jpg"]}