{"year_reported": "2017", "month_reported": "01", "username": " Tinabarnett", "name": " Tina Barnett", "age": " 29", "occupation": " Gymnasium", "status": " single", "inet": " 168.235.205.189", "description": "\nI am a very gentle, refined, charming, affectionate, loving, benevolent, patient, sincere woman. I am faithful and reliable, quite determined and confident and at the same time an easy-going, sociable, understanding person with a consanguineous temperament. I have mature views to family relationship and I would like to start my own strong family. I am open-minded and positive, enthusiastic and charismatic. I know that with a good man by my side we will be the best couple in the world! My hazel eyes will always be there for you filled with warmth and shinning brightly! Just imagine that every day you can look in them and see an ocean of love and passion! Is not it your dream and desire? It will be my greatest pleasure to fulfill all your dreams if we are meant to be together! So maybe it is time to see. My home is an example of the most cozy and nice dwelling and hopefully one day you will come and make your own expert judgment as for my ingenuity and ability to crea! te comfort. I like meeting with my friends. I am very hospitable. I am always open for new activities and hobbies and I dream about the time when I am ably to share some activities together with my future beloved man. Are you the one?I am an active, cheerful, punctual, careful, tender, calm and fair young lady who is looking for her man.I like good movies, theatre, traveling, shopping, nature, meeting nice people, diving, dancing. I do not mind if he has children.Life is given to us only once, and I’m taking from it all I can! I am interested in the world of relationships, communication, interested in every person, because all people are unique. I am Always ready to change myself, open to everything new that makes me a more unique person and allows me to develop myself. I have lots of plans and life for me is extremely interesting, so my most favorite pastime is to explore it. I have enough achievements in life. I have a job that allows me to feel confident, I have a child who does not give me the chance to feel sad, I have friends with whom I can have fun. But I need more- a piece of women’s happiness, a small island of love that is warm and cozy. Sometimes I want to feel like a little girl surrounded by care and warmth. I want to see affectionate, kind man, with an open heart and serious intentions next to me. My man will be the only one who can break into my inner world and really feel me, understand me. I am sure that I will meet him here. I am looking for you, my one and only!", "email": " wllmsstll@gmail.com", "tags": ["Female profiles", "facebook", "love scammer"], "gender": "female", "images": ["Tinabarnett1.jpg"]}