{"year_reported": "2017", "month_reported": "02", "username": " smileforme", "name": " Valentin Freeman", "age": " 40", "occupation": " contruction", "status": " divorced", "inet": " 76.211.72.99", "description": "\nI am a gentle, smart and neat man.I am an active and open-minded man! I enjoy listening to the music and reading. My biggest hobby is dancing, I think that every person should know the language of body. I like to visit cinema, theater, different shows. I love nature and in summer I enjoy going to the seaside to have a rest,I’ve learned that you cannot make someone love you. All you can do is be someone who can be loved. The rest is up to them. I’ve learned that no matter how much I care, some people just don’t care back. I’ve learned that it takes years to build up trust, and only seconds to destroy it. I’ve learned that it’s not what you have in your life but who you have in your life that counts. I’ve learned that you can get by on charm for about fifteen minutes. After that, you’d better know something. I’ve learned that you shouldn’t compare yourself to the best others can do but to the best you can do. I’ve learned that it’s not what happens to people that’s important. It’s what they do about it. I’ve learned that you can do something in an instant that will give you heartache for life. I’ve learned that no matter how thin you slice it, there are always two sides. I’ve learned that it’s taking me a long time to become the person I want to be. I’ve learned that it’s a lot easier to react than it is to think. I’ve learned that you should always leave loved ones with loving words. It may be the last time you see them. I’ve learned that you can keep going long after you think you can’t. I’ve learned that we are responsible for what we do, no matter how we feel. I’ve learned that either you control your attitude or it controls you. I’ve learned that heroes are the people who do what has to be done when it needs to be done, regardless of the consequences. I’ve learned that learning to forgive takes practice. I’ve learned that there are people who love you dearly, but just don’t know how to show it. I’ve learned that money is a lousy way of keeping score. I’ve learned that sometimes the people you expect to kick you when you’re down will be the ones to help you get back up. I’ve learned that sometimes when I’m angry I have the right to be angry, but that doesn’t give me the right to be cruel. I’ve learned that just because someone doesn’t love you the way you want them to doesn’t mean they don’t love you with all they have. I’ve learned that maturity has more to do with what types of experiences you’ve had and what you’ve learned from them and less to do with how many birthdays you’ve celebrated. I’ve learned that you should never tell a child their dreams are unlikely or outlandish. Few things are more humiliating, and what a tragedy it would be if they believed it. I’ve learned that your family won’t always be there for you. It may seem funny, but people you aren’t related to can take care of you and love you and teach you to trust people again. Families aren’t biological. I’ve learned that no matter how good a friend is, they’re going to hurt you every once in a while and you must forgive them for that. I’ve learned that it isn’t always enough to be forgiven by other", "email": " valentinafreeman30@yahoo.com", "tags": ["Male profiles", "romance scammer"], "gender": "male", "images": ["smileforme1.jpg"]}