{"year_reported": "2017", "month_reported": "12", "username": " Willis88555", "name": " Willis Ribblett", "age": " 49 or 53 or 61", "occupation": " military or engineer", "status": " widowed", "inet": " 80.112.45.6", "description": "\nI am Joseph, 61 years of and i am a Military personnel of the U.S Army.\nI have been told I have a big heart and I guess it’s because I love helping others whether it’s opening a door for an elder, holding heavy bags for a lady or volunteering/donating for an organization. I am very passionate about enjoying life and having fun. I know life can be “short” and you need to take life for what it is and do whatever makes you happy!\nI am not perfect and I don’t expect others to be perfect. Primarily what I am looking for is someone who is committed to a long term relationship with a view of marriage.\nI am not the kind who support divorce as a solution to all the complicated problems called life with a capital L. Communication with my partner is very crucial for me. Share,trust and openness will lead to a better relationship with me.\nI am kind of like a chameleon. I can blend into almost any surrounding. I tend to be more reserved. But that only happens when I am around people I don’t know. Once I get to know someone, I open up a lot more.\nYou like what you read because that is exactly what you going to get. Send me a message … LOL\nI am a fun loving man who enjoys movies, music, dining, and theater. I enjoy a good laugh and having a good time. I am very caring and I also have a good sense of humor.I am a big romantic and love, long walks holding hands, cuddling by the fireplace on a cold night or under the stars in warmer nights, leaving love notes,I’m playful, sincere and totally lovable, I like to cuddle in the morning and even more at night. I keep active mentally as well as physically\nI’m all that and yet truly humble and appreciative of the little things that makes life so very special.. I believe Life’s a game to be played with a little adventure and some spontaneity! I have always enjoy the company of someone who appreciates a sense of humor, can be playful and participate in great conversation…Friends describe me as affectionate, sweet, easy-going and thoughtful. I like watching most types of movies, picnics in parks, museums, exploring arts & craft fairs, indoor or outdoor concerts. I’ve sailed before and really like it. I like most music especially jazz & classic, country, gospel… i always believe that Love is a noble act of self-giving, offering trust, faith, and loyalty. The more you love, the more you lose a part of yourself, yet you don’t become less of who you are; you end up being complete with your loved ones. I don’t want distance to be a barrier between me and my ideal partner because I’m ready to relocate to anywhere convenient for me and my ideal partner if everything should end up well between us..I am willing to get to know more about you. I still believe in the fairy tale,that there is a princess charming out there and a happily ever after. Feel free to drop Email for me\nI am a dedicated man that loves to spend time with family and friends. In my free time I enjoy cooking, i make wonderful ‘impossible coconut pie”. I love to travel to new and exciting places. I am fluent in English, and i also like to swim.\nI am someone who respects the value of life and wishes to enjoy each day as it comes. Wants balance in his life and a partner to share the future. Enjoys most things and prepared to always try something new. Looking for laughter and to share fun occasions with that special someone. I am just a guy wanting to fall in love with a lady, enjoy life together, work through the hard times and enjoy the good times. I am a romantic and caring guy foremost and will become your best friend for the rest of our lives. I am a down to earth person who actively participates in generally any activity such as gym, sport, walking along the beach (love it) and fun activities. Healthy and sociable yet private. Loves enjoying finer offerings of life. Due to loss of life partner is establishing a new start in all facets of life (widower) Financially independent yet unselfish and not a complex person, rather an ‘easy read’ and open communicator. One son who I am proud to say raised with great values. Leaving me now with the opportunity to move forward. Love dining out and experiencing special events, activities and with someone to share these with me. Two words have been referred by others about my character, ‘gentleman’ and ‘caring’.\nI don’t really like to talk about this because it sounds like i’m blowing my own trumpet but anyway once i’m asked i will say my colleague used to tell me I’m a good thinker, great decision maker, good cook and i also make any one around me feel like kings and queens.\nI’m Curious, loving, caring , honest, patience , God fearing and above all trustworthy.", "email": " wribblett351@yahoo.com", "tags": ["Male profiles", "Joseph Dunford", "love scammer", "pof"], "gender": "male", "images": ["Willis885551.jpg", "Willis885552.jpg"]}