{"year_reported": "2016", "month_reported": "04", "username": " williamh2", "name": " William Hall", "age": " 48", "occupation": " doctor", "status": " widowed", "inet": " 85.96.43.69", "description": "\nI am a fun loving person. I am a very caring and sensitive person, I am a level headed, down to earth person who is totally devoted to the one I love. I tend to be shy at first, but I will open up quickly with the right person.I am confident, calm, and happy. An introvert by nature, I am quiet, structured, and organized. i think i’m a pretty easy going person. I love to be shown affection and don’t have any problem whatsoever showing the right person lots of of it, i always say if its better to give than to receive. I think that i have a pretty “strange” sense of humor at times. i look at it this way i’d rather make a joke than to sit around and dwell on things i can’t do much of anything about.I literally despise people who put on or lie about things and think they can get away with it where i’m concerned.I consider myself a sensitive, kind, and gentle person who enjoys being with people. I like going to the movies, listening to music, taking long walks on the beach.Favorite activities are going to the movies,taking walks the beach, being healthy. Most of all I love to be romantic for that special someone.I am looking for my one and only. I believe for every person there is a soul mate. I am looking for mine. she needs to be fun loving yet responsible, loves the outdoors and sitting at home cuddling while watching a movie.The woman i’m looking for would have to be romantic, caring, sincere, spontaneous, affectionate, loves to cuddle and give great lip action. someone who is not afraid to speak her mind, not in to head games, like to just take it easy on those lazy days but when work needs to be done she’s not afraid to get her hands dirty. i love a woman that smells good (cologne wise,lol) she must also have a killer smile and to-die-for eyes. i’m looking for a woman that knows what she wants and isn’t afraid to ask for it but doesn’t come on too strong! she should also know how to treat a man like he is supposed to be treated.", "email": " dntnphuhunng01@gmail.com", "tags": ["Male profiles", "facebook", "love scammer"], "gender": "male", "images": ["williamh21.jpg"]}