{"year_reported": "2013", "month_reported": "06", "username": " sincerel yes", "name": " Thomas Moore", "age": " 51", "occupation": " –", "status": " widowed", "phone": " 828-333-7671 or 781-667-3571", "inet": " –", "description": "\nHi, and nice of you to stop by!!I should start by saying that I am a very unique individual. Chances are, and I have been told, that you’ll probably never meet any one like me….That said, I am a vivacious, outgoing and friendly person. I enjoy being around people,talking and listening to what they have to say. Everyone has a story to tell….I am very independent, have been called FEISTY among other choice words….Not afraid to speak my mind or stand up for what I believe in…. I enjoy spirited discussions about most topics that people are afraid to talk about, religion, politics,sex, men, women….. I can be stubborn in my views, but if you give me a rational, intelligent explanation, I am willing to yield, or at least agree to disagree…No time for stupidity or BS. No head games, no heart games, what you see is what you get….I am a very sensual/sexual man who enjoys being boyish with a tough side at the same time….. I am very comfortable in my own skin I’m equally as comfortable in jean and sneakers as I am in blazers.Enjoy being outdoors, riding motorcycles (love Harleys!) as a passenger,walking, hiking,camping…love adventures!I am a single father of one gorgeous, intelligent and wonderful boyI am looking for a woman who can be a best friend, lover, companion in all my crazy adventures,,, A strong woman with a gentle touch. A woman who does not take herself too seriously and can see the funny side of life! Not looking for Princess Charming i am looking for that woman who want to put an end to loneliness who is ready for a forever am looking for that woman who want to be fulfilled maritally.Still with me? If you liked what you read, send me a line!I am outgoing, funny, and caring", "email": " mooretom1961@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["sincerel yes1.jpg"]}