{"year_reported": "2017", "month_reported": "05", "username": " Micky876", "name": " Micky Cole", "age": " 65 or 61", "occupation": " engineer", "status": " widowed", "inet": " 185.189.113.9", "description": "\nI’m very smart and good looking, very attractive and sexy, romantic and caring Faithful, Respectful, Trustful,Loving, i am an easy going person who respect women alot.. I am confident, purposeful,honest, loyal, elegant, sociable, sensitive, gentle, cheerful, optimistic, romantic, responsible,vivacious, warm-hearted, open- and single-minded.\nSomeone who will love me for who I am and care for me and I promise to get the same back showing true love and care. I will really make that special one have the taste of my true love, I’m serious looking for my soul mate.i am looking for a responsible with The warm family attitudes, sincerity, and mutual respect, internal beauty of the person is very important for me Means someone who have a clean heart to people. I am looking for a woman who has a great sense of humor and a sense of adventure too. Being attracted to someone is important but I think confidence is the key. I want to meet someone to go out and have fun with but that also is not afraid to attend a family function once in a while. I am looking for someone who has an open mind and likes to try new things. To sum it up, I would like to meet some new people and maybe form some new friendships that may (or may not) lead to more.I am an honest and kind minded man. I love being around with my woman because he is my closest companion. I love taking my woman to the beach where we could hold hands and share intimate moments together. I also love picnicing. Special spots where i can be with my woman alone where we will seem to be the only humans on the earth. I love seafoods, my hobbies include music, Picnicing, Petting my man,swimming.I have a free mind and sometimes i get hurt because some people take advantage of my free nature. I seek a serious long lasting relationship.", "email": " jcole6240@gmail.com", "tags": ["Male profiles", "hangouts", "romance scammer"], "gender": "male", "images": ["Micky8761.jpg", "Micky8762.jpg"]}