{"year_reported": "2017", "month_reported": "04", "username": " Jwilliam58", "name": " William Thomas", "age": " 57", "occupation": " Civil Engineering", "status": " widowed", "inet": " 158.69.73.162", "description": "\nI like to share,communicate and develop strong bases for pleasant actual life and future. All of my life I am trying to knock into the people’s souls not through words and &quot;bla-blas&quot;. I can consider Love as a superior way of friendship and I learnt long ago that the taste depends not so on the ingredients and the emotions you put inside.I have family values.A very warm and friendly person who is always optimistic about life. I’m very considerate with very good manners !Who can be both serious and humorous and like to see the funny side of things.I am quite intellectual and am definitely original and funny.My perception of an ideal relationship: Thanks for your interest in my profile !I have a dream of finding my one special love and thought I would try this way to search for it.I have lost faith in women from my own country who have lost the good values found in a strong relationship.I have so much of my heart to give and am very ready for it ! 🙂 I take care of my health, am not a heavy drinker and I don’t smoke. I’m very sensual and expressing this mentally and physically in a relationship is very important to me.Unlike many men I am not afraid to comment on the beauty of things or be overwhelmed with emotion and love.To me that’s what makes us human and I love it !\nLooking for trustworthy, modest, passionate &amp; compassionate woman, Someone that really wants honesty &amp; not just the perception of honesty. A woman that is sincerely interested great communications lays the foundation for any great relationship Not looking for a beautiful woman nor someone too young. If one or both are compatible good. she should be intelligent with sense of humor &amp; self.,Someone who needs to confide in me about her day or needs my support about anything. Who loves to cuddle &amp; have breakfast made for her on Saturday or Sunday morning. she takes care of herself. A woman who enjoys nature.", "email": " sandramark067@gmail.com", "tags": ["Male profiles", "facebook", "love scammer"], "gender": "male", "images": ["Jwilliam581.jpg", "Jwilliam582.jpg", "Jwilliam583.jpg"]}