{"year_reported": "2015", "month_reported": "08", "username": " johnmorris9811", "name": " John Morris", "age": " 44 or 45 or 46", "occupation": " engineer", "status": " widowed", "inet": " 178.209.52.103", "description": "\nMy name is john morris and I am 46 years,i was born in United State of America (Florida) i grew up in a small town call ….i lost my dad when i was 27,and now am left alone with my mom … life is so good when your family is complete, am the only surviving son of my parent,i school and graduated from Florida State university United State,on an Engineering course having my b.s.c holder and got my master degree also…when i lost my dad i move to tennessee because my company transfer me to our company branch here,am single now,I work offshore as a Marine Engineer.i work in an Oil rig 400 nautical miles into the Atlantic ocean off the coast of United State. I am working with Shell petroleum an oil exploration company here in United State…. but am Home for my leave now and i will be going back to work soon my dear. I have been in this job for about 20 years now and am quitting this time cos I want to settle down again that is why am here searching,i have being widowed for 5years now…I enjoyed being a married man but didn’t have much time to enjoy my marriage before my wife had a car accident some years ago…when she went to visit her parents in New york City. i want to move ahead and leave my past behind and be happy for good..hope you understand that please? due to the fact that I am playing the role of a father and a mother at the same time to my Daughter, I am a man who is nice,caring,honest,God fearing, Sincere, good sense of humor and Understanding.Cos understanding and communication is the most important thing in a relationship to make it strong and last forever..Cos when two couples understand themselves i don’t see anything that will happen to that relationship..it will be a happy one…i am looking for someone who is nice. caring. loving,honest and understanding..someone who have inner beauty cos inner beauty tells the true and real character of a lady cos is from the inner side of her you can tell if she is good or bad….it is not all about the physical appearance but the inner feelings which is the true feelings, I had only one daughter her name sharon, she is 15. Am very free and understanding person that takes life easy with people and see what life put in front of other people beside.\n ", "email": " johnmorris9811@yahoo.com", "tags": ["Male profiles", "fishmeetfish", "love scammer", "tagged"], "gender": "male", "images": ["johnmorris98111.jpg", "johnmorris98112.jpg", "johnmorris98113.jpg"]}