{"year_reported": "2014", "month_reported": "12", "username": " doveoflove", "name": " Phil Huges", "age": " 62", "occupation": " Engineer", "status": " widower", "inet": " 104.156.240.133", "description": "\nMy match is someone who is looking for an exclusive, passionate long-term relationship, has similar interests, and enjoys the outdoors as much as I do. I love to travel and would love to meet someone who loves to travel as much as I do whether it’s a cruise, short weekend trip or a weeklong trip to a romantic place I’ve never been to before. I’m looking for someone to share my life with. Someone who is as serious as I am about finding the person who may not be perfect but is perfect for me. I’m at a point in my life where I have everything I need except for that one special person who is looking for the same things I’m looking for. I enjoy most sports, so long as I can still handle that. I’m not looking for someone to fall in love with but someone to fall madly and passionately in love with (and vice versa), someone who makes me laugh, share secrets with, call during the busy work-day just to say hi, I’m thinking about you, someone who is romantic and affectionate, someone to spend quality time with, and someone who is not afraid to express her feelings or show her emotions. There has to be chemistry, mutual attraction and compatibility between us. I’m not a mind reader, say what’s on your mind instead of holding it in. And if there is a problem, let’s meet in the middle and work on it together knowing the importance of open communication and the commitment we have to each other, the realization that our relationship is worth fighting for and doing whatever it takes to keep it going. Miss waking up to someone next to me every morning, someone to read the paper with, someone to get tangled up in the sheets with, and someone to cuddle with next to a warm, cozy fire on a cold, rainy night. I also miss the intimacy and commitment of a monogamous relationship and am ready to try again. I feel that I have a lot to offer. I can be silly and goofy at times but am also honest, sincere, and trustworthy. I want someone who have a good sense of humor, is also silly and goofy at times and knows how to make me laugh. I want to hear about your day and whatever interests you.", "email": " philhuges@mail.com", "tags": ["Male profiles", "badoo", "datehookup", "match"], "gender": "male", "images": ["doveoflove1.jpg", "doveoflove2.jpg", "doveoflove3.jpg", "doveoflove4.jpg", "doveoflove5.jpg"]}