{"year_reported": "2012", "month_reported": "07", "username": " Newton32", "name": " Mark Newton", "age": " 47", "occupation": " –", "status": " Divorced", "inet": " 41.79.217.112", "description": "\nI was raised an Army Brat and have been to many locations over the years. The majority of my dad´s tours were in Germany. I have been there for a total of 27 years and relocated back here in the the U. S. back in 1998. I do love my home country, but do miss all the joys of living overseas. I have been to N. M. and Virginia and this past year moved to Texes. I do like it here but at times the heat is unbearable. I love to ski! I have been doing so since I was a teenager. I haven´t gone much here. I have skiied the Sandias in N. M. and Wintergreen and a few places up north. I would like to get back into what I love the most and enjoy the air and the surroundings. I have a passion for Heavy Metal when I was younger and now my preference is a lot mellower. I have been to a great many concerts in Germany but have only been to one here and that was Journey and Def Leppard. I would love to go to more concerts and see more bands play live. I really enjoy all music! I have a weird sense of humor. I love to laugh and make others laugh. I am a little shy at first, but I soon awaken and let my true self be known. I can converse on many subjects and feel that I am well educated. I love to talk, but also love to listen. I am not a sports fanatic, but do love my UFC. I have been a fan for a few years now and would one day like to see the sport live. I also like my Minnesota Viking and had a chance to see them play. It was in Berlin Germany when they defeated the Broncos. Enough of me! My ideal match…Hmm thats hard to describe. I would have to say that my ideal match must love to socialize. I cannot stand to be in a relationship without mental stimulation. She must be educated and/or have a talent of the lingo. It would be nice to have a friend that enjoys the outdoors. Try new things! Get dirty and have some fun. A Tomboy with a feminine touch. I would really be disappointed in a relationship just staying at home. Travel is a must! I would love to see the whole World! It would be nice to have a partner that enjoys traveling as much as I do. My next destination will probably be New Zealand. Aruba would be nice to see. South America…could go on forever. Unfortunately I am a smoker and have been trying to quit for sometime. I guess what I am saying is that I would like a mate that can tolerate this bad habit until I Quit. I do have it in my mind to quit but have not been successful as of yet. I would not like to date another smoker unless she is adament on kicking the habit too. I love animals of all kinds…even humans. I would like to have a mate with a heart of gold and enjoy being around animals. I have two cats and two turtles. If it was up to me I would have a lot more, but not really feesible. I am in search of a soul mate if that is possible. I am really looking for my long lost best friend!!!.", "email": " newtonmark32@yahoo.com", "tags": ["Male profiles", "facebook", "mydailyflog", "romance scammer"], "gender": "male", "images": ["Newton321.jpg"]}