{"year_reported": "2012", "month_reported": "08", "username": " mikejonesfc", "name": " Mike Jones", "age": " 49", "occupation": " –", "status": " divorced", "inet": " 64.79.77.190", "description": "\nI am a fun-loving, caring, warm-hearted, looking for an honest, upfront, no- drama kind of woman. I really would love to find someone who can’t wait to get home so we can cook dinner, go for a walk and then curl up in our sweats and watch a movie but who would also be just as excited to get dressed up and go out for a night on the town.\nI’m a devoted single dad. I am loyal, posses good care-taking abilities and solid family values. I am looking for an adult relationship that will be my equals, but I will love to also treat you like a woman. I am sure some women still find it nice when a man picks up the tab or makes sure his date gets home safely. It may be old-fashioned, but dating a gentleman I hope still matters.\nI am an attractive, intelligent gentleman of substance seeking a woman who is honest, …y and interesting to share stories and time with. Love being active, I’m giving by nature and driven by the heart. Looking for a genuine individual who believes a relationship is a two way street. You must be single, educated enough, physically fit and emotionally available. If you are separated or recently out of along term relationship, please be over that person.\nI come across as conservative, but have a very warm, funny, witty side to me I can offer loyalty, friendship, support, humor, insight & more. I am open to trying new things, love animals, the indoors and outdoors. Most important to me is the conversation I have with my companion. The day to day energy and excitement with the right partner is what keeps it all interesting. I am currently in dating mode but would ultimately like to enter a committed relationship with the right person. While my life is full of friends, interests and work, I miss having the companionship and intimacy that a romantic relationship can bring I would love to hear from you ladies that feel we might be a fit.\nI love to stay active and welcome new adventures… time in the gym is very important… as is maintaining a healthy lifestyle. A sense of humor is critical, I love to laugh. I am very easy going and don’t take myself too seriously… don’t sweat the small stuff…would love to be able to say I am a perfect person, but I do have some minor faults. But I can tell you that I am caring, sweet, considerate and thoughtful. I’m lucky to be surrounded by wonderful family and friends. I am the Dad of three awesome kids that I am very proud of and take a very active role in making sure they meet their highest aspirations. I’m happy with my life and set in my career, but missing that special person to share it with.\nI’m financially secure and consider myself semi-retired. However, I still feel like I work just as hard as when I started. I currently own a medical spa so some benefits come along with me.", "email": " mikejonesfc@yahoo.com", "tags": ["Male profiles", "facebook", "person"], "gender": "male", "images": ["mikejonesfc1.jpg", "mikejonesfc2.jpg", "mikejonesfc3.jpg", "mikejonesfc4.jpg", "mikejonesfc5.jpg"]}