{"year_reported": "2018", "month_reported": "07", "username": " soulfood101", "name": " Wayne", "age": " 48 or 53", "occupation": " Geologist Engineering or costruction", "status": " widowed", "phone": " 270-697-6584", "inet": " 216.145.80.169", "description": "\nDue to lack of honesty and sincerity. This profile will self destruct in …. 3….2….1….minutes, days, weeks, years….\n** What I am NOT looking for is a “hook-up”, a one night stand, or “cyber sex”. So if that’s what you want, I’m not judging you … but I am the wrong man for you. **\nI have a brain and know how to hold an intelligent conversation. I have a witty sense of humor. I love to laugh and make others laugh. Other people enjoy my company. Love the outdoors, anything on the water, the beach, like the woods, camping. Love Kayaking, a fire at night inside or outside, star gazing, a nice glass of wine or a good cold beer. I like to get up early and have my coffee on the porch in the morning. Enjoy a good movie either out or at home. I love to dance when going out or just in the kitchen when a good tune is on. I am most comfortable in a good pair of jeans and a t-shirt. I am a very social person. That doesn’t mean I have to be around others, I just enjoy people in general. But I also enjoy my quite time alone or at home cuddling with someone I care about.\nMoney and “things” mean very little to me. “Things” have a way of coming between people. The more things you have to take care of the less time you have for the people you care for. I don’t need and am not looking for someone to take care of me. I’m capable of doing that myself. I want to have someone in my life.\nLooking for honesty first and foremost. Someone to be my friend first. A gentlewoman that likes to treat a man like a man, but also knows when not to. A good sense of humor, quick witted. Someone that enjoys being around others sometime, but also likes to spend quite time with me talking or watching a movie. Someone that doesn’t need me or anyone else to complete them or make them happy. You have to be happy with yourself before you can ever be happy in another persons company.", "email": " magicpanther007@gmail.com", "tags": ["Male profiles", "pof"], "gender": "male", "images": ["soulfood1011.jpg", "soulfood1012.jpg", "soulfood1013.jpg", "soulfood1014.jpg"]}