{"year_reported": "2017", "month_reported": "09", "username": " andy5244", "name": " Andy Williams", "age": " 53", "occupation": " Businessman", "status": " divorced", "inet": " 46.101.204.170", "description": "\nsince the divorce of my wife,its been lonely,but i have to move\non,deserve to be happy again,so that’s why i want to give another try at another serious relationship with that special person.\nAm romantic,humorous,friendly,funny and interesting kind of person.i like the outdoors\n(exploring nature as i would say.)when am not working.I like going outside,sometimes to\nthe beach with those i really care about,and have fun.I enjoy meeting people and enjoy\na variety of recreational activities. My favorite outdoor activities are exploring,\nhiking, camping, canoeing, bicycling, motorcycle riding, fishing and sightseeing. I also\nenjoy long walks and special picnics with my 14 yr’s old son andy jr\nFor interests I am into going out for Dinners, beach, movies, hanging with friends,\nsurf kayaking, gym, karate, wake boarding (well I try, very unsuccessfully lol) and\njust chilling out at home with a video and a snuggle with someone nice can be a lot of\nfun too. I consider my self really easy going, and don’t stress out too much (though\noccasionally I might), I take life as it comes and if things go bad I look at the\npositive side of it and just accept it, hoping all will turn out 🙂 I also like trying\nnew things and will try most things once. I like to have a laugh and I also can be\nserious also if it permits, I am known to be very caring and honest, I like doing\nthings for people I like or love, and when with a partner I like to let her know she is\nloved and I am not afraid to show it, (though I don’t smother to the point its\nannoying), I just have respect for my partners and I like to show it, whether its with\nflowers, dinners or just treating them with the respect the deserve, damn I hope I\ndon’t sound to corny lol, anyhow enough about me, just ask if you want to know more.", "email": " andywilliams52442@gmail.com", "tags": ["Male profiles", "hangouts", "plentyfishdating", "romance scammer"], "gender": "male", "images": ["andy52441.jpg", "andy52442.jpg"]}