{"year_reported": "2016", "month_reported": "10", "username": " fennersluis", "name": " John Wood", "age": " 46", "occupation": " barrister", "status": " single", "inet": " 41.190.14.114 or 41.190.12.106", "description": "\nBARRISTER FENNERS LUIS, I WILL LIKE TO HAVE A GOOD RELATIONSHIP WITH YOU\nmessage:\nCompliments\nDear Sir/ Madam\nSecond Quarter of the year 2016 Scam Awareness Conference Update in favor of all Entrepreneur,Stake Holders and other Fraud Victims in the globe.Contact our Liaison Office for the payment of Six Hundred and Thirty Three Thousand Dollars (US$633,000.00) only as a Compensation approved for all Scammed Victims affected by Africans as your Personal Internet Contact Information is among the Data Selected that has been exposed to Imposters by receiving Fake Proposal Letters and also might have dealt with Fake Compensation Offices,Fake friends and Partners,thereby losing your hard earned money and your vital information to them. The Victims lists were enlisted by the African Financial Intelligent Unit (AFIU) in affiliation with the Office of Foreign Assets Control (“OFAC”) in United Kingdom after the Conference Forum Screening carried out by British High Commission with all African Governments for this 2016 World Awareness and Reconciliation Scheme in order to create Awareness and also to restore the global economy to the enviable standard of respectability.\nRe-Confirm Your PHONE NUMBER and CONTACT ADDRESS to our Representative for verification, Dr John Wood via drjohn_wood1@hotmail.com for your payment through ATM DEBIT CARD immediately.\nYou should stop further communicating with Friends and business Partners you are not sure of and also with any Compensation Office because we have never held any compensation programs in the past,so do not be deceived and stop every email communications immediately to protect you from losing further your Vital Information and funds as we await to receive the above required Information STRICTLY via (drjohn_wood1@hotmail.com) to enable our Liaison Office to process your payment and send your Atm Card without further delay as we mandated you to send your update to Dr John Wood, with the provided e-mail address {drjohn_wood1@hotmail.com\nThank you,\nMR FENNERS LUIS\nP.R.O, Director of Payment.\nBritish High Commission\n9,NORTHUMBERLAND AVENUE,\nLONDON WC2N 5BX,\nUNITED KINGDOM\nalternative", "email": " drjohn_wood1@hotmail.com", "tags": ["Male profiles", "419 scammer", "mingle2"], "gender": "male", "images": ["fennersluis1.jpg", "fennersluis2.jpg"]}