{"year_reported": "2016", "month_reported": "07", "username": " ericwhite", "name": " Eric White", "age": " 57", "occupation": " construction", "status": " widowed", "inet": " 207.244.78.47", "description": "\nAm working as Real Estate manager and a constuction c.e.o……… ,am a single man with one lovely kid who is 15yrs.I do really like going out with friends reading novels,swimming and as well.Am a very honest,kindness,truthful, decent,God fearing and caring man..I am Single for four years ago, black hair, Gray eyes, a healthy man. I am self-sufficient, handsome, happy, secure, self-confident, psychologically aware, emotionally ,financially secure,caring ,lovely,humble and honest man.Am very independent passionate and easy going..My personality traits are: For Those Women Who Truly Value Such Things In Life .Am Loving, Caring, Clever, Sincere, Smart, Good Heart, Kind Soul. I like these kinds of music: Hip-Hop, Rap, Rock, Jazz,Classic $ gospel.I like to go out to and Have Fun and Enjoy Life optimistically fixed on future goals.I often have a bright, cheerful demeanor that can be disarming to many.I can be a beacon of light in the most confusing of times. I can step into a mess and sum up the situation with blinding clarity. I speak raw truth when all others try to hide in the confusion. I can be an invaluable friend that can guide you to a clear path when you need honesty.Am not ashamed to admit that among my demerits you would find that I easily speak my mind and say what I actually think as opposed to what people want to hear. I consider myself to be a unique man. I follow no path cut by others and prefer to make my own trail at all cost. I do drink Occasionally but not to excess. I do like to party but only with family and close friends", "email": " ericwhite257@gmail.com", "tags": ["Male profiles", "romance scammer"], "gender": "male", "images": ["ericwhite1.jpg", "ericwhite2.jpg", "ericwhite3.jpg", "ericwhite4.jpg", "ericwhite5.jpg", "ericwhite6.jpg", "ericwhite7.jpg", "ericwhite8.jpg", "ericwhite9.jpg", "ericwhite10.jpg", "ericwhite11.jpg", "ericwhite12.jpg", "ericwhite13.jpg"]}