{"year_reported": "2013", "month_reported": "04", "username": " Honestlover0147", "name": " Leonard X", "age": " 51", "occupation": " Building Construction", "status": " widowed", "inet": " –", "description": "\nI am sweet, thoughtful, kind, and have a great sense of humor. I am very easy going and laid back. I am often told that I am very easy to talk with. I am not an angry person, and I am not interested in someone that is. Having past events shape your life is one thing, carrying the past as a burden that sits heavily upon your shoulders is not the way I view life. I am happy with myself, and my life, and I like to think it shows. I have a Beautiful Daughter. I would do best with someone that isn’t extremely uptight, unless of course you are willing to learn to let things go! I love to try new things, and can laugh at myself when I fail miserably. I don’t give up easily, and have so many things I’ve yet to try. Please love to laugh and have fun, what is better than laughing so hard your stomach hurts?!!!I love traveling, going on unknown adventures, and trying something I thought I never would. I’ll try anything once, well, but fun none the less! I take pride in my appearance, but am not high maintenance. I love a nice dinner out, but staying home, having chines food after a day spent working together on a completely dirty, yet fulfilling project, can be so much fun with the right person…Being honest and open is very important to me and I expect my match to feel the same way. I am not a game player, and I don’t have any interest in dating one. I do however, make exceptions for board game lovers….I am very creative and artistic. I love working on my house and digging in my gardens, I have no problem getting dirt under my nails. I believe in a best friend to spend my life with, and if it takes awhile and I meet new friends along the way, that’s a good thing too. Please have an adventurous silly side, although I can be very sophisticated when necessary, life isn’t as much fun if you subdue your inner child all the time\nI’m a straight and easy going person with a kind and gentle heart full of love..I love to travel and would love a partner to travel with me. I have been a workaholic in that past but last year I had a change of attitude and decided to live life now. I might live to be a 100 years old or my time could end tomorrow. Rather than wait and miss life I want to take advantage while I have the opportunity in front of me.\nMy friends/coworkers will tell you that I am a shy person. I can be picky but I really believe that love is out of our control. I cannot create a spark or stop a spark. There is either a connection or not. I have met people online or via telephone conversations and they seem great but when we meet there is no chemistry or connection. It is not all about looks especially as we get older but none-the-less there has to be a physical attraction. A personality can make someone cuter or uglier as you get to know them..Profiles help but lack personal interaction and feedback.that can only come through emails if people are honest and the the true test comes at eventual Trusting each other Long profiles are boring and we are too busy to read long drawn out introductions so I will shut up. If you want me to keep talking then send me an email and I will respond even if it is a Thanks, but no thanks.", "email": " Stillheartedman@yahoo.com", "tags": ["Male profiles", "fishmeetfish", "romance scammer"], "gender": "male", "images": ["Honestlover01471.jpg", "Honestlover01472.jpg"]}