{"year_reported": "2014", "month_reported": "12", "username": " letitrainonme", "name": " John Alvin", "age": " 53", "occupation": " Engineering", "status": " widowed", "inet": " 206.190.138.26", "description": "\nI love God. Am old fashioned, dependable, straight forward, faithful, honest, trustworthy, loyal, understanding, spontaneous person that likes to get out and enjoy the numerous things that life has to offer or the simpler things like bbq, cooking, watching a good movie, beach walking, horse ride, camping, fishing, traveling hiking, working out, reading a good book, adventuresome, passionate, and positive towards life. I love music, country, live concert, blues, classical, christian, worship and praise. Am a one-woman man that you can count on and you never have to worry about my commitment. I love adventure, I have a great sense of humor and great fun to be around with and am open to possibilities. I love good company. I love making people laugh. Am full of life and fun, open and love to try new things as well as an adventure. Believe in quality. I enjoy being around people who find humor in the absurdities of everyday life. I care about people and family is important to me. I am man who looks for inner beauty and for quality in just the small things as well. I love challenges. Above all, I want to live life to its fullest with that special one. I am looking for a relationship that starts with a foundation of friendship were there’s a natural ease and comfort with being together that has a potential to grow into a long term relationship and eventually lead to marriage. Am looking for a woman who is loving, passionate and not afraid of showing affection- holding hands in church and in public- needs a sense of humor as I love to laugh. Enjoys sharing things like a trip to the grocery store as much as a real ‘date night’ Someone who enjoys cooking and bumping into each other in the kitchen or catching that ‘knowing’ glance across a room. Someone to grow old with.", "email": " johnpeteralvin@yahoo.com", "tags": ["Male profiles", "connectingsingles", "romance scammer"], "gender": "male", "images": ["letitrainonme1.jpg", "letitrainonme2.jpg", "letitrainonme3.jpg"]}