{"year_reported": "2016", "month_reported": "09", "username": " claire101", "name": " Clarie Maccinis", "age": " 27 or 30", "occupation": " assistant manager", "status": " single", "inet": " 69.31.51.222", "description": "\nI am a positive and determined hopeless romantic, yes, I still believe in true love for man and woman under god’s grace! what makes me unique is I truly put god first in every aspect of my life, it took me to this age to figure out with god all things are possible and with out god no good thing is possible in life! life is precious and life is short, none of us are promised to next breath we take!! I am the type of person, I will not lie about any thing, because the truth will set you free! no relationship can stand without trust, respect, communication, care and faithfulness, not only to each other as man and woman, but to our lord, I not only want a man, I want a family, a godly family, a family that prays together, stays together\nopen-minded and understanding, honest and straightforward, I speak my mind and can be outgoing at times, although I am introverted. I’m usually easy-going. . though I do seem to get overexcited about things I’m interested in or am passionate about.\nI enjoy having in-depth conversations and contemplating about anything and everything, from the meaning of life, stories, songs, shows and art to the origin of life, existence, alternate realities, the universe/multiverse, and the singularity that made everything possible. Also things like religion or lack thereof, spirituality, politics, history, evolution, the past, present, and future. In my eyes there isn’t much off limits and everyone is entitled to their own opinion. . . even if you believe in something like scientology, although in my opinion, there are much better sci-fi writers to base a religion on.\nAt the same time, just being together in comfortable silence, near someone I care about, can be equally enjoyable!", "email": " clairemaccinis101@yahoo.com", "tags": ["Female profiles", "connectingsingles", "romance scammer", "sentimente"], "gender": "female", "images": ["claire1011.jpg", "claire1012.jpg"]}