{"year_reported": "2013", "month_reported": "05", "username": " foereverlivinglove", "name": " Richard Anderson", "age": " 56", "occupation": " architect", "status": " divorced", "inet": " 172.191.33.6", "description": "\nI’m young at heart,a great guy,handsome with a great sense of humor, 6.1ft tall.I’m intelligent,easygoing.open minded, monogamous,spontaneous, a good listener, a loyal friend and lover and I’m really looking forward to spending lots of quality time with the woman of my dreams,pretty laid back.i am adventurous and humble.. I take care of myself physically, spiritually, and mentally.i also enjoy dancing Salsa alot.I think love is about feeling very close to someone and sharing my life with a partner that I cherish and adore. I think it’s about being there late at night if just to be woken for a hug or a kiss or a talk and, of course, more. I think love is about watching over and protecting each other, and doing it not only because we should but because we truly care. And I think it’s about hugging and kissing and doing whatever we can to make each other happy because those are the reasons we’re there. I desire a woman who I feel is that special someone who I can’t wait to come home to at the end of a day and her to me. One who I can share with and for her to feel those same feelings towards me. Communicating is how to make a relationship work.Trust is also very important we should be able to trust one another I’m seeking a woman of integrity, passion and warmth… a sensitive soul. We shouldn’t like exactly the same things.Distance isnt really a problem for me am ready to go anywhere in search of my one and true love.I love kids but unfortunately i dont have one,i don’t want a female version of myself, but rather someone compatible with me.Someone who is ready to plunder the world’s treasures. I desire to find my best friend,partner,the right woman, a companion to share, dream and explore with.Am not looking for a perfect woman because no one is perfect am looking for a woman who i can blend my life with hers and we both happy till the ends.I like easy-going,honest,romantic,sincere and friendlyWoman.I dislike dishonesty,inconsiderate and disrespectful. I value and respect all women because they are special gifts given to us by God..i also love to pamper my woman and make her happy..If any of this sparks your interest and if you think this describes you feel free to respond to me.Thank you for Stopping and Good luck to you all.", "email": " richinty@yahoo.com", "tags": ["Male profiles", "confirio", "romance scammer"], "gender": "male", "images": ["foereverlivinglove1.jpg", "foereverlivinglove2.jpg", "foereverlivinglove3.jpg", "foereverlivinglove4.jpg", "foereverlivinglove5.jpg"]}