{"year_reported": "2015", "month_reported": "10", "username": " ebertluv123", "name": " Ebert", "age": " 55", "occupation": " military", "status": " widowed", "inet": " 107.167.81.225", "description": "\nI am a simple,faithful,and good looking, successful and confident man, loving active life style and that keeps me always in good mood and shape. I consider myself a kind, but serious person. I am very devoted to everything I do and faithful to everybody I love. I am not perfect of course. Sometimes I can be curious like a child! Surprising people is my second nature, so do not be amazed if in the morning you will be awakened by a pleasant smell of breakfast or coffee in your bed,I am fond of reading and consider books a source of wisdom! I love my job, spending time in the open air and nature, beach and mountains are my passion, but my interests also depends on mood and situation, together, I can easy dress nice and go to the restaurant, but also to make an exotic dinner at home if I am in “cooking” mood. I like different trips and seeing new places, Crimea is a beautiful area and still so many new to discover! I enjoy swimming, water makes me feel weightless and inspired. Maybe we can do all these thingsI have a motto: Don’t fall in love with someone you can live with, fall in love with someone you can’t live without. So I am looking for a woman I will not be able to live without! As life has ups and downs, I think that woman should be the leader in the family and be reliable! I’m looking for someone that I share a great chemistry with, not only physically but intellectually as well. The ideal would be someone who is both my best friend and my soul mate. Someone I can laugh with and enjoy the life. Someone with compassion and optimism. A honest person with good character and integrity. An intelligent professional with motivation and goals…in think i will end here for now,thanks for going through my profile,i know it sounds interesting and nice to you….i want you to feel free and write me so that we can see where it will lead us too", "email": " stvmldnd@gmail.com", "tags": ["Male profiles", "military scammer"], "gender": "male", "images": ["ebertluv1231.jpg", "ebertluv1232.jpg", "ebertluv1233.jpg", "ebertluv1234.jpg", "ebertluv1235.jpg", "ebertluv1236.jpg"]}