{"year_reported": "2012", "month_reported": "06", "username": " lonelyrich4u", "name": " Richard Phillips", "age": " 46", "occupation": " I am into import and export of oil and gas,It makes me travel though", "status": " single", "inet": " 197.255.164.25", "description": "\nThere r basically two kinds of people those who give and those who take, but not in extremes. Everybody does both, but most waiver on one-side. Some take what they can to feed thier souls making thier lives a better place, others give to feed thier souls, leaving our planet a better place. Don’t get me wrong I too am looking for quality of life, but don’t need someone to create it for me. I want someone to share it with. I’m here for the same reasons you are.Im looking for someone to share and enjoy lifes journeys with. When I was younger I sometimes listened without comfirming. This meant a lot of things that wern’t true, but sounded like they could be were just considered true. Classic one that Im sure you’ve all heard is “Opposites attract”. Yes, they do because you admire qualities in people that you don’t posses urself. This makes them different and interesting. Well, down the road and a few failed attempts later I realized that the very things that attracted you to this person are the samthings that force you apart. With this said. I would like to find someone who sees the world with similar eyes that I do.\nIm looking for someone to share and enjoy lifes journeys with. When I was younger I sometimes listened without comfirming. This meant a lot of things that wern’t true, but sounded like they could be were just considered true. Classic one that Im sure you’ve all heard is “Opposites attract”. Yes, they do because you admire qualities in people that you don’t posses urself. This makes them different and interesting. Well, down the road and a few failed attempts later I realized that the very things that attracted you to this person are the samthings that force you apart. With this said. I would like to find someone who sees the world with similar eyes that I do.", "email": " lonely6598@yahoo.com", "tags": ["Male profiles", "matchdoctor", "romance scammer"], "gender": "male", "images": ["lonelyrich4u1.jpg", "lonelyrich4u2.jpg"]}