{"year_reported": "2012", "month_reported": "12", "username": " Harrysails", "name": " Harry Sails", "age": " 46", "occupation": " Real Estate", "status": " divorced", "inet": " 91.206.27.30", "description": "\nI love life and am a true optimist. I love a walk on the beach, a drive in the mountains, watching the sunset, a moonlight walk, as well as going to see a play or musical, enjoying and looking at the arts (in a wide variety of forms and wherever they may be found), going to concerts, traveling,cooking, curling up and reading a book, cuddling, giving massages and being close to that special one. I am very sure I have left out a lot of things but if you get to know me you would find them out. I am a Christian after having been down many spiritual paths trying to find inner peace from within. Sa’dhana’, Meditation, Tantra were all routes to what I thought were clarity,inner peace and energy but only to find that I was still lacking the most important ingredient of my quest(a Covenant relationship with God and not just a concept). I walked many years on the spiritual paths of the Native American (the Red Road) and was a “spirit runner” loving to participate in Spirit Runs running trails and at one in the beauty of creation and with the animals. I will always treasure the lessons I learned during those years, lessons which gave me a deep appreciation for nature, compassion of people and a respect and love for the many cultures of the world.\nIn a relationship, I believe in open and honest communication for without that you really don’t have a relationship. I am looking for somebody who is not only my lover, but my best fiend and companion. I like a blend of time at home relaxing and enjoying one another to going places (exploring the world so to speak) even if it is just to take a walk and enjoy what nature has to offer us. There is so much beauty around to enjoy and I find myself at peace and in harmony when I explore. I am looking forward to the day when I find “the one” and can begin my true journey with him. I know it will happen but until it does I know I will have a great time along the way and so will you; just maybe you will turn out to be that special one that m", "email": " harry_sails@yahoo.com", "tags": ["Male profiles", "facebook", "matchdoctor", "romance scammer"], "gender": "male", "images": ["Harrysails1.jpg"]}