{"year_reported": "2017", "month_reported": "04", "username": " Armypatricio", "name": " Patrick Casillas Gonzales", "age": " 50", "occupation": " I am master sergeant officer", "status": " widowed", "inet": " 162.217.27.167", "description": "\nWell, i am Patrick Casillas Gonzales by real name. I was born 14th of APril , 1966 (50years ). I am 5 feet 9 tall in height, have a black hair and black eyes. I`m a Latin American/Hispanic by ethnic. I was born in Yucatan Penninsula Quintana Roo, Bacalar, Mexico but raised/grew up in Monetery, California before i got deployed here in nigeria for keeping the mission safe . I`m the only child that my parents gave birth to. I have been brought-up in a very discipline atmosphere where values and principles have always been given priority\nIt gives me great pleasure to give introduction of my family. My respected father name was Mr. Gonzales James while My Mom name was Sherry Gonzales . My father was from Mexico, but resided at Moneterey, California all his life. My Mom was originally from San Diego but resided at Monterey after she married my Dad and It was there that she lived until she died. My Dad was an Engineer/Contractor while my Mom was a business woman. I loved both of them, but God knows more than us. Sincerely, Robin`s mom was a wonderful wife. She tried for me after the death of my parents. She supported me on all kind of things. Recollectively, I was deployed to Taiwan when she got sick.\nThe illness was very horrible. I was updated about her illness (CANCER), I took an EMERGENCY LEAVE after the updates. I visited her at the hospital. At first, she got relieved with the illness. We both shared smiles,laughed and she informed me to be comfortable that nothing was gonna happen to her. The illness started later and was very serious. I kept asking the Dr., if she was gonna survived but they were n`t sure. It was 4 days after I visited her that she died. Sincerely, that day was extremely a horrible day for me. I was extremely dejected and was like following her. Sincerely, I can`t start to write all about my Past now. I think it would be better to do that,some other time or when we meet. Remembering it would start to make me feel dejected here. I`ve already forgotten everything and I`ve accepted that the Incidents was from God. May their (her, my Mom and Dad) gentle soul rest in perfect peace, I prayed.\n. I would be honest and I would like you to know that since after the Incident has happened, God has always been there for me and my kid (Robin). He provides all my needs according to what I ask from Him. The past should be known as Past, It`s happiness that I want in my life now and I believe that all my unanswered prayers would surely be approved/answered by Him soon.", "email": " sgtpatrick0012@gmail.com", "tags": ["Male profiles", "military scammer"], "gender": "male", "images": ["Armypatricio1.jpg"]}