{"year_reported": "2013", "month_reported": "05", "username": " larry4luv90", "name": " Mark Williams", "age": " 45", "occupation": " Self-employment", "status": " divorced", "inet": " –", "description": "\nHi i am Mark single and looking ,had 1 son name Dave Lucky is the man who is the first love of a woman,\nbut luckier is the woman who is the last love of a man.\nLove is a language spoken by everyone, but understood only by a heart, Love is like a river, always changing, but always finding you again somewhere down the road it is the beginning of all the joy which nature has store for us..\nWhen men and women are able to respect and accept their differences then love has a chance to blossom…..you can’t stop loving or wanting to love because when its right, it’s the best thing in the world. When you’re in a relationship and it’s good, even if nothing else in your life is right, you feel like your whole world is complete.\nI am that guy who calls you beautiful instead of hot, who calls you back when you hang up on him, who will lie under the stars and listen to your heartbeat, or will stay awake just to watch you sleep… wait for the boy who kisses your forehead, who wants to show you off to the world when you are in sweats, who holds your hand in front of his friends, who thinks you’re just as pretty without makeup on. One who is constantly reminding you of how much he cares and how lucky his is to have you…. The one who turns to his friends and says, ‘that’s her.\nFriendship isn’t about whom you have known the longest… It’s about who came, and never left your side…The words that escape a friend’s mouth are “I’ll be there when you say you need me” but the words that are unheard from a true friend’s heart are “I’ll be there… whether you say you need me or not.\nam looking for a special lady that is loving, honest, and loves to have fun. She should be attractive from the inside out, and interested in a fulfilling relationship so we could explore life together.\nA woman’s laughter is like music! But only if she’s laughing with me… not at me cos Life is way too short to go through it alone. So here I am, looking for that special relationship. I would describe myself as fun-loving, athletic, intelligent, affectionate and loyal as a puppy dog. so expect many attempts to poke your funny bone.\nI enjoy helping others. I treat others the way I would like them to treat me. I love to laugh and be around others who make me laugh. I am looking for someone who also values these traits. I think I am very low maintenance and value that trait in others as well.\nI enjoy getting dressed up as much as wearing my oldest blue jeans and white t-shirt. It really does not matter to me what you wear as long as it goes well with your smile. I am down to earth and like relationships that are black and white and based on trust, team work, understanding, and honesty. Honesty is extremely important to me.\nlooking for someone we can spoil each other and live life to the fullest, drop me your contact lets see where it goes? A wink from means i am interested. barwilliams1155@yahoo.com send me a message and i will respond immediately,", "email": " barwilliams1155@yahoo.com", "tags": ["Male profiles", "confirio", "facebook", "love scammer"], "gender": "male", "images": ["larry4luv901.jpg", "larry4luv902.jpg", "larry4luv903.jpg"]}