{"year_reported": "2018", "month_reported": "01", "username": " billlovesfun", "name": " Bill Taylor", "age": " 65", "occupation": " Mosaic art", "status": " widowed", "inet": " 141.101.174.45", "description": "\nI am honest. I love to laugh and make others laugh. I’m an artist, and enjoy seeing and studying visual arts. I also love my friends and family, the outdoors, witnessing acts of kindness, the human spirit, fly fishing, and the underdog. I am troubled by injustice, the “isms,” the direction this country has recently taken, what we’re doing to this planet, and the TVs that seem to be everywhere these days.Art and fly fishing are the two hobbies that I’m most passionate about; my raisons d’être. I generally work in an oil and gas company but also into mosaic art,I prefer to work from life rather than photos who’s details can easily seduce me into tighter painting. I paint mostly people, portraits, and the figure.\nI began fishing when I was three years old, and fishing is a part of my DNA. Moving water grabs me at my core, and pulls me towards it. It’s primal. But my need to fish is usually satiated by quality rather than quantity. I practice catch-and-release.I think I’m reasonable intelligent. I have a Masters degree, and I’m the chief financial officer for a state education agency I don’t live for my work, but I do enjoy it most of the time.\nI like to travel and experience new places and new cultures, but prefer traveling with a partner or alone rather than a tour group. I’m a Yankanuck-a dual citizen of the US and Canada. For me, travel doesn’t have to be around the globe to be interesting and worthwhile. It’s much more about listening, seeing, and engaging a place and its people on their terms rather than on my own.France and the French people hold a special place in my heart. Their food, wine and bread are not to bad either. The first place I fished at age was on the Seine River in Vaux sur Seine, France. I’ve returned to France several times and each visit adds to the love I have for this treasure.\nMaking and eating good food is important to me, and another way to experience other cultures. Cooking for others is also one way I express love. I enjoy wine and wine tours, but my palate is not particularly sophisticated. I enjoy dancing but again, not particularly sophisticated, swing mainly.\nSo how obvious is it that this is my first profile? Yeah, that’s what I thought. Ok, I’m tired of starting sentences with “I” so I’ll leave it here for now.Well, I’ve done some editing this morning. I guess we’ll see if it’s an improvement or not.Let me tell you a little about what I’m looking for in a woman. Mind you, my range of acceptable traits is much broader if we are to be just friends. I’m looking for an equal partner, lover, friend, and companion. She should be honest, intelligent, considerate of others, willing to be vulnerable, independent, and a woman of substance. I don’t need a mother, housekeeper, cook, or laundress. I can do all those things and and capable of sharing the load. I not really interested in overly judgmental, dependent, or opaque individuals.", "email": " billtaylor280@gmail.com", "tags": ["Male profiles", "hangouts", "letsdate", "love scammer"], "gender": "male", "images": ["billlovesfun1.jpg", "billlovesfun2.jpg", "billlovesfun3.jpg"]}