{"year_reported": "2017", "month_reported": "10", "username": " connie121k", "name": " Connie Bowen", "age": " 42", "occupation": " business woman", "status": " single", "inet": " 35.193.186.201", "description": "\nI am attractive, charming, kind and honest with a great sense of humor.I’m also a very good housewife. I am full of life person and I have many friends. I also very gentle and sensitive. My life is happy, but the missing ingredient is the sharing of love with a true life’s partner. I need my only man who will love me and whom I will be able to give all my feelings. And if I get the same response I can give all my sincere love in exchange. I am really gentle, caring and passionate when I fall in love.I am a young and pretty girl, rather strict to myself, but very amiable to others and tender to my lover. I am sociable, humorous, kind, optimistic and non-conflict. I like to argue and discuss things but I can easily make a compromise. I do appreciate honesty and loyalty in people. I am sociable person with a great sense of humor. My personality is romantic and a long walks under the moon inspire me.I am longing for creating a harmonious, life-long relationship with deep love, sincere care and mutual respect as a solid foundation. I am a very attentive, giving woman and I will surround my future partner with a lot of affection and gentleness, bring to his life that safe, secure feeling of being appreciated and cared for and I will spare no efforts in order to make him feel really happy with me. I am a compliant, patient and flexible woman – I am able to listen, to understand, to compromise and forgive. I am sure that holding grudges never helps any relationship, I am not offensive at all and I will always care about my man’s feelings primarily. I am kind, sympathetic, helpful. My partner can rely on me in any life situations, I am able to solve any problem with my optimistic, resourceful nature and strong power of reasoning. I am very inquisitive and interested in theories or concepts, especially when I see a practical application to them.", "email": " conniebowen2015@gmail.com", "tags": ["Female profiles", "hangouts", "love scammer", "sugardaddyforme"], "gender": "female", "images": ["connie121k1.jpg", "connie121k2.jpg"]}