{"year_reported": "2016", "month_reported": "03", "username": " Gianma23", "name": " Cameron Gianmarco", "age": " 53", "occupation": " Self Employed", "status": " widowed", "inet": " 41.151.155.141", "description": "\nI am hopeless romantic,down to earth,honest,trustworthy,fun to be with,cool and gentle. I know life seems so hard sometimes and most of the people we think they should be there for us,run away. There are times when we would want family to shower love,passions on us,there are times when we would want neighbours to shows us how much they love us,how much they do really care and there are times when we would like our friends to tell us how much they miss us each second that counts,but,they won’t really have the chance to do so. People,we think they should be there for us sometimes do lie to us,so,I never blame or judge those who said life is like history and full of misery. Honesty is the best policy in everything and it’s what that makes a perfect relationship grows. Love is sweet,but having someone around us,someone who truly care about our welfare,someone who believes and understand what really a family is made up of..lol.. I know I’m not a perfect guy,but I really do my best to be there for my woman everytime and I don’t believe in head or mind games. I would love to meet someone who shares same interests as me,someone who can be there for me through everything,a lady who believes in her inner beauty lol. I do believe that love could move mountain if the heart and the mind works together to make it worthwhile..I think I am too old for bs and I dont like lying because I would never tell a lie even to save my own life. I believe in my heart that I am funny but most people think I am straight with my words but I do have a good heart and I go to gym to keep fit lol. I just wanna be in a relationship where everyday is a joy and happiness for me and my partner and the kids. I am looking for a woman who will always love me for me,a lady who will never let me go,someone who’s down to earth,honest,kind hearted,funny and a lady who could really make me laugh for no reason at all lol. I know friendship brings the perfect connection between two people which later develops into a strong and lasting relationship. I am a kind of man who don’t live on the pasts,I don’t do the club stuff,I don’t smoke and don’t stay late out at nights. I ain’t no want mama’s girl,all I ever want is to find someone who we will try each and everyday to be there for each other and see what develops from there…..", "email": " CameronGianmarco1@outlook.com", "tags": ["Male profiles", "facebook"], "gender": "male", "images": ["Gianma231.jpg"]}