{"year_reported": "2013", "month_reported": "03", "username": " Fisher", "name": " Fisher Morgan", "age": " 51", "occupation": " Engineer", "status": " single", "inet": " 173.254.207.44, 41.206.15.27", "description": " Am a gentle and easy going Man a father of one son his name is Kelvin he is 19yrs old i lost my wife 3years ago at child Birth i lost her and my only Daughter, since then have been looking for a woman that i would love for the rest of my life a woman who will treat me as a King and a Woman who i will also Treat like a Queen..\nmy personality traits are joking kidding teasing people but never forget my responsibilities.. I like these kinds of music pop soul reggae classic.. country music. jazz and rock. I like these physical activities swimming tennis ride horses… I am a very likeable person according to most people.. Trust, compatibility, always being their for each other in good times and bad. Love being the key to it an ideal respect goes for all hand to hand Decisions are met together.\nI´m looking for a woman for long time relation or marriage. I miss somebody to do things with and for.. love to work hard and at the end of the week when the weekend comes know there a special woman for me wanting to spend time together. My idea of fun could be a romantic night out dinning with some good conversation and some great wine . I would just love to meet a down to earth person that doesnt seem to have any hang-ups. A good old fashion woman that wants to be treated like a lady. I enjoy the beautiful outdoors and also all of the fine arts and dining. Romance just begins and not ends at the wedding altar. Every day I will say ” I love you” through word and deeds of small acts of kindness , Letting you know you mean the world to me . Should she understands the difference of sensuality over just sex all the better.", "email": " Fishermorgan07@yahoo.com", "tags": ["Male profiles", "badoo", "facebook", "romance scammer"], "gender": "male", "images": ["Fisher1.jpg", "Fisher2.jpg", "Fisher3.jpg", "Fisher4.jpg"]}