{"year_reported": "2015", "month_reported": "05", "username": " Aperfectreason", "name": " Robert Bowman", "age": " 55", "occupation": " Sales Rep for Mercedes Benz", "status": " widowed", "inet": " 191.101.61.45", "description": "\nThank you for taking the time to look at my profile. I have a good sense of humor, love to laugh and like to keep a relationship fun and refreshing. I am intelligent, but also know I am a long way from perfect. I am outgoing and would rather be with that special someone having fun than be inside sleeping in a chair. Discovering new places and learning new things keeps me energized. Laughter is extremely important. The kind that hurts. There is nothing in the world sexier than a woman with a great laugh and sense of humor. I am looking for someone who can laugh at life’s daily absurdities and incongruities. I am passionate about music I enjoy going to concerts and love music of all kinds from the blues, zydeco, rock, New Orleans funk, Americana, ska, punk, classic rock, you name it. I’m looking for a woman who enjoys an active lifestyle. A woman who can be spontaneous and enjoy it! She is smart, perceptive, and self confident. She is independent, but also very affectionate and sensual. Also playful with a good sense of humor, and loves romance. She doesn’t need a man to tell her what to think. But she WANTS a man with a mind of his own, who also wants to know what SHE thinks! If you don’t agree with that, then I am probably not the right Guy for you. If you’d like more info, please let me know.Talking about who i am, I am that easy going type,open minded and a good listener. I laugh a lot and try to make people around me all the time happy. My hobbies are too many but to mention a few; sports,watching movies, going for walks, listening to all types of music, dancing in the dark etc.My favorite movies are romantic movies, eating habits are just about anything..I think i should let you know that My lips are kissable which is one of my most attractive features,I can kiss my woman for a whole day..Even in Public.Now don’t get me wrong I’m a very fun person and can make fun of any situation. I’m just looking for everything I need in one woman.", "email": " makingmoney1009@gmail.com", "tags": ["Male profiles", "blackplanet", "connectingsingles", "faxo", "romance scammer"], "gender": "male", "images": ["Aperfectreason1.jpg", "Aperfectreason2.jpg", "Aperfectreason3.jpg", "Aperfectreason4.jpg"]}