{"year_reported": "2015", "month_reported": "03", "username": " giordano46", "name": " Giordano Shawn", "age": " 41 or 44", "occupation": " military", "status": " separated", "inet": " 5.63.45.122", "description": "\nI have been told my personality traits include: generous, respectful, friendly, compassionate,\nempathic, discrete, attentive, good listener, tactful, open minded, affectionate, patient and fiercely loyal. I know the above sounds so self-serving, but it’s what I’ve been told…really!)\nHave a professional career and am financially secure to enjoy some of life’s little pleasures and adventures. In my younger years, I placed a misguided emphasis on “JOB” & then found later in life the only really important and meaningful things in life, are family & friends. While work is still important , I no longer live to work, but rather now work to live. Am somewhat tired of being so conservative, want to experience some new things. On a personal note, like all of us who have life experiences, I have collected some “baggage”along the way, but not so much that I can’t carry it by myself. have most of my hair (even though admittly receeding quickly) I have all of my teeth! Have to acknowledge that am no longer an “Adrenalin Junkie” (been there, done that, in my younger days) but as Toby Keith said “I ain’t as good as I once was, but I am as good once as I ever was”. Hope to meet someone who shares my interest in stepping out of their comfort zone and taking the more adventurous path. While personality and spirit are most important, I am also looking for someone who considers themselves attractive, affectionate and broad-minded. Hope to find a woman who values her own independence and self- reliance, but also has room in her heart for a partner too.", "email": " giordanoshawn46@gmail.com", "tags": ["Male profiles", "military scammer", "mingle2", "okcupid"], "gender": "male", "images": ["giordano461.jpg", "giordano462.jpg", "giordano463.jpg", "giordano464.jpg"]}