{"year_reported": "2012", "month_reported": "12", "username": " jamesmorega", "name": " James Morega", "age": " 52", "occupation": " enginear – his spelling", "status": " single", "inet": " 67.212.83.3", "description": "\nwell I love life, I am an optimist, I am positive about things, I see the glass as half full, rather than half empty. I do seem to have a smile on my face most of the time, I am by nature a happy person, I love smiling, giggling, once I start giggling I can’t stop, and I have an infectious smile,I do seem to have a smile on my face most the time. I am a very loyal friend to the people I know, and I would not ever want to hurt anyone, that is not in my nature, I love happiness, I love life, and most things that are in life.I need a long term relationship with You,to have a love that could last for all of eternity.\nI am far more interested in who a person is inside, i don’t base much on looks, i love a person’s heart and soul, what makes them unique, i would hate everyone to be the same, i am always saying that if everyone was the same then it would be a pretty boring world, it is our differences that make life worth living, that makes life interesting, it is the people we meet.\nI love life, i love living, and i know what i want from life, from love too, and i love going round museums. i love art, movies, oh i love music, i love good food, good conversation, i love films, love sharing thoughts, feelings, getting to know who a person is inside.i am a very open minded man, easy going, loving, honest, faithful, romantic man, i am good matured, and treat everyone how i would love to be treated, with love, respect and understanding.I am the type of man that would never hurt someone else, not for all the tea in China, it is just not in my nature. I like to understand why things are the way they are.I like to expand my knowledge and learn when i can.\nI love reading, I love romance, and I think that life is about living, and loving with all your heart, body and soul. I am a very passionate man, passionate about life, passionate about love, passionate about living too, and I want to be loved for who I am, to love and to be loved.There are so many things that please me, everyday things, I love to hold doors open for people, I love when I am shopping to say thank you to the person serving me in a shop, I love the sun, the way it makes me feel, I don’t like rude people", "email": " jamesmorega1@yahoo.com", "tags": ["Male profiles", "netlog"], "gender": "male", "images": ["jamesmorega1.jpg", "jamesmorega2.jpg", "jamesmorega3.jpg", "jamesmorega4.jpg", "jamesmorega5.jpg", "jamesmorega6.jpg", "jamesmorega7.jpg", "jamesmorega8.jpg", "jamesmorega9.jpg"]}