{"year_reported": "2017", "month_reported": "01", "username": " alexis5", "name": " Alexis Morgan", "age": " 46", "occupation": " army", "status": " single", "inet": " 109.201.137.52", "description": "\nI’m not looking for just anyone. I know what I’m looking for so if you are not what I want please move on and keep looking. You must be the kindest earth angel that puts other people before them self. one who is so honest it hurts. Loving, caring, giving, and loves to do so much smiling and laughing there is no time left for being unhappy. My preference in my earth angel be between 5-2 and 5-5 and somewhere around 130 lbs give or take a little and maybe in your 50&quot;s. Sorry if that sounds snobbish but that’s just what I am attracted to and lets be honest if no attraction it probably wont work out. A relationship does have to have a physical mental and spiritual attraction maybe not necessary in that order to work. I don’t want to jump in bed first and then see if we even like each other, want to take time to get to know each other first learn our likes and dislikes. I mean how could I ever fall in love with a girl and not even know if you like ice cream know what I mean. I enjoy enjoying the simple things if life like taking a walk holding hands and end up having a picnic, hop in the car and who knows end up at a flea market and end the day having a nice dinner out. I also don’t think there is anything wrong with stay at home and I cook up a wonderful meal and then just cuddle up and watch a little tv Maybe I expect to much but this is what I am like and want you to be the same. I’m not looking to change anyone just want to enjoy a totally peaceful loving relationship with an earth angel again. If this sounds like what you are looking for and are being totally honest then please respond back. If not please move on. Hoping to hear from my one and only. Oh ya PLEASE be my angel……………….", "email": " alexismorgan2333@gmail.com", "tags": ["Male profiles", "badoo", "military scammer"], "gender": "male", "images": ["alexis51.jpg", "alexis52.jpg"]}