{"year_reported": "2017", "month_reported": "02", "username": " Anna3654", "name": " Anna Medes", "age": " 29", "occupation": " manager", "status": " single", "inet": " 104.220.172.128", "description": "\nIt really difficult to describe myself here, (internet), but I will try.\nThis thing does ask you the right questions, because it leaves you wondering what you should write here.\nI am an easy going person and I am a wonderful person to be around.\nI am one of those people that will let you have her coat and make sure that you where having fun before\nI would do anything else.\nBut of course I would expect the man to do the same things for me.\nOf course relationships are 50-50 and that is what I do believe in.\nI, like so many other people have my option about everything so I can keep a conversation going\nbut the man has to want it to go on as well.\nI do not believe in one night stands this is just wrong in my mind, so do not even try it.\nI want a man that when we are with each other that does not go on and on about how much he\nhates his job or how bad his life is.\nI want an upbeat guy, nice, sweet, maybe a hint of shyness, guy who likes to be tickled,\nwho has a nice smile, and has his head on straight.\nI am a flower freak, Everybody is looking for the right person and to me somebody who likes 80% of the things\ni like is important to me, oh and of course I would like somebody who likes animals and who knows what he wants\nin life and who he is going to accomplish those things, i always feel happy to meet interesting people.\nI enjoy watching movies at the cinema with my hubby, long walk, cuddling,\nI like reading books ( motivational: christian and contemporary books),\nI love making my home cozy and i love cooking too. I love romantic candle light dinner,\nI like going to the beach, the warm weather, cool and blue evening, look i love nature my friends say that\nI am kind, down to earth, open hearted, easy-going, and romantic too. I have an optimistic point of view and\nI have good sense of humor. i am able to give a lot of love and care to my hubby and I also hope to receive this as well,\ni just want to love and be loved.I am a family oriented person and There is more, but it would be better for you to find some things out for yourself.", "email": " anna.medes@yandex.com", "tags": ["Female profiles", "romance scammer"], "gender": "female", "images": ["Anna36541.jpg"]}