{"year_reported": "2012", "month_reported": "12", "username": " love_cute15", "name": " Berthra Geeslin", "age": " 49", "occupation": " –", "status": " –", "inet": " 85.159.236.209", "description": "\nMy friends would describe me as an adventureous, fun, athletic, honest and loyal individual, who takes care of those closest to him. He is someone who would jump out of bed in the middle of the night to help someone in need and never expect the same in return. He has a great career and understands the value in working hard and being professional. In his spare time you’d find him on the slopes, hiking the mountains, running and/or riding the foothills, taking in a movie or finding live music to get lost in. Overall…a great man and great catch 🙂 From my perspective I’m all that and more! I value friendships and family and have a positive outlook on life. I’ve leaned the importance of communication in a relationship, it’s importance and how it can bring two people together. I believe a relationship is a true partnership…two people together, sharing, being open and honest, knowing they have each other back, both equally involved to keep a healthy balance. I love being active and keeping fit…it’s good for the body and the mind! Have had the pleasure of completing many triathlons…two of them being Ironmans…and hope to finish one more long distance event as the goal was always three. The sport has taught me that we all have it in us if we try hard enough and, that in the end, it’s well worth it. I take that knowledge into a relationship…if two people truly care for each other then they will be together no matter how difficult life may be! I’m a very affectionate and open individual who is comfortable in his own skin. I stay active and love the outdoors, though quiet evenings and lazy Sunday afternoons can be just as enjoyable. I’ve traveled all over the country and Canada for my career and am now settled full time in Canada. Even after spending the past few years on the road I still enjoy the weekend get away and I look forward to taking a week long vacation once a year", "email": " berthra_geeslin@yahoo.com", "tags": ["Male profiles", "fishmeetfish"], "gender": "male", "images": ["love_cute151.jpg"]}