{"year_reported": "2014", "month_reported": "12", "username": " hawleyjackson", "name": " Hawley Jackson", "age": " 44", "occupation": " Computer Engineering", "status": " single", "inet": " 5.63.150.76", "description": "\nlets see, i am spiritually grounded and balanced in life. Having a strong connection with God makes me balanced and humble. My goals in life are to be fulfilled and share my life with my soul mate. I truly want to treat my soul mate like the queen that she is. My mission in life is for us to be happy together, respect each other, grow as a couple, love and cherish our family and true friends. My family is very important to me and. I come from a strong family background and would like the same with my partner and family. My family is essential we have a wonderful relationship. I choose my friends wisely and we have a great time together . Being a successful man has long been a dream of mine and i thank God it has come true. As a successful man I work very smart and hard. But I’m not all about work, I am a humanitarian and live an holistic, balanced and healthy life. I love to exercise 4-5 times per week. I enjoy reading, traveling, exercise (any type), laughing daily, music, dancing.Camping, Biking and Watching Sport events. Being optimistic is part of my core character. My motto is to live with passion, purpose and power! I’m a sincere, honest, confident, charming, and compassionate man that knows what he wants and how to treat a lady and people in general. I’m known to be persistent in life and business and usually get what I want. Ambition is a strong characteristic of mine and I thrive on being my best in all aspects of my life (but I’m not a perfectionist). I’m not afraid to take chances and I have the courage to go for what I want. However i’m not foolish and my pursuits are well thought out and researched before I make my decisions", "email": " hawleyjackson22@gmail.com", "tags": ["Male profiles", "facebook"], "gender": "male", "images": ["hawleyjackson1.jpg"]}