{"year_reported": "2016", "month_reported": "09", "username": " issaka", "name": " Fati Issaka", "age": " 34 or 35", "occupation": " nursing", "status": " single", "inet": " 23.235.227.106", "description": "\nmy name is fati issaka 34yrs single never married before and here looking for my soulmate.. i have no kids and looking doe a seriuos relationship yes My desire is to meet a Handsome, sensitive, sensuous, warm, assertive single man who wants a friend. My interpretation of a friend is one to whom you can pour out all the contents of your heart, chaff and grain together, knowing that the gentleness of hands will take it all, sift it, keep that which is worth keeping and, with a breath of kindness, blow the rest away. I thank you in advance for allowing me to be that kind of friend to you. I am looking for a special, loving relationship with a unique Man who is affectionate, Handsome, with a shapely figure, sincere, easygoing, with interests and characteristics similar to mine…someone who wants a meaningful, serious, long-term relationship…not just a few dates. Are you that special Man? I am looking for someone who has a great sense of humor and big heart, is curious about new things that would like to share new experiences or old habits. I am looking for someone who believes that a true intimate partner looks out for the other and vice versa. While navigating life together, we are caring and concerned for each other’s well-being because we make each other so happy and we love each other very much. Looking for a serious long term relationship with someone who posesses strong character and is goal-oriented.he will love me with all his heart. He should enjoy good humor, love to laugh, and be a hopeless romantic.So that would make him a God-loving romantic guy……and God will approve.lol. My ideal partner must love to take long walks…holding hands……..when I am not giving him a “….His yes must be yes, and his no, no….. …..shafiwuharrislove(at ) yh ..dorisbonsu123atgmail", "email": " dorisbonsu123@gmail.com", "tags": ["Female profiles", "love scammer"], "gender": "female", "images": ["issaka1.jpg", "issaka2.jpg"]}