{"year_reported": "2013", "month_reported": "03", "username": " heartedsteve", "name": " Patrick Steve", "age": " 50", "occupation": " Data Security Expert", "status": " divorced", "inet": " 41.190.3.157", "description": "\nhello to everyone on hereAm Henry by name,49yrs old,well am so happy to sign up on here and i hope to make good friends on here and also hope one day i find the right woman,just been tired of been alone,My personality traits are joking kiding tising people but never forget my responsabilities..I like these kinds of music pop soul reggae classic..country music.jazz and rock.I like these physical activities swimming tennis ride horses…I am a very likeable person according to most people..Trust,compatability,al ways being their for each other in good times and bad.Love being the key to it all.In an ideal respect goes for all hand to hand. Decisions are met together. One is there for the other. To present itself mutually protection and just, I find this important.with many love, romantism, mutual atention, caring …and all choises to live togheter in a perfect familiar harmony…Looking for my best friend, my soulmate. I love the outdoors, candle light dinners, fireplaces, walking along the beach, river or lake at sunset. I try to see the positive in all situations I see the cup half full instead of half empty. I want to live each day as if it were mylast full of love and laughter. I love living in the foothills of the Great Smoky Mountains it is as close to paradise as I have found. would like to find my best friend, to share the rest of my life with….someone that is a Christian, and has good family values. I would like to meet someone as friends first and go from there. If we do click, I like to visit museum or historical places. I also like watching movies.I m looking for a woman for long time relation or marriage. I miss somebody to do things with and for.. well i guess i will stop here..", "email": " patricksteve104@yahoo.com", "tags": ["Male profiles", "fishmeetfish", "romance scammer"], "gender": "male", "images": ["heartedsteve1.jpg"]}