{"year_reported": "2015", "month_reported": "05", "username": " bob", "name": " Bob Yonkers", "age": " 50", "occupation": " –", "status": " seperated", "inet": " 41.71.188.93", "description": "\nAbout Me EEEKK I always hate this part… Okay so I guess first and foremost, If I was to sum myself up….hmmmm I never really know what to say here in these things, it is like a test, crap I get test anxiety… AAARRRGGGHH smashes head on key board, repeatedly. With that said I don’t think any of us can really describe ourselves in a few paragraphs, at least I know I can’t, so the best thing to do is take a chance; if you want to know something ask… drop me a line. I don’t bite…. hard. * grins* But lets cover the basics… Big thing you should know is I am not in need of paxil or any mood altering meds. I am not insane, psycho or a stalker. That alone, I have probably lost half of you reading this. LOL LOL Me in a nutshell, I’m me. I decided to ask my friends about me, ha who better, right? Here is what they said, I am laid back, down to earth, too smart for my own good. I’m always laughing at one thing or another (I promise I don’t snort). I’m very classy, well mannered, but behind closed doors, I relax.I’m loyal to a fault to those that earn my respect. I’m very respectful and polite at all times, until you give me a reason to not be. I’m very passionate about certain things, and far too honest for my own good. PLEASE take this to heart because I am honest to a fault… Don’t ask unless you really want to know. I’m very pointed in everything that I do. I have been told I could have fun at an insurance seminar. I’m always learning. I can be very rough and tumble.I’m not high maintenance. I am very ambitious and I have goals. I am very active and always doing something. So that about sums it up. I’d like to establish friends and then take it from there. I believe any relationship friends or otherwise is based on 4 things, trust, honesty, respect, and communication, if you don’t have these then you are wasting your time. I’m Not looking for an internet thing or to text 24/7, I hate texting. I do have a child and he comes first. PERIOD, he and I are actually friends still. The reality is we all have a past and we all have scars, it is what comes when you live fully. It means you take a chance and you get hurt, it’s life. However it is what we do with the scars that defines us. You can live or be a victim, there is no in between. I am not into drugs at ALL this is non negotiable. I really have to warn you I have NO tolerance for liars of any kind, and not telling me is lying by omission. If you’re separated or married, I’m not interested. You’re still married. I take that seriously. If your looking to be plugged into TV or games 24/7, or sit and text 24/7, I’m not right for you. If you want someone to tell you what to do, I’m not going to be what you are looking for. Game players, drama queens and emotastic folks, I don’t have the patience for it.", "email": " yonkers229@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["bob1.jpg", "bob2.jpg", "bob3.jpg"]}