{"year_reported": "2012", "month_reported": "06", "username": " cuteme897000", "name": " Andreev Butler", "age": " 56", "occupation": " Civil Engineering", "status": " Divorced", "inet": " 196.46.71.251", "description": "\nI am told that I am a polite, provocative, reliable, funny, offbeat, often charming intellectual with a staid, I’m looking for the impossible or, at least it seems that way. I want to find women that will date, not just post a profile and wait for the waters to part and the bush to burn so their prince-charming will suddenly appear, but someone that can meet for coffee or a drink with an open mind about what might happen. I will hope this woman will have lived a free young life and is ready to calm down a bit and look for a partner to reach goals with, travel with, spend time with. If you’re still into Cafe Frenzy on a Friday night, I’m not looking for you. If you like apps and a couple of glasses of wine after work, then I’d be interested. I’m a person that enjoys a great time, whether its grilling out on the back deck or swinging the club on the 13th fairway. Some other favorite activities are an occasional softball game, riding my bike, working on my sunburn at the lake and hanging out with friends at the local pub. I enjoy college football, especially with a group of friends. Definitely wouldn’t turn down a Sunday afternoon movie. Missing SCUBA for too long, wouldn’t hurt to meet a good dive buddy. Looks like the only thing I’m missing is that one person to share time with. I am interested in meeting a nice girl that shares some of the same interest and would be fun to be around. My friends are important to me, so friendly and outgoing qualities are a must. A great cook is a definite plus. There is a lot more to learn.\nI’m thinking that my life was stress free until I had to write this profile,I am kind and loving, strong and committed, thoughtful and fun. I grew up in loving and stimulating environment. I believe that when you open yourself up to possibility, great things can happen. I have a wide variety of interests.I do like to travel,to be in the sun at the beach is # 1 with skiing in Colorado a close #2. My favorite thing is a positive attitude. I love to exercise. (The days are flying by and I want to stay YOUNG!, so I am busy recapturing the extraordinary physique of my youth).When I cannot be at the beach or Colorado, the lake or out by the pool is great. I like parties, kids, movies,and being with friends. Relationships make for a great life, not things. I can adapt to most any type situation and have the ability to open conversation with anyone. I am independent but love being on a team. Real important,,I like to have fun and laugh and (TRY) to make others laugh.I like a lady who smiles and has enthusiasm. I am interested in someone who appreciates what life is but wants to make it better. I like someone who loves like mother Teresa but can dance like Madonna at night,if you are the one i dare you to email me", "email": " andreevbut00090@hotmail.com", "tags": ["Male profiles", "love scammer", "pof"], "gender": "male", "images": ["cuteme8970001.jpg", "cuteme8970002.jpg", "cuteme8970003.jpg", "cuteme8970004.jpg", "cuteme8970005.jpg"]}