{"year_reported": "2017", "month_reported": "12", "username": " sweetyolanda", "name": " Yolanda Omar", "age": " 36", "occupation": " self employed", "status": " single", "inet": " 166.149.37.221", "description": "\nI am very open and honest. I lead a healthy way of life and teach people how to do it as well. My heart is full of love and affection and I am ready to share it with you. I am a kind, loving, understanding, sexy, trustworthy, faithful, devoted and submissive. I want to find somebody who will make my heart beat faster. I consider myself a kind, generous person and I always aspire to make people surrounding me very happy. I am looking for family-oriented man with kind and tender heart. I like to be romantic and have special time with my man. I know how to love a man with my whole heart and I want to find that special someone who will be able to accept my love and to feel the same for me in return. I am sociable, easy-going, open-minded, educated and polite. At the same time I am sensitive, tender, sincere and feminine. In a relationship I appreciate honesty, trust, respect, care about each other and sharing interests. The most important thing in life for me is happiness, health and prosperity of my family. I hope that I will meet here my unique beloved who would share my dreams and desires. I am with all my heart ready to answer with the same.I’m looking for a man to create a family with. I want to find a partner in life who will be my true love and my best friend. I’m romantic and sensitive woman who wants to give love and to be loved. I’m traditional in many ways. I love children. If you have children it’s fine.I am sensitive individual, who is caring and honest. I like to treat people with respect and I value friendship greatly. I live by my impulsiveness and can be quite random at times because I like to live by the moment, because every moment is precious.I believe that I will meet in my life a serious man, who would like to make a strong and friendly family. My dream is a strong, tender, kind and problem-solving man. I am sociable, kind, cheerful and I have a great sense of humor, but here I am with serious intentions and I want to find such a man with whom I will be happy and I want to fall in love. I love this life and I like to meet with different people.I would like to see him cheerful. I am looking for a tender, caring and reserved man. He might be ready to help me at any moment and always trust me. I want to find a man who regards me such as I am and he should be ready to be with me both in joys and sorrows. I want to find a man with whom my heart will be beating faster.", "email": " omaryolandaaustin@gmail.com", "tags": ["Female profiles", "love scammer"], "gender": "female", "images": ["sweetyolanda1.jpg"]}