{"year_reported": "2016", "month_reported": "11", "username": " coolcaleb", "name": " Caleb Headey", "age": " 42", "occupation": " Enginner", "status": " single", "inet": " 50.23.99.119", "description": "\nI was Born and raised In Wisconsin in the city of Sheboygan.I am the only child of my parent and I already lost my dad. I have been taking care of myself.because been single no one will, I have been engaged before and I was hurt by my Ex-girlfriend…I caught her in the shower with my best friend. I have been since for over 4years now without any woman.. believe that I have everything any woman could want from a man, I know that but am not saying that am the best man on earth, but I still believe in me, and in God almighty father, I believe that one day my soul mate and dream woman will surely come for me. I’m open, sensual, kind, gentle, romantic…family oriented, sensitive and tender person, I want to give all of my tenderness and care to my special woman, I enjoy nature, seeing the stars at night, listening to the sounds of nature, being near the water, swimming, as I love the ocean and sea, I like traveling, diving, dancing, drawing, skating and bowling, billiards, I enjoy music so much, Blues, classical and modern.\nAm looking forward to meeting my special woman. I would like her to be kind, attentive, caring, reliable, well-mannered woman with a good sense of humor. she should be serious in her intentions to find a right man and create a happy family. I would like her to appreciate not only my appearance but my inside world as well. she should also be goal-oriented, self-established, not greedy and narrow-minded.She should know how to treat a man. she should love children.\nAm a cool very comprehensive man,down to earth,lovable at first date and any woman i pick on,trust me i have huge feelings for her,if not i won’t even make any move,so if i send you a message,trust me is because i care and i love the person,so i do take my time to like and be your friend and i don’t cheat am a one woman one man oriented man", "email": " caleb.headey@gmail.com", "tags": ["Male profiles", "dateolicious", "hangouts", "romance scammer"], "gender": "male", "images": ["coolcaleb1.jpg", "coolcaleb2.jpg"]}