{"year_reported": "2012", "month_reported": "09", "username": " big_me", "name": " richie dodge", "age": " 49", "occupation": " Self-employed", "status": " Widowed", "inet": " 68.68.107.79", "description": "\nI am an intelligent, attractive,and professional American man who lives life to the fullest a passionate Man, a deep thinker and I feel things deeply. I am always thinking about something. I dream a lot. I am intense and sensual.My heart is already free. I love to kiss. I am spontaneous. I have animalistic chemistry when I meet someone that has it as well.I like to laugh and enjoy life. I love the outdoors.I love adventure and trying new things. I am open to just about any type of activity, I don’t mind to get my hands dirty when necessary.I love romance, eye contact, and I am playful and love to give and receive affection constantly. I am a very real person and looking forward to meet a real woman too. I don’t like Women who lie, use and hurt people. I hate being stood up and broken promises. If this is you stay away from me.I don’t want one memorable night! I want endless memorable nights with someone TRULY SPECTACULAR! I am outgoing and easy to talk to. I always make people feel comfortable when they are around me.I am a honest man and have a lot of intense passionate love to give to the right person who has the same to give to me.I am creative in my personal life and with my business. I love music! I write song lyrics and poetry. I love live music. Words with deep meaning touch me and turns me on. Rock and Roll rules my heart, there is nothing like a rock and roll song with a sexy beat. I like slow sensual music as well.I am looking for a connection with that right woman that has a really sweet and loving heart full of passion who knows how to treat a man right,who is respectful and knows how to love truly,madly,passionately and deeply..If you get interested in any way drop me a line with your phone number and email address so i could reach you directly…..Hope to hear from you soon…………", "email": " richie_dodge765@yahoo.com", "tags": ["Male profiles", "matchdoctor", "tagged"], "gender": "male", "images": ["big_me1.jpg", "big_me2.jpg", "big_me3.jpg", "big_me4.jpg", "big_me5.jpg", "big_me6.jpg"]}