{"year_reported": "2017", "month_reported": "04", "username": " Hotqueen", "name": " Monica Reed", "age": " 29", "occupation": " Hair Stylist", "status": " single", "inet": " 125.63.18.8", "description": "\nI am a Lady of God first and then a Sweet Angel,and loves spending time with family and people I love.But you should know God comes first!!I am looking for the same kind of Man also a Man that will love me as God loves the church. am looking to share my life with a wonderful gentleman..I’m looking for someone that’s kind, honest, dependable, and has a Great sense of humor. and have an opened minded. But most of all must be very understanding So if your really looking for a very nice Woman that you can talk with and have some nice clean fun with. you can email me to my inbox or Text me. I believe everybody has a past that’s made us who we are. Where you’ve been and what you’ve done doesn’t matter… It’s what you do and where you go from today that counts. I want that person to be able to take me for who I am and not wanting to make me into someone else. I love to do things in the outdoors and I love to just stay in on a quiet night too. I am a very compassionate, loving Woman who will make time when needed. I would like my match to enjoy in good, humorous conversation. enjoy the passion of life as well as in the bedroom. I need someone who is honest. he will receive it back 10 fold, Because i like to put back what i gain in a relationship.I would like a Man who is physical and not afraid to show it public-ally. I value all families, and I need a strong respect of them as in each other. I am very committed to any thing of value in life. I have a strong constitution of right and wrong. Live my life to reflect integrity. I am always in a good mood, yet am a hot head. Never holds a grudge or disrespect the ones I am with. I need a Man who is versatile in friends as well in life. Someone in that mind set of “you get the day, don’t let the day get YOU”. I am a very positive person and like to be in the company of the same. I am hard working, and like to play that way to. I love passion and love making, and the conversations in between. I want someone who wants to be apart of my life ,and wants me apart of HIS in all aspect.With me everything is based on Trust, Respect, and integrity. I am not a one type individual, but there must be a physical attraction. I take a lot of pride in what I look like. I am athletic, . I look young for OLDER THAN my age and act even more so. I am a lover of life and all that it throws out to us. The human mind is a very strong and powerful thing! But the eyes will always be the keeper of our soul.", "email": " monicareedqueen@yahoo.com", "tags": ["Female profiles", "romance scammer"], "gender": "female", "images": ["Hotqueen1.jpg"]}