{"year_reported": "2015", "month_reported": "11", "username": " theonlyhonestman", "name": " John", "age": " 55", "occupation": " real estate", "status": " widowed", "inet": " 188.72.107.20", "description": "\nHi I’m John, thanks for stopping by! I try to stay on the lighter side of life, I am one who always tries to see the good things in life. I am defiantly laid back and I can be both active and chill. I defiantly have some personal interests but love to support and explore new places and adventures if the opportunity presents itself. My maturity has taught me that although attraction is important, it’s important that I’m attracted to the whole person, virtual communication is cool, but life was meant to be experienced by an exchange of our senses. I am on here to meet people outside of this site.\nI am a very open and loving man, I can be intellectual or silly and stupid, I enjoy investing my life into the people in my life. I believe I am kind, generous, and I believe that forgiveness seems to be one of my best traits. I love to spend time with those who are closest to me. Lastly it is my true desire to spend my life with that one person who will be the outpouring of my life. Can I say a little something about the uniqueness of people… I find that if two people connect and they enjoy each other regardless of their differences in age, income, race, maturity, height, weight, ability, education, then by gosh those people two people have struck gold. I am Successful, educated, down to earth professional looking for a long-term (forever) relationship. Enjoy a good conversation, meal, workout, movie, book, theatre, sports, and other events, and oh yes, passionate making love. I would like to do more hiking, traveling and camping – just need a little encouragement. I enjoy being social and I enjoy cuddling on the couch or in bed with the woman I love. I have a Son but he doesnt live with me", "email": " iamready4unow@hushmail.com", "tags": ["Male profiles", "mingle2"], "gender": "male", "images": ["theonlyhonestman1.jpg"]}