{"year_reported": "2016", "month_reported": "08", "username": " janecares4u", "name": " Jane Dickerson", "age": " 38", "occupation": " teacher", "status": " single", "inet": " 207.244.89.90", "description": "\nThanks for taking the time to read my profile. I am born and raised in North York Ontario Canada. I have done some world travelling and I have really enjoyed learning about other cultures. A little bit about me hmmmm. I am 38, years old .Work does keep me busy and I have to travel at times. I think it’s time I have some fun in my life as well and settle down with man of my dreams. I am not the type of person that like to stay at home all day when I am off work. I like nice drives along the coast in my dad car. I like going to the theater,Church. I consider myself Sincere and a romantic. I enjoy intelligent conversation as well as sharing a funny experience in my life. I am interested in finding a man who knows what he wants, no games, no drama. A man who believes that life is a gift and who is not afraid to take chances and have fun in life. A woman who likes to laugh, sensual and passionate.I seek a quality individual who has had different experiences in life good and bad and is not afraid to share them, we have all had them, live and learn. I do not wish to be taken advantage of. I wish to be appreciated/treated with respect, and I request this in advance to any communication. I enjoy someone who I can have an intellectual/serious conversation with one minute and the next minute be laughing so hard over something that no one else would find funny but the two of us. Smart, confident demeanor with a kind-hearted and humble spirit? A man who has a desire to simply be happy and see her partner happy. I’m interested in seeing a man 2-3 times a month. Lets take things 1 step at a time and see what happens. Life is a gift, enjoy it.", "email": " janedickerson247@gmail.com", "tags": ["Female profiles", "facebook"], "gender": "female", "images": ["janecares4u1.jpg", "janecares4u2.jpg"]}