{"year_reported": "2017", "month_reported": "01", "username": " richmart", "name": " Richard Martinez", "age": " 38", "occupation": " Military Soldier", "status": " single", "inet": " 197.210.24.120", "description": "\nThe name is Richard Martinez. I’m usually so sweat and humble, and I’d spill my heart for you. I’d pretty much whip your ass at anything you do. I’m usually always the one to pull through, even if you don’t. If I say I’ll be there, then I’ll be there. If I say I’ll call, then I’ll call. Loyal dedication. I’m not fake like most people, and only seen at the tip of the iceberg. Sneaky. Quiet. Smart-ass. Clean or dirty, which ever you prefer. Hate popcorn. love sushi. drink coffee daily. rock out hourly. great sense of humor. I’ll make you laugh. no drama. no attachments. i wear a smile on my face. never get pissed. this feels like a job application. i talk to strangers. drool when i sleep. sleep naked. usually shave everything. workout daily. drink on weekends. my family rocks. my dad can beat up your dad. love adrenaline rushes. work hard for what I’ve got. worked harder for where I am. worked the hardest for what I’ve done and seen, where I’ve been and where I’m going. I ain’t scared to send a message to somebody I don’t know. That’s probably how you’re reading this in the first place.. I’m usually so sweat and humble, and I’d spill my heart for you. I’d pretty much whip your ass at anything you do. I’m usually always the one to pull through, even if you don’t. If I say I’ll be there, then I’ll be there. If I say I’ll call, then I’ll call. Loyal dedication. I’m not fake like most people, and only seen at the tip of the iceberg. Sneaky. Quiet. Smart-ass. Clean or dirty, which ever you prefer. Hate popcorn. love sushi. drink coffee daily. rock out hourly. great sense of humor. I’ll make you laugh. no drama. no attachments. i wear a smile on my face. never get pissed. this feels like a job application. i talk to strangers. drool when i sleep. sleep naked. usually shave everything. workout daily. drink on weekends. my family rocks. my dad can beat up your dad. love adrenaline rushes. work hard for what I’ve got. worked harder for where I am. worked the hardest for what I’ve done and seen, where I’ve been and where I’m going. I ain’t scared to send a message to somebody I don’t know. That’s probably how you’re reading this in the first place.", "email": " rich-martinez.martinez@yandex.com", "tags": ["Male profiles", "military scammer"], "gender": "male", "images": ["richmart1.jpg"]}