{"year_reported": "2017", "month_reported": "04", "username": " Linda434", "name": " Linda Wilson", "age": " 35", "occupation": " human resources", "status": " single", "inet": " 173.208.68.220", "description": "\nIf I say I’m sweet, kind, giving, compassionate, trusting, loving, and passionate would you believe me?I have a sense of humor and a sense of the ridiculous, a great listener and a good friend.I prefer to find something positive in most situations, and people.I’ve many interests and passions. I’m someone to love and count on my love and friendship in return. As I continue on this wondrous journey I’m discovering I don’t like confrontation or arguments. I’d rather talk some problem out than argue. Let’s meet half way.I enjoy traveling for fun,for the seasons and for business, I enjoy movies, staying at home. Also walking,taking a new course , traveling, flea markets,garage sales, home maintenance &amp; renovations, and meeting people.Football, basketball and hockey games, live or on TV are fun. I try to work out 3-4 times a week. Some weeks I actually make it.Love spontaneity, and I adore spontaneous activities.I’m open minded, curious and love to discover and learn new things.I’m entering a &quot;Journey of a lifetime&quot;. Plan to enjoy every minute, would like to share this journey…\nI’m looking for a mature above average man for a 1-on-1 long term monogamous relationship based on trust, honesty and communication. A man that has direction in his life. Can carry on a conservation, has a zest for life and living, can be serious or just act silly at times and likes to laugh and have fun. .A man who can be honest and sincere.A man to listen to my joys, and accept my loving advances and or to just hold me,knowing, when &quot;I just need a hug&quot;.SOME FRIENDS STAY FOREVER NEAR OUR HEARTS", "email": " lindawilson930@gmail.com", "tags": ["Female profiles", "dateolicious", "maybefriends", "metrodate", "mingle2"], "gender": "female", "images": ["Linda4341.jpg"]}