{"year_reported": "2017", "month_reported": "05", "username": " gary0011", "name": " Gary Hales", "age": " 66", "occupation": " Gold Dealer", "status": " divorced", "inet": " 66.208.223.197", "description": "\nIf Edison had been afraid of the consequences, we would still be sitting in the dark. Once in a life, a man is entitled to fall madly in love with someone that needs to be loved and be ready to return the love. That’s why I’m here to find that special person.\nMy Mom is German while my Dad is American. I travel a lot due to my job as a Construction Engineer, and also just because I love the surprise of the unknown. I love to learn about new places, people and cultures.\nI’m the father of a grown daughter who is currently in college. I like to be in harmony with the world around me. Wow, that sounds new age, but I’m very down to earth. I like to read a lot and keep up with many things–politics, social issues, culture, travels, people.\nI especially value humor, being able to laugh at yourself, being able to communicate, culture in general, social issues, staying healthy, and the freedom to think out of the box.\nI also like Woody Allen films, swimming, hearing people’s stories, and simply talking with people. One of the things I love doing is making people happy. I am willing and ready to make someone happy irrespective of it making mefeel bad. But my pleasure is in putting smiles on people’s faces.\nI’m looking for a companion–somone with her own life, with a strong personality, yet also able to make the compromises that life sometimes requires. Someone who is able to laugh at herself and tell me how wonderful it is to be in love. I am nobody without GOD and I am somebody with HIM. So I value GOD so much and I can never place no one or anything above HIM.", "email": " garywhales88@gmail.com", "tags": ["Male profiles", "linkedin", "loveawake", "romance scammer"], "gender": "male", "images": ["gary00111.jpg", "gary00112.jpg"]}