{"year_reported": "2012", "month_reported": "07", "username": " alexiavier", "name": " Alexavier Bryson", "age": " 48 or 51", "occupation": " home repare – his spelling", "status": " Divorced", "inet": " 173.0.7.191", "description": "\nAm Alexavier single with two kids am from New Mexico and i live in a city of ALBUQUERQUE Here in United State. I am a very nice person and I crave to have that perfect woman for me I consider myself to be very sincere, loyal and funny. I stick my foot in my mouth at times, we might be okay. I am very nice person quite jokester and i find myself doing fun thing out of now where, getting lost is fun and i make the best of it. i don’t like the bar scene,am a fun-loving, high energy person. I take pride in always looking and doing my best. I have a positive outlook on life and always try to see the glass as half full. I’ve been told I have an out-going personality and great sense of humor. Young at heart, I thoroughly enjoy spending time with my friends and i will be hoping to meet my soul mate.I love God, family, animals, jigsaw puzzles, walks in woods and on beach, Indian Reservations, seeing new places, Chinese food, country living, southern Gospel Romantic, Country, Oldies from 50‘s & 60‘s, other music. slow dancing, comedies such as: Everybody Loves Raymond, Roseanne, Grace Under Fire, Sand ford and Son, The Jefferson, etc., Days of Our Lives, Young and Restless, Walker: Texas Ranger, Medical programs, and Adrian Rogers, Charles Stanley, Joel Osteen who are my 3 favorite preachers. I am basically an honest person, I believe in being faithful in a marriage, and am willing to listen to and take in consideration the other person’s feelings and opinions.I love slow dancing but really don’t know how to dance. I like the feeling of having my woman hold me close, knowing he is as happy to be near me and with me as I am to be with her.\nI’m looking for someone who does not take themselves too seriously; who treats others fairly and is non-judgmental. This special someone would show a kind heart and a love for family, friends, holidays and traditions. I am honest and have a lot of love and life to share. I’m excited about a new, lasting relationship at this stage of my life take good care of our self till i read from you again and stay blessed i will be also i nearly given up on love, because i got hurt and i don;t want it to happen to me again. Am looking for a serious loving caring woman whom i can spend my life with forever. i will not hurt any one, and i don’t want any one to hurt me too. i will give 100% True love with the right lady , who willing to be with me .Life is too short for games. Well if you are interested let me know and we will surely get to know each other smile.", "email": " alexavierbryson@yahoo.com", "tags": ["Male profiles", "blackplanet", "connectingsingles", "romance scammer"], "gender": "male", "images": ["alexiavier1.jpg", "alexiavier2.jpg", "alexiavier3.jpg", "alexiavier4.jpg"]}