{"year_reported": "2017", "month_reported": "12", "username": " aeaton1414", "name": " Alingard", "age": " 51", "occupation": " Microbiologist", "status": " widowed", "inet": " 146.255.57.28", "description": "\nYou found me. Here I am, just testing the waters to see who is out there. I really enjoy meeting people in the real world but am giving online a try. I’d like to find that beautiful type of relationship where life can be shared on a deeper level. I’m looking for someone who is genuine, intelligent and has a good sense of humor – being genuine is very important for me. An ideal long-term relationship is easy to maintain, involves lively discussions, engages our friends and family around us, contains laughter and a mutual pursuit of our passions. I’m unique in that I will not waste time with “shallow” interactions. I’m only open to meaningful, honest, and exclusive relationships with like minded people. I’m not concerned with having tons of friends. A few good friends is all I need. I know it’s hard to get to know someone by just a few photos and a couple of paragraphs, so if you want to get to know me better you should message me. Basically I love life and I love living life. I enjoy the outdoors, traveling, restaurants, laughing, going to cultural events, and socializing with quality people. Its just better living and sharing life with someone else. If you’d like to know more Say “hi”. I didn’t reveal a lot about my Self for you to read on purpose. Rather we chat, talk, engage in conversation to get to know each other instead of us reading through a long page in this section about each other. Also, just because someone looks like a good match “on paper”, doesn’t necessarily translate in reality. P.S. If I send you a message and you happen to read it, please either let me know. Even if you are not interested, just say so. You won’t offend me, I promise.", "email": " alingard14@mail.com", "tags": ["Male profiles", "love scammer"], "gender": "male", "images": ["aeaton14141.jpg"]}