{"year_reported": "2012", "month_reported": "12", "username": " jamestaylor4550", "name": " James Taylor", "age": " 67", "occupation": " Engineering", "status": " widowed", "inet": " 88.198.39.27, 41.58.13.71", "description": "\nI am a Christian I’m an easy going person with a kind and gentle heart, full of love. I’m honest, dependable, loving, gentle, and affectionate. I’m a fun loving, thoughtful, intelligent man with a sense of humor. However, like most of us, I have been deeply hurt and I am now cautious. I have been a workaholic, I’d like to change that and live life. Rather miss out on life I want to take advantage while I have the opportunity in front of me. I love to try new things, and can laugh at my failures. I want to have fun, make friends and find love. I’ll try almost anything once. I take pride in myself, but am not high maintenance. I enjoy making friends, oldies music, singing, and dancing. I love to travel and would love a partner to travel with; cruising is my favorite way to vacation. I like to movies, plays and art. I love to travel, I have seen a good portion of the US. I have been to Spain, Germany,England, Canada, Mexico, the Bahamas. Hopefully you enjoy traveling also. There are quite a few more destinations still on the list of places that just have to be SEEN…\nI’m looking for a with a strong capacity to love and be loved. Kind, her warm heart is evident in the way she treats those least important to her. A fun, playful woman who can embrace adult responsibilities without ever completely growing up and losing the little girl inside. Has some bubble in her personality. In touch with her feelings and emotionally healthy. Has a colorful personality and enjoys romance. Of strong mind, an intellectual with a desire to learn and a curiosity about the world, i am looking for someone special who can be honest with herself & Me,You will find me generous in giving myself to you and easy to chat with on that first date. Finally, I am a gentleman and chivalry is important.", "email": " jamestaylor4550@yahoo.com", "tags": ["Male profiles", "love scammer", "waydate"], "gender": "male", "images": ["jamestaylor45501.jpg", "jamestaylor45502.jpg"]}