{"year_reported": "2013", "month_reported": "05", "username": " Wat4her", "name": " Watson Delle", "age": " 46", "occupation": " Architect", "status": " widowed", "inet": " 64.56.1.140, 196.46.246.57", "description": "\nI’m easy going & extremely Passionate about life, love & especially romance. I’m a Romantic at heart but don’t take it for granted. I can be very intense, bold, & Assertive so I am not weak at heart, however I can be sweet, patient & caring but as i said don’t take it for granted or you’ll see the other side. I’m very deep, knowledgeable & I do say what’s on my mind, i might sound like a know it all and conceited but I’m not i can be pretty humble based on what I’ve been through. I can be intense with exploring my emotions but I’m not going to fall in love with you overnight ( unless we connect spiritually like that) because i believe in getting to know someone through friendship.I’m just sick of games people play. I like a womanwho knows what she wants and is not about the games and drama. i sometimes feel like giving up because to me there are no longer any good men left, women today have forgotten what being a woman means and to let a man be a man,i have to thank god for keeping me strong enough to keep my fate and believing in unconditional love. I want to lay around talking about life, love, and spiritual happiness.I want to go on picnics.and long strolls in the park…I want to lay on the beach at night looking up at the stars wrapped in the arms of that special someone. I want to explore nature, love, & kindred spirits.I don’t want you to change who you are for me and I don’t want to change who I am for you.compromise is good but let’s just be who we are.you should get back to me if you found my profile interesting to you.I want you to strive to be the best you can be… & you should want me to simply do the same.and when we are in our purest form & honest about who we are if we are meant to be well.we will be.and I will be perfect for you & you for me! this is me in my purest truest sense… take it or leave it.I’ve had my past experiences with relationship and within myself and it opened my eyes to so much I needed to see, It was like a bright light of inspiration,a plunging reality into my heart & soul.bringing enlightenment to my spirit. It reminded me of the passion for life I’ve always had and loved…an intense passion I want to share with someone. So i don’t want someone to talk to me just because they think I’m cute or Handsome.", "email": " watson.delle009@yahoo.com", "tags": ["Male profiles", "confirio"], "gender": "male", "images": ["Wat4her1.jpg", "Wat4her2.jpg", "Wat4her3.jpg"]}